Repository: canonical/ubuntu-packaging-guide
Catalog: po/*.po
Languages: es, uk

source: The diff is pretty simple to understand. The ``+`` indicates a line which was added. In our cases it was added just before the second section, starting with ``Package``, which indicates a resulting binary package.
es: Este diff es bastante simple de comprender. El ``+`` indica una línea que ha sido añadida. En nuestros caso se ha añadido justo antes de la segunda sección, comenzado con ``Package``, lo que indica un paquete binario resultante.
uk: Синтаксис diff дуже простий для розуміння. ``+`` вказує рядок, який був доданий. У нашому випадку його було додано безпосередньо перед другою секцією, що починається з ``Package``, яка вказує на готовий двійковий пакунок.

source: It is important to explain to your fellow developers what exactly you did. If you run::
es: Es importante explicar a sus compañeros desarrolladores lo que hizo exactamente. Si ejecuta::
uk: Важливо пояснити своїм колегам - розробникам, що саме Ви зробили. Якщо Ви наберете::

source: this will start an editor with a boilerplate changelog entry which you just have to fill out. In our case something like ``debian/control: Added project's homepage.`` should do. Then save the file. To double-check this worked out, run::
es: esto iniciará un editor con una entrada modelo del registro de cambios (changelog) que solo tiene que rellenar. En nuestro caso bastaría algo como ``debian/control: Added project's homepage.`` (debian/control: añadida página web del proyecto). A continuación guarde el archivo. Para comprobar nuevamente que ha funcionado, ejecute::
uk: це запустить редактор, з шаблоном запису у changelog, який Вам залишається лише дозаповнити. У нашому випадку повинне підійти щось типу ``debian/control: Added project's homepage.`` Потім збережіть файл. Щоб ще раз перевірити, що усе працює, наберіть::

source: and you will see something like this:
es: y verá algo como esto:
uk: й Ви побачите щось типу цього:

source: A few additional considerations:
es: Algunas consideraciones adicionales:
uk: Декілька додаткових міркувань:

source: If you have a reference to a Launchpad bug which is fixed by the issue, add (``LP: #<bug number>``) to the changelog entry line, ie: ``(LP: #123456)``.
es: Si tiene una referencia a un error en Launchpad que ha sido corregido por la incidencia, añada (``LP: #<bug number>``) a la línea de entrada del changelog, por ejemplo ``(LP: #123456)``.
uk: Якщо в Вас є посилання на ваду на Launchpad, яку виправляє Ваша зміна, додайте (``LP: #<номер помилки>``) у запис changelog, наприклад: ``(LP: #123456)``.

source: If you want to get your fix included in Debian, for a Debian bug the syntax is ``(Closes: #<bug number>)``, ie: ``(Closes: #123456)``.
es: Si quiere hacer que su corrección se incluya en Debian, la sintaxis para un bug de Debian es ``(Closes: #<bug number>)``, por ejemplo: ``(Closes: #123456)``.
uk: Якщо Ви бажаєте, щоб Ваше виправлення було включено у Debian, синтаксис для вади в Debian буде ``(Closes: #<номер помилки>)``, наприклад: ``(Closes: #123456)``.

source: If it is a reference to an upstream or Debian bug or a mailing list discussion, mention it as well.
es: Si es una referencia a un error aguas arriba o de Debian o a una discusión en una lista de correo, menciónelo también.
uk: Якщо це посилання на повідомлення про помилку в апстрімі або у Debian, або на обговорення у поштовій розсилці, також вкажіть її.

source: Try to wrap your lines at 80 characters.
es: Intente cortar las líneas a 80 caracteres.
uk: Намагайтеся робити перенесення рядків після 80 символів.

source: Try to be specific, not an essay, but enough for somebody (who did not deeply look into the issue) to understand.
es: Intente ser específico, no es un ensayo, pero describa lo suficiente para que cualquiera (que no haya mirando la incidencia en detalle) pueda comprenderlo.
uk: Намагайтеся викладати детально: не варто писати цілий твір, але вкажіть достатньо інформації, щоб зрозуміти могла будь-яка людина (навіть якщо вона не занурювався глибоко у цю проблему).

source: Mention how you fixed the issue and where.
es: Mencione cómo y dónde corrigió la incidencia.
uk: Вкажіть, як і де Ви виправили помилку.

source: To test the fix, you need to :doc:`have your development environment set up<./getting-set-up>`, then to build the package, install it and verify the problem is solved. In our case this would be::
es: Para probar la corrección necesita configurar su entorno de desarrollo (:doc:`have your development environment set up<./getting-set-up>`), luego compilar el paquete, instalarlo y verificar que se ha solucionado el problema. En nuestro caso sería::
uk: Щоб перевірити виправлення, Вам знадобиться :doc:`налаштувати своє середовище розробки<./getting-set-up>`, потім зібрати пакунок, встановити його й перевірити, що проблему усунено. У нашому випадку це будуть наступні дії::

source: In step one we build the source package from the branch, then build it by using ``pbuilder``, then inspect the resulting package to check if the Homepage field was added properly.
es: En el primer paso compilamos el paquete fuente desde la rama, y luego lo compilamos usando ``pbuilder``, luego inspeccionamos el paquete resultante para comprobar si el campo «Homepage» (página web) se ha añadido correctamente.
uk: Першою командою ми створюємо пакунок джерельного коду з гілки, потім збираємо його за допомогою ``pbuilder``, після чого перевіряємо, чи правильно додано поле домашньої сторінки у пакунку що отримали.

source: In a lot of cases you will have to actually install the package to make sure it works as expected. Our case is a lot easier. If the build succeeded, you will find the binary packages in ``~/pbuilder/<release>_result``. Install them via ``sudo dpkg -i <package>.deb`` or by double-clicking on them in your file manager.
es: En muchos casos tendrá que instalar de verdad el paquete para asegurarse de que funciona como se espera. En nuestro caso es mucho más fácil. Si la compilación tuvo éxito, encontrará los paquetes binarios en ``~/pbuilder/<release>_result``. Instálelos mediante ``sudo dpkg -i <package>.deb`` o haciendo doble clic sobre ellos en el administrador de archivos.
uk: У більшості випадків Вам доведеться дійсно встановити пакунок, щоб перевірити правильність його роботи. Наш випадок на багато простіший. Якщо збірка завершилася з успіхом, готові двійкові пакунки можна буде знайти в ``~/pbuilder/<випуск>_result``. Встановіть їх за допомогою ``sudo dpkg -i <пакунок>.deb`` або подвійного клацу на них у файловому менеджері.

source: As we verified, the problem is now solved, so the next step is sharing our solution with the world.
es: Como hemos verificado, el problema está resuelto, así que el siguiente paso es compartir nuestra solución con el resto del mundo.
uk: Після того, як ми переконалися, що проблема вирішена, наступним кроком буде поділитися своїм рішенням з усім світом.

source: Getting the fix included
es: Conseguir que se incluya la corrección
uk: Застосування виправлення

source: It makes to get fix included as Upstream as possible. Doing that you can guarantee that everybody can take the Upstream source as-is and don't need to have local modifications to fix it.
es: Hace que se incluya la corrección tan aguas arriba como sea posible. Haciéndolo puede garantizar que todo el mundo obtiene el código aguas arriba tal cual es y que no necesita realizar modificaciones locales para arreglarlo.
uk: Важливо спробувати просунути Ваше виправлення як найдалі в upstream. Це дозволить будь-кому взяти джерельний код у тому вигляді, у якому він наданий в upstream, й не застосовувати до нього ніяких додаткових модифікацій.

source: In our case we established that we have a problem with the packaging, both in Ubuntu and Debian. As Ubuntu is based on Debian, we will send the fix to Debian. Once it is included there, it will be picked up by Ubuntu eventually. The issue in our tutorial is clearly non-critical, so this approach makes sense. If it is important to fix the issue as soon as possible, you will need to send the solution to multiple bug trackers. Provided the issue affects all parties in question.
es: En nuestro caso establecimos que tenemos un problema con el empaquetado, tanto en Ubuntu como en Debian. Como Ubuntu se basa en Debian, enviaremos la corrección a Debian. Una vez que se incluya ahí, será recogida por Ubuntu en algún momento. La incidencia en nuestro tutorial claramente es no crítica, así que este enfoque tiene sentido. Si fuera importante corregir la incidencia cuanto antes, necesitará enviar la corrección a varios registros de errores, suponiendo que la incidencia afecte a todas las partes en cuestión.
uk: У нашому випадку ми встановили, що помилка відноситься лише до пакунків Ubuntu і Debian. Оскільки Ubuntu заснована на Debian, ми повинні відправити випралення в Debian. Після того, як в Debian з’явиться виправлений пакунок, він потрапляє також і в Ubuntu. Наша помилка не критична, тому можна так зробити. Якщо ж важливо застосувати виправлення як найшвидше, то необхідно відправити виправлення у декілька баг-трекерів (якщо воно зачепає відповідні проєкти).

source: To submit the patch to Debian, simply run::
es: Para enviar el parche a Debian, simplemente ejecute::
uk: Щоб відправити латку в Debian, просто наберіть::

source: This will take you through a series of steps to make sure the bug ends up in the correct place. Be sure to review the diff again to make sure it does not include random changes you made earlier.
es: Esto le llevará por una serie de pasos para asegurarse de que el error termina en el lugar adecuado. Asegúrese de revisar de nuevo el archivo de differencias (diff) para tener certeza de que no incluye cambios aleatorios que haya realizado anteriormente.
uk: Ця команда проведе Вас через декілька кроків, необхідних для оформлення звіту про ваду й відправки його у правильне місце. Обов’язково продивіться Ваші зміни, щоб переконатися, що там немає нічого зайвого.

source: Communication is important, so when you add some more description to it to the inclusion request, be friendly, explain it well.
es: La comunicación es importante, así que cuando añada algo más de descripción a la petición de inclusión, sea amigable y explíquelo bien.
uk: Комунікація має дуже велике значення, тому при додаванні опису надайте добре та дружнє пояснення.

source: If everything went well you should get a mail from Debian's bug tracking system with more information. This might sometimes take a few minutes.
es: Si todo ha ido bien debería recibir un correo desde el sistema de registro de errores de Debian con más información. Esto podría llevar unos minutos.
uk: Якщо усе пройшло добре, то Ви повинні отримати поштове повідомлення від системи відстежування помилок Debian з додатковою інформацією. Інколи це може зайняти декілька хвилин.

source: If the problem is just in Ubuntu, you might want to consider :doc:`Seeking Review and Sponsorship<./udd-sponsorship>` to get the fix included.
es: Si el problema está solo en Ubuntu, debería considerar pedir que lo revisen y lo patrocinen (:doc:`Seeking Review and Sponsorship<./udd-sponsorship>`) para que se incluya la corrección.
uk: Якщо проблема спостерігається лише в Ubuntu, Ви можете скористатися :doc:`інструкцією з пошуку спонсора<./udd-sponsorship>`.

source: Additional considerations
es: Consideraciones adicionales:
uk: Додаткові зауваження

source: If you find a package and find that there are a couple of trivial things you can fix at the same time, do it. This will speed up review and inclusion.
es: Si encuentra un paquete y existen un par de cosas triviales que puede corregir al mismo tiempo, hágalo. Esto acelerará su revisión e inclusión.
uk: Якщо Ви можете внести у пакунок декілька тривіальних виправлень одразу, зробіть це. Це дозволить розробникам швидше розглянути й застосувати ці зміни.

source: If there are multiple big things you want to fix, it might be advisable to send individual patches or merge proposals instead. If there are individual bugs filed for the issues already, this makes it even easier.
es: Si hay varias cosas importantes que quiera arreglar, sería recomendable enviar parches individuales o peticiones de integración. Si se han rellenado errores independientes para las incidencias, lo hace incluso más fácil.
uk: Якщо Ви бажаєте внести декілька великих змін, краще посилати латки або запити на злиття окремо для кожної зміни. Це простіше, якщо вже створені індивідуяльні повідомлення про вади.

source: Getting Set Up
es: Fase de preparación
uk: Підготовка

source: There are a number of things you need to do to get started developing for Ubuntu. This article is designed to get your computer set up so that you can start working with packages, and upload your packages to Ubuntu's hosting platform, Launchpad. Here's what we'll cover:
es: Hay una serie de cosas que necesita hacer para poder empezar a desarrollar para Ubuntu. Este artículo está diseñado para que pueda configurar su equipo de forma que pueda comenzar a trabajar con paquetes y subirlos a Launchpad, la plataforma de hospedaje de Ubuntu. Los temas cubiertos son:
uk: Існує декілька речей, які потрібно зробити перед початком розробки в Ubuntu. Ця стаття допоможе Вам підготувати комп’ютер до роботи з пакунками й відправці Ваших пакунків на платформу хостингу Ubuntu — Launchpad. Ось що ми розглянемо:

source: Installing packaging-related software. This includes:
es: Instalar software relacionado con el empaquetado. Incluye:
uk: Встановлення проґрам для роботи з пакунками. Вони включають у себе:

source: Ubuntu-specific packaging utilities
es: Utilidades de empaquetado específicas de Ubuntu
uk: специфічні для Ubuntu засоби створення пакунків

source: Encryption software so your work can be verified as being done by you
es: Software de cifrado, para poder verificar que el trabajo se hizo por el usuario indicado
uk: криптографічну проґраму, яка дозволить іншим переконатися, що робота виконана саме Вами

source: Additional encryption software so you can securely transfer files
es: Software de cifrado adicional para poder enviar archivos de forma segura
uk: додаткові проґрами шифрування, що забезпечують безпечне передавання файлів

source: Creating and configuring your account on Launchpad
es: Crear y configurar una cuenta en Launchpad
uk: Створення й налаштування облікового запису на Launchpad

source: Setting up your development environment to help you do local builds of packages, interact with other developers, and propose your changes on Launchpad.
es: Configurar un entorno de desarrollo para ayudarle compilar paquetes localmente, interactuar con otros desarrolladores y proponer sus cambios en Launchpad.
uk: Налаштування Вашого середовища розробки для полегшення локальної збірки пакунків, взаємодії з іншими розробниками й відправки Ваших змін на Launchpad.

source: It is advisable to do packaging work using the current development version of Ubuntu. Doing so will allow you to test changes in the same environment where those changes will actually be applied and used.
es: Se recomienda hacer el trabajo de empaquetado usando la versión actual en desarrollo de Ubuntu. Esto le permitirá probar los cambios en el mismo entorno en el que serán realmente aplicados y usados.
uk: Рекомендується виконувати роботу зі створення пакунків у поточній розроблюваній версії Ubuntu. Це дозволить Вам тестувати зміни у тому ж середовищі, у яке вони у дійсності потім будуть внесені.

source: Don't worry though, the `Ubuntu development release wiki page <https://wiki.ubuntu.com/UsingDevelopmentReleases>`_ shows a variety of ways to safely use the development release.
es: No se preocupe, sin embargo, la «página `Ubuntu development release wiki page <https://wiki.ubuntu.com/UsingDevelopmentReleases>`_ muestra varias formas de usar de forma segura la versión de desarrollo.

source: Install basic packaging software
es: Instalar software básico de empaquetado
uk: Встановлення базового проґрамного забезпечення для створення пакунків

source: There are a number of tools that will make your life as an Ubuntu developer much easier. You will encounter these tools later in this guide. To install most of the tools you will need run this command::
es: Existen varias herramientas que le harán su vida de desarrollador de Ubuntu mucho más fácil. Encontrará estas herramientas más adelante en esta misma guía. Para instalar la mayoría de las herramientas necesitará ejecutar esta orden::
uk: Існує багато інструментів, які можуть значно спростити життя розробнику Ubuntu. Ви познайомитеся з ними далі у цьому посібнику. Щоб встановити більшість інструментів, потрібно виконати таку команду::

source: Note: Since Ubuntu 11.10 "Oneiric Ocelot" (or if you have Backports enabled on a currently supported release), the following command will install the above and other tools which are quite common in Ubuntu development::
es: Nota: desde Ubuntu 11.10 «Oneiric Ocelot» (o si tiene activa las actualizaciones no soportadas en una versión actualmente soportada), el siguiente comando instalará las herramientas anteriores y otras que son bastante habituales en el desarrollo de Ubuntu::
uk: Нотатка: Починаючи з Ubuntu 11.10 «Oneiric Ocelot» (або якщо увімкнений репозиторій Backports у поточному підтримуваному випуску), наступна команда встановлює усе вищезгадане й інші інструменти, що часто використовуються у розробці Ubuntu::

source: This command will install the following software:
es: Esta orden instalará el software siguiente:
uk: Ця команда встановить такі проґрами:

source: ``gnupg`` -- `GNU Privacy Guard`_ contains tools you will need to create a cryptographic key with which you will sign files you want to upload to Launchpad.
es: «gnupg» -- `GNU Privacy Guard`_ contiene herramientas que necesitará para crear una clave criptográfica con la que firmar los archivos que quiera subir a Launchpad.

source: ``pbuilder`` -- a tool to do reproducible builds of a package in a clean and isolated environment.
es: ``pbuilder`` -- una herramienta para realizar compilaciones reproducibles de una paquete en un entorno limpio y aislado.
uk: ``pbuilder`` -- інструмент для створення готових до подальшого розповсюдження збірок пакунків у чистому та ізольованому середовищі.

source: ``ubuntu-dev-tools`` (and ``devscripts``, a direct dependency) -- a collection of tools that make many packaging tasks easier.
es: «ubuntu-dev-tools» (y «devscripts», una dependencia directa) -- una colección de herramientas que hace muchas tareas del empaquetado más sencillas.
uk: ``ubuntu-dev-tools`` (і його безпосередня залежність ``devscripts``) -- набір інструментів, що спрощують багато завдань зі створення пакунків.

source: ``bzr-builddeb`` (and ``bzr``, a dependency) -- distributed version control with Bazaar, a new way of working with packages for Ubuntu that will make it easy for many developers to collaborate and work on the same code while keeping it trivial to merge each other's work.
es: ``bzr-builddeb`` (y ``bzr``, una dependencia) -- sistema de control de versiones distribuido con Bazaar, una nueva forma de trabajar con paquetes para Ubuntu que facilitará a muchos desarrolladores colaborar y trabajar sobre el mismo código, haciendo que resulte sencillo combinar el trabajo de los demás.
uk: ``bzr-builddeb`` (і його залежність -- ``bzr``) -- керування розподіленими версіями за допомогою Bazaar (новий спосіб роботи з пакунками для Ubuntu), що спрощує спільну роботу багатьох людей над одним й тим самим кодом й що дозволяє з легкістю об’єднувати результати їх праці один з одним.

source: ``apt-file`` provides an easy way to find the binary package that contains a given file.
es: «apt-file» proporciona una forma sencilla de encontrar el paquete binario que contiene un archivo determinado.
uk: ``apt-file`` надає простий спосіб знайти двійковий пакунок, що містить заданий файл.

source: Create your GPG key
es: Crear su clave GPG
uk: Створення ключа GPG

source: GPG stands for `GNU Privacy Guard`_ and it implements the OpenPGP standard which allows you to sign and encrypt messages and files. This is useful for a number of purposes. In our case it is important that you can sign files with your key so they can be identified as something that you worked on. If you upload a source package to Launchpad, it will only accept the package if it can absolutely determine who uploaded the package.
es: GPG viene de `GNU Privacy Guard`_ (guardian de privacidad de GNU) e implementa el estándar OpenPGP que le permite firmar y cifrar mensajes y archivos. Es útil para varios propósitos. En nuestro caso es importante que pueda firmar archivos con su clave de forma que puedan identificarse como algo en lo que usted ha trabajado. Si sube un paquete fuente a Launchad, solo lo aceptará si puede determinar absolutamente quién lo ha subido.

source: To generate a new GPG key, run::
es: Para generar una nueva clave GPG, ejecute::
uk: Щоб згенерувати новий ключ GPG, наберіть::

source: GPG will first ask you which kind of key you want to generate. Choosing the default (RSA and DSA) is fine. Next it will ask you about the keysize. The default (currently 2048) is fine, but 4096 is more secure. Afterwards, it will ask you if you want it to expire the key at some stage. It is safe to say "0", which means the key will never expire. The last questions will be about your name and email address. Just pick the ones you are going to use for Ubuntu development here, you can add additional email addresses later on. Adding a comment is not necessary. Then you will have to set a passphrase, choose a safe one (a passphrase is just a password which is allowed to include spaces).
es: GPG primero le preguntará qué tipo de clave desea generar. Elegir el tipo por defecto (RSA y DSA) es correcto. Después le preguntará por el tamaño de la clave. El predeterminado (actualmente 2048) es adecuado, pero 4096 es más seguro. Posteriormente le preguntará si desea que la clave caduque en algún momento. Es seguro decir «0», lo que significa que nunca expirará. Las últimas preguntas serán sobre su nombre y dirección de correo electrónico. Aquí simplemente elija los que quiere usar para el desarrollo de Ubuntu, y puede añadir direcciones de correo electrónico adicionales posteriormente. No es necesario añadir un comentario. Luego tendrá que establecer una frase de paso, elija una segura (una frase de paso es simplemente una contraseña en la que se permite la inclusión de espacios).
uk: GPG спочатку спитає, який тип ключа Ви бажаєте створити. Типовий вибір (RSA и DSA) цілком влаштує. Далі він спитає вказати розмір ключа. Типовий розмір (на цей час 2048) влаштує, але 4096 надійніше. Далі, проґрама спитає, чи бажаєте Ви, щоб термін дії ключа вийшов через якийся час. Безпечніше відповісти "0", що означає, що термін дії не сплине ніколи. Останнє питання буде про Ваше ім’я та адресу електронної пошти. Просто виберіть адресу, якою Ви користуєтеся при розробці Ubuntu, додаткові адреси можна буде додати потім. Додавати коментар не обов’язково. Після цього потрібно вказати надійне парольне гасло (парольне гасло — це просто пароль, у якому дозволяється використовувати пробіли).
