Repository: canonical/ubuntu-packaging-guide
Catalog: po/*.po
Languages: es, uk

source: Our packaging follows the practices of the ``Debian Qt/KDE Team`` and Debian KDE Extras Team. Most of our packages are derived from the packaging of these Debian teams.
es: Nuestro empaquetado sigue las prácticas del «Equipo Debian Qt/KDE» y del equipo Debian KDE Extras. La mayoría de los paquetes se derivan de los empaquetados por esos equipos de Debian.

source: Patching Policy
es: Política de parches
uk: Політика створення латок

source: Kubuntu does not add patches to KDE programs unless they come from the upstream authors or submitted upstream with the expectation they will be merged soon or we have consulted the issue with the upstream authors.
es: Kubuntu no añade parches a los programas KDE a menos que vengan de los autores aguas arriba o se hayan enviado aguas arriba con la expectativa de que sean combinados pronto o hayamos consultado la incidencia con los autores aguas arriba.
uk: Kubuntu додає латки у застосунки KDE, лише якщо вони походять від оригінальних авторів, або якщо вони були відправлені в upstream й є впевненість у їх швидкому прийнятті, або якщо ми обміркували проблеми з розробниками KDE.

source: Kubuntu does not change the branding of packages except where upstream expects this (such as the top left logo of the Kickoff menu) or to simplify (such as removing splash screens).
es: Kubuntu no cambia la marca de los paquetes excepto cuando aguas arriba esperan que se haga (por ejemplo, el logotipo de la parte inferior izquierda del menú de inicio) o para simplificar (por ejemplo, eliminar las pantallas iniciales).
uk: Kubuntu не змінює фірмового оформлення пакунків, крім випадків, коли цього потребує апстрім (наприклад, логотип у горішньому лівому куту меню Kickoff) або для спрощення (наприклад, вилучення показуваних при запуску заставок).

source: Debian packages include some additions to the basic Debhelper usage. These are kept in the ``pkg-kde-tools`` package.
es: Los paquetes de Debian incluyen algunos añadidos al uso básico de Debhelper. Estos añadidos se mantienen en el paquete «pkg-kde-tools».
uk: Пакунки Debian включають деякі доповнення до звичайного використання Debhelper. Вони зберігаються у пакунку ``pkg-kde-tools``.

source: Packages which use Debhelper 7 should add the ``--with=kde`` option. This will ensure the correct build flags are used and add options such as handling kdeinit stubs and translations::
es: Los paquetes que usan Debhelper 7 deberían añadir la opción «--with=kde». Esto asegurará que se usan los marcadores de compilación adecuados y que se añaden opciones como la gestión de los «stubs» de kdeinit y las traducciones::
uk: Пакунки, що використовують Debhelper 7, повинні додати опцію ``--with=kde``. Це дозволить переконатися у використанні правильних прапорців збірки і опцій, таких як обробка завдань kdeinit та файлів перекладу.

source: Some newer KDE packages use the ``dhmk`` system, an alternative to ``dh`` made by the Debian Qt/KDE team. You can read about it in /usr/share/pkg-kde-tools/qt-kde-team/2/README. Packages using this will ``include /usr/share/pkg-kde-tools/qt-kde-team/2/debian-qt-kde.mk`` instead of running ``dh``.
es: Algunos paquetes más modernos de KDE usan el sistema «dhmk», una alternativa a «dh» desarrollada por el equipo QT/KDE de Debian. Puede leer sobre el mismo en /usr/share/pkg-kde-tools/qt-kde-team/2/README. Los paquetes que lo usen incluirán «include /usr/share/pkg-kde-tools/qt-kde-team/2/debian-qt-kde.mk» en lugar de ejecutar «dh».
uk: Деякі нові пакунки KDE використовують систему ``dhmk``, альтернативу ``dh``, створену командою Debian Qt/KDE. Прочитати про неї можна в /usr/share/pkg-kde-tools/qt-kde-team/2/README. Пакунки що її використовують будуть ``включати /usr/share/pkg-kde-tools/qt-kde-team/2/debian-qt-kde.mk`` замість запуску ``dh``.

source: Translations
es: Traducciones
uk: Переклади

source: Packages in main have their translations imported into Launchpad and exported from Launchpad into Ubuntu's language-packs.
es: Las traducciones de los paquetes de «main» en se importan en Launchpad y se exportan de Launchpad a los paquetes de idiomas de Ubuntu.
uk: Переклади пакунків з репозиторію main імпортуються на Launchpad і експортуються з Launchpad у мовні пакунки Ubuntu.

source: So any KDE package in main must generate translation templates, include or make available upstream translations and handle ``.desktop`` file translations.
es: Así que todos los paquetes de «main» de KDE deben generar plantillas de traducción, incluir o hacer disponibles aguas arriba las traducciones y gestionar los archivos «.desktop» de traducciones.
uk: Отже, кожен KDE-пакунок в main повинен створювати шаблони перекладів, включати оригінальні переклади і опрацьовувати рядки що перекладаються у ``.desktop``-файлах.

source: To generate translation templates the package must include a ``Messages.sh`` file; complain to the upstream if it does not. You can check it works by running ``extract-messages.sh`` which should produce one or more ``.pot`` files in ``po/``. This will be done automatically during build if you use the ``--with=kde`` option to ``dh``.
es: Para generar las plantillas de traducción el paquete debe incluir un archivo «Messages.sh»; quéjese aguas arriba si no lo hace. Puede comprobar si funciona ejecutando «extract-messages.sh» lo que debería producir uno o más archivos «.pot» en el directorio «po/». Esto se hará automáticamente durante la compilación si usa la opción «--with=kde» de «dh».
uk: Для генерації шаблонів перекладів пакунок повинен містити файл ``Messages.sh``; якщо його там немає, зверніться в апстрім. Перевірити його роботу можна, виконавши сценарій ``extract-messages.sh``, який повинен створити один або декілька файлів ``.pot`` у каталозі ``po/``. У процесі збирання це буде зроблено автоматично, якщо Ви використовуєте опцію ``--with=kde`` для ``dh``.

source: Upstream will usually have also put the translation ``.po`` files into the ``po/`` directory. If they do not, check if they are in separate upstream language packs such as the KDE SC language packs. If they are in separate language packs Launchpad will need to associate these together manually, contact `dpm`_ to do this.
es: Normalmente aguas arriba ya habrán puesto también los archivos de traducciones «.po» en el directorio «po/». Si no lo han hecho, compruebe si están aguas arriba en paquetes de idiomas separados, como los paquetes de idiomas de KDE SC. Si lo están Launchpad necesitará asociarlos de forma manual. Contacte con `dpm`_ para hacerlo.

source: If a package is moved from universe to main it will need to be re-uploaded before the translations get imported into Launchpad.
es: Si un paquete se mueve desde «universe» a «main» tendrá que ser vuelto a subir antes de que las traducciones se importen en Launchpad.
uk: Якщо пакунок переміщений з universe в main, його слід перевивантажити перед імпортом перекладів на Launchpad.

source: ``.desktop`` files also need translations. We patch KDELibs to read translations out of ``.po`` files which are pointed to by a line ``X-Ubuntu-Gettext-Domain=`` added to ``.desktop`` files at package build time. A .pot file for each package is be generated at build time and .po files need to be downloaded from upstream and included in the package or in our language packs. The list of .po files to be downloaded from KDE's repositories is in ``/usr/lib/kubuntu-desktop-i18n/desktop-template-list``.
es: Los archivos «.desktop» también necesitan traducciones. Se parchea KDELibs para que lea las traducciones de los archivos «.po» que están apuntados por una línea «X-Ubuntu-Gettext-Domain=» añadida a los archivos «.desktop» en el momento de compilar el paquete. Se genera un archivo .pot para cada paquete en el momento de la compilación y los archivos .po necesarios se descargan desde aguas arriba y se incluyen en el paquete o en los paquetes de idiomas. La lista de archivos .po a descargar de los repositorios de KDE está en «/usr/lib/kubuntu-desktop-i18n/desktop-template-list».
uk: Файли ``.desktop`` також потребують перекладу. Ми додали латку до KDELibs для читання перекладів з ``.po``-файлів, що вказують на рядок ``X-Ubuntu-Gettext-Domain=``, що додається до файлів ``.desktop`` під час збірки пакунку. Файл .pot для кожного пакунку генерується під час збірки й .po-файли необхідно стягнути з апстріму і включити у пакунок або в наші мовні пакунки. Перелік .po-файлів, які потрібно стягнути зі сховищ KDE, знаходиться в ``/usr/lib/kubuntu-desktop-i18n/desktop-template-list``.

source: Library Symbols
es: Símbolos de biblioteca
uk: Бібліотекові символи

source: Library symbols are tracked in ``.symbols`` files to ensure none go missing for new releases. KDE uses C++ libraries which act a little differently compared to C libraries. Debian's Qt/KDE Team have scripts to handle this. See `Working with symbols files`_ for how to create and keep these files up to date.
es: Los símbolos de biblioteca se rastrean en archivos «.symbols» para asegurarse de que no falta ninguno para las nuevas emisiones. KDE usa bibliotecas C++ que actuan de forma ligeramente diferente a como lo hacen las de C. El equipo Qt/KDE de Debian dispone de scripts para gestionarlo. Véase `Working with symbols files`_ (trabajar con archivos de símbolos) para saber cómo crear y mantener actualizados estos archivos.

source: Shared Libraries
es: Bibliotecas compartidas
uk: Спільні бібліотеки

source: Shared libraries are compiled code which is intended to be shared among several different programs. They are distributed as ``.so`` files in ``/usr/lib/``.
es: Las bibliotecas compartidas es código compilado que se supone que será compartido por diferentes programas. Se distribuyen como archivos «.so» en «/usr/lib/».
uk: Спільні бібліотеки — це скомпільований код, призначений для спільного використання декількома різними проґрамами. Вони розповсюджуються у вигляді файлів ``.so`` в ``/usr/lib/``.

source: A library exports symbols which are the compiled versions of functions, classes and variables. A library has a name called an SONAME which includes a version number. This SONAME version does not necessarily match the public release version number. A program gets compiled against a given SONAME version of the library. If any of the symbols is removed or changes then the version number needs to be changed which forces any packages using that library to be recompiled against the new version. Version numbers are usually set by upstream and we follow them in our binary package names called an ABI number, but sometimes upstreams do not use sensible version numbers and packagers have to keep separate version numbers.
es: Una biblioteca exporta símbolos que son versiones compiladas de funciones, clases y variables. Una biblioteca tiene un nombre denominado SONAME que incluye un número de versión. Esta versión de SONAME no tiene por qué coincidir con el número de versión de emisión pública. Un programa se compila contra una versión determinada de SONAME de la biblioteca. Si cualquiera de los símbolos es eliminado o modificado, entonces el número de versión debe ser cambiado lo que fuerza que que cualquier paquete que use la biblioteca sea recompilado contra la nueva versión. Los números de versiones normalmente son establecidos aguas arriba y los mantenemos en los nombres de los paquetes binarios, llamado número ABI, pero en ocasiones aguas arriba no usan números de versiones razonables y los empaquetadores tienen que mantener números de versiones separados.
uk: Бібліотеки експортують символи у скомпільованому вигляді: функції, кляси та змінні. В кожної бібліотеки також є назва SONAME, що включає номер її версії, але який не обов’язково збігається з офіційним номером релізу. Проґрами компілюються з конкретним SONAME бібліотеки. Так, якщо якийсь з символів бібліотеки був вилучений або змінений -- небхідно змінити версію з тим, щоб усі залежні від бібліотеки пакунки були перекомпільовані з використанням нової версії. Зазвичай версії встановлюються у джерелі, й ми використовуємо ті ж номери версій для двійкових пакунків, що називаються "номер ABI", але у випадку, якщо джерело не використовує притомної версійності, творці пакунків можуть використовувати окрему, традиційнішу нумерацію.

source: Libraries are usually distributed by upstream as standalone releases. Sometimes they are distributed as part of a program. In this case they can be included in the binary package along with the program (this is called bundling) if you do not expect any other programs to use the library, more often they should be split out into separate binary packages.
es: Las bibliotecas se distribuyen normalmente aguas arriba como emisiones independientes. Algunas veces se distribuyen como partes de un programa. En este caso se pueden incluir en el paquete binario junto con el programa (esto se denomina «bundling», atado) si no espera que ningún otro programa use la biblioteca, pero lo más frecuente es que sean separadas en paquetes binarios independientes.
uk: Бібліотеки зазвичай розповсюджуються апстрімом у вигляді окремих випусків. Інколи вони розповсюджуються, як частина проґрами. У останньому випадку вони можуть бути включені у двійковий пакунок разом з проґрамою (це зветься bundling), якщо Ви не припускаєте використання цих бібліотек іншими проґрамами, але частіше їх усе ж слід виділяти у окремі двійкові пакунки.

source: The libraries themselves are put into a binary package named ``libfoo1`` where ``foo`` is the name of the library and ``1`` is the version from the SONAME. Development files from the package, such as header files, needed to compile programs against the library are put into a package called ``libfoo-dev``.
es: Las propias bibliotecas se meten en un paquete binario llamado «libfoo1» donde «foo» es el nombre de la biblioteca y «1» es la versión del SONAME. Los archivos de desarrollo del paquete, como los archivos de cabecera, necesitan compilar programas contra la biblioteca que se ha metido en el paquete llamado «libfoo-dev».
uk: Самі бібліотеки поміщаються у двійковий пакунок з іменем ``libfoo1``, де ``foo`` — ім’я бібліотеки, а ``1`` — версія з SONAME. Файли розробки з пакунку, такі як заголовкові файли, необхідні для компілювання проґрам з бібліотекою, поміщаються у пакунок з іменем ``libfoo-dev``.

source: An Example
es: Un ejemplo
uk: Приклад

source: We will use libnova as an example::
es: Usaremos libnova como un ejemplo::
uk: У якості прикладу ми використовуємо libnova::

source: To find the SONAME of the library run::
es: Para encontrar el SONAME de una biblioteca ejecute::
uk: Щоб знайти SONAME бібліотеки, виконайте::

source: The SONAME is ``libnova-0.12.so.2``, which matches the file name (usually the case but not always). Here upstream has put the upstream version number as part of the SONAME and given it an ABI version of ``2``. Library package names should follow the SONAME of the library they contain. The library binary package is called ``libnova-0.12-2`` where ``libnova-0.12`` is the name of the library and ``2`` is our ABI number.
es: El SONAME es «libnova-0.12.so.2», lo que coincide con el nombre del archivo (es lo normal, pero no siempre ocurre). En este caso aguas arriba han puesto el número de versión como parte del SONAME y le han dado una versión ABI de «2». Los nombres de paquetes de bibliotecas deberían seguir el SONAME de la biblioteca que contienen. El paquete binario de la biblioteca se llama «libnova--0.12-2», donde «libnova--0.12» es el nombre de la biblioteca y «2» es nuestro número ABI.
uk: SONAME у даному випадку ``libnova-0.12.so.2``, що відповідає імені файлу (як правило, але не завжди). Тут апстрім помістив номер версії з апстріму, як частину SONAME, й задав ABI-версію ``2``. Імена бібліотекових пакунків повинні слідувати SONAME бібліотеки, яку вони містять. Двійковий бібліотековий пакунок зветься ``libnova-0.12-2``, де ``libnova-0.12`` — ім’я бібліотеки, а ``2`` — наш ABI-номер.

source: If upstream makes incompatible changes to their library they will have to reversion their SONAME and we will have to rename our library. Any other packages using our library package will need to recompiled against the new version, this is called a transition and can take some effort. Hopefully our ABI number will continue to match upstream's SONAME but sometimes they introduce incompatibilities without changing their version number and we will need to change ours.
es: SI aguas arriban hacen cambios incompatible a su biblioteca tendrá que revisionar su SONAME y nosotros tendremos que cambiar de nombre a nuestra biblioteca. Cualquier otro paquete que use nuestra biblioteca deberá ser recompilado contra la nueva versión, esto es lo que se llama una transición y puede suponer cierto esfuerzo. Afortunadamente nuestro número ABI seguirá coincidiendo con el SONAME de aguas arriba, pero en ocasiones se introducen incompatibilidades sin cambiar el número de versión lo que nos fuerza a hacer cambios en el nuestro.
uk: Якщо автори з апстріму внесли несумісні зміни у свою бібліотеку, вони повинні змінити номер версії SONAME, а ми повинні перейменувати нашу бібліотеку. Будь-які інші пакунки, що використовують наш бібліотековий пакунок, потрібно буде перекомпілювати з новою версією, це зветься переходом (transition) й потребує певних зусиль. Потрібно сподіватися, наш ABI-номер продовжить відповідати SONAME апстріму, але інколи вони вносять несумісності без зміни їх номеру версії, а нам потрібно змінити наш.

source: Looking in debian/libnova-0.12-2.install we see it includes two files::
es: Si miramos en debian/libnova-0.12-2.install vemos que incluye estos dos archivos::
uk: Поглянувши на debian/libnova-0.12-2.instal, ми побачимо, що він включає у себе два файли::

source: The last one is the actual library, complete with minor and point version number. The first one is a symlink which points to the actual library. The symlink is what programs using the library will look for, the running programs do not care about the minor version number.
es: El último es la biblioteca en sí, completada con el número de menor de la versión y punto. El primero es un enlace simbólico que apunta a la biblioteca real. El enlace simbólico es lo que buscarán los programas que empleen la biblioteca, ya que los programas que se ejecutan no se preocupan por el número de menor de la versión.
uk: Другий рядок — справжня бібліотека, з повним номером версії. Перше — символьне посилання, що вказує на справжню бібліотеку. Проґрами, що використовують бібліотеку, как правило, будуть користуватися символічним посиланням.

source: ``libnova-dev.install`` includes all the files needed to compile a program with this library. Header files, a config binary, the ``.la`` libtool file and ``libnova.so`` which is another symlink pointing at the library, programs compiling against the library do not care about the major version number (although the binary they compile into will).
es: «libnova-dev.install» incluye todo los archivos necesarios para compilar un programa con esta biblioteca. Los archivo de cabeceras, una configuración binaria, el archivo «.la» de libtool que es otro enlace simbólico apuntando a la misma biblioteca, programas compilados contra la biblioteca no se preocupan del número mayor de la versión (aunque el binario en el que se compilarán sí lo hará).
uk: ``libnova-dev.install`` містить усі файли, необхідні для компілювання проґрами з даною бібліотекою. Заголовкові файли, бінарник конфігурації, файл libtool'a ``.la``, а також ``libnova.so`` -- ще один симлінк на бібліотеку, створюваний з тим, щоб проґрами могли компілюватися поза залежністю від старшого номеру версії (при цьому, скомпільваний застосунок все одно буде залежати від версії).

source: ``.la`` libtool files are needed on some non-Linux systems with poor library support but usually cause more problems than they solve on Debian systems. It is a current `Debian goal to remove .la files`_ and we should help with this.
es: Los archivos «.la» de libtool son necesarios en algunos sistemas no-Linux con soporte de bibliotecas pobre, pero en sistemas Debian normalmente causan más problemas que los que resuelven. Actualmente es un objetivo de Debian eliminar los archivos .la `Debian goal to remove .la files`_ y deberíamos ayudar a hacerlo.

source: Static Libraries
es: Bibliotecas estáticas
uk: Статичні бібліотеки

source: The -dev package also ships ``usr/lib/libnova.a``. This is a static library, an alternative to the shared library. Any program compiled against the static library will include the code directory into itself. This gets round worrying about binary compatibility of the library. However it also means that any bugs, including security issues, will not be updated along with the library until the program is recompiled. For this reason programs using static libraries are discouraged.
es: El paquete -dev también incluye «usr/lib/libnova.a». Es una biblioteca estática, una alternativa a las librerías compartidas. Cualquier programa compilado contra una biblioteca estática incluya el directorio de código dentro de sí mismo. Esto evita tener que preocuparse sobre la compatibilidad binaria de la biblioteca. Sin embargo, también significa que cualquier error, incluyendo las incidencias de seguridad, no serán actualizados junto con la biblioteca hasta que se recompile el programa. Por esta razón se desaconseja el uso de programas que usen librerías estáticas.
uk: Пакунок -dev також містить ``usr/lib/libnova.a``. Це статична бібліотека, альтернатива спільній бібліотеці. Будь-яка проґрама, скомпільована зі статичною бібліотекою, містить її код безпосередньо у собі. Це дозволяє не бентежитися про двійкову сумісність бібліотеки. Втім це також значить, що будь-які помилки, у тому числі вразливості у безпеці, не будуть виправлені за рахунок оновлення бібліотеки, поки проґрама не буде перекомпільована. З цієї причини використовувати проґрами з статичними бібліотеками не радимо.

source: Symbol Files
es: Archivos de símbolos
uk: Символьні файли

source: When a package builds against a library the ``shlibs`` mechanism will add a package dependency on that library. This is why most programs will have ``Depends: ${shlibs:Depends}`` in ``debian/control``. That gets replaced with the library dependencies at build time. However shlibs can only make it depend on the major ABI version number, ``2`` in our libnova example, so if new symbols get added in libnova 2.1 a program using these symbols could still be installed against libnova ABI 2.0 which would then crash.
es: Cuando un paquete se compila contra una biblioteca el mecanismo de «shlibs» añadirá una dependencia del paquete a esa biblioteca. Este es el motivo de que la mayoría de los programas tengan «Depends: ${shlibs:Depends}» en el archivo «debian/control». Eso se sustituye por las dependencias de la biblioteca en tiempo de compilación. Sin embargo, shlibs solo puede hacerla depender del número mayor de versión ABI, «2» en el ejemplo, así que si se añaden nuevos símbolos a libnova 2.1 un programa que use estos símbolos podría todavía seguir instalado contra libnova ABI 2.0, lo que podría producir un fallo.
uk: Коли додаток компілюється з бібліотекою, механізм ``shlibs`` додасть до пакунку залежність від цієї бібліотеки. Саме тому більшість проґрам містять ``Depends: ${shlibs:Depends}`` у файлі ``debian/control``. Це замінюється переліком залежних бібліотек при білді. Втім shlibs може лише вказувати залежність від старшої ABI-версії , ``2`` у нашому прикладі з libnova, тож якщо нові символи будуть додані у майбутній libnova 2.1 -- застосунок буде запускатися й зі старішою версією libnova ABI 2.0, що призведе до аварійного завершення.
