Repository: canonical/ubuntu-packaging-guide
Catalog: po/*.po
Languages: es, uk

source: Upstream (and Debian) bug tracker (open and closed bugs),
es: El sistema de seguimiento de errores (abiertos y cerrados) del proyecto original (y de Debian)
uk: Система відстеження помилок апстріму (й Debian) — відкриті та закриті помилки,

source: Upstream revision history (or newer release) might have fixed the problem,
es: El historial de cambios del proyecto original (o una versión más reciente) podría haber corregido el problema.
uk: Історія версій в апстрімі (або у новій версії) може містити відомості про виправлення помилки,

source: bugs or package uploads of Debian or other distributions.
es: La subida de errores o paquetes de Debian u otras distribuciones
uk: звіти про вади й нові версії пакунків в Debian та інших дистрибутивах.

source: You now want to create a patch which includes the fix. The command ``edit-patch`` is a simple way to add a patch to a package. Run::
es: En este momento desea crear un parche que incluya la solución. La orden «edit-patch» es una forma simple de añadir un parche a un paquete. Ejecute::
uk: Тепер можна створити латку, яка містить виправлення помилки. Команда ``edit-patch`` — найпростіший спосіб додати латку до пакунку. Виконайте::

source: This will copy the packaging to a temporary directory. You can now edit files with a text editor or apply patches from upstream, for example::
es: Esto copiara el paquete a un directorio temporal. Ahora ya puede editar los archivos con un editor de textos o aplicar parches desde el proyecto original, por ejemplo::
uk: Ця команда скопіює файли, необхідні для збірки пакунку, у тимчасову директорію. Ви можете змінювати ці файли у текстовому редакторі або застосовувати латки з upstream, наприклад::

source: After editing the file type ``exit`` or press ``control-d`` to quit the temporary shell. The new patch will have been added into ``debian/patches``.
es: Completada la edición escriba «exit» o pulse «Ctrl+D» para abandonar el intérprete de órdenes temporal. El nuevo parche se habrá añadido a «debian/patches».
uk: Після редагування файлу наберіть ``exit`` або натисніть ``control-d``, щоб вийти з тимчасової командної оболонки. Нова латка буде додана в ``debian/patches``.

source: Testing the fix
es: Probar la solución
uk: Тестування виправлення

source: To build a test package with your changes, run these commands::
es: Para crear un paquete de prueba con los cambios, ejecute estas órdenes::
uk: Щоб зібрати тестовий пакунок з Вашими змінами, виконайте такі команди::

source: This will create a source package from the branch contents (``-us -uc`` will just omit the step to sign the source package) and ``pbuilder-dist`` will build the package from source for whatever ``release`` you choose.
es: Esto creará un paquete fuente a partir de los contenidos de la rama («-us -uc» simplemente omitirá el paso de la firma de los paquetes fuente) y «pbuilder-dist» construirá el paquete a partir del fuente para la versión que haya elegido.
uk: Це створить пакунок джерельного коду з вмісту гілки (``-us -uc`` просто дозволяє пропустити етап підписування пакунку джерельного коду), а ``pbuilder-dist`` збере пакунок із джерельного коду для будь-якого вибраного Вами ``релізу``.

source: Once the build succeeds, install the package from ``~/pbuilder/<release>_result/`` (using ``sudo dpkg -i <package>_<version>.deb``). Then test to see if the bug is fixed.
es: Cuando la compilación concluya con éxito, instale el paquete desde «~/pbuilder/<release>_result/» (use «sudo dpkg -i <paquete>_<versión>.deb»). Compruebe entonces si se ha corregido el error.
uk: Після успішного завершення збірки встановіть пакунок з ``~/pbuilder/<release>_result/`` (за допомогою ``sudo dpkg -i <пакунок>_<версія>.deb``). Потім перевірте, чи вдалося усунути помилку.

source: Documenting the fix
es: Documentar la solución
uk: Документування виправлення

source: It is very important to document your change sufficiently so developers who look at the code in the future won't have to guess what your reasoning was and what your assumptions were. Every Debian and Ubuntu package source includes ``debian/changelog``, where changes of each uploaded package are tracked.
es: Es muy importante documentar con suficiente detalle los cambios que se hacen, de tal forma que los desarrolladores que revisen el código en el futuro no tengan que imaginar su razonamiento y sus supuestos cuando lo hizo. Cada paquete fuente de Debian y Ubuntu contiene un archivo «debian/changelog» donde se mantienen los cambios de cada paquete subido.
uk: Дуже важливо документувати свої зміни у достатній мірі, щоб розробникам потім не довелося здогадуватися, якими були причини й передумови зроблених Вами змін. Кожен пакунок джерельного коду Debian та Ubuntu включає у себе файл ``debian/changelog``, у якому відстежуються вносювані у пакунок зміни.

source: The easiest way to update this is to run::
es: La manera más fácil de actualizar esto es ejecutar::
uk: Найпростіший спосіб оновити його — це виконати::

source: This will add a boilerplate changelog entry for you and launch an editor where you can fill in the blanks. An example of this could be::
es: Esto añadirá una entrada modelo al registro de cambios y lanzará un editor en el que poder rellenar los campos vacíos. Un ejemplo podría ser::
uk: Ця команда додасть у файл шаблон запису й запустить редактор, у якому Ви зможете додати інформацію якої бракує. Ось приклад цього запису::

source: ``dch`` should fill out the first and last line of such a changelog entry for you already. Line 1 consists of the source package name, the version number, which Ubuntu release it is uploaded to, the urgency (which almost always is 'low'). The last line always contains the name, email address and timestamp (in :rfc:`5322` format) of the change.
es: «dch» debería rellenar por usted la primera y última línea de la entrada en el registro de cambios. La línea 1 contiene el nombre del paquete fuente, la número de versión, la emisión de Ubuntu a la que va dirigida, la urgencia (que casi en todos los casos es «low», baja). La última línea siempre contiene el nombre, la dirección de correo y la fecha y hora (en formato :rfc: «5322») del cambio.
uk: Команда ``dch`` повинна заповнити перший і останній рядок цього запису у файлі changelog. Перший рядок містить ім’я пакунку джерельного коду, номер його версії, у який реліз Ubuntu він завантажений, терміновість (майже завжди низька — 'low'). Останній рядок завжди містить ім’я, адресу електронної пошти та мітку часу змінювання (у форматі :rfc:`5322`).

source: With that out of the way, let's focus on the actual changelog entry itself: it is very important to document:
es: Realizado todo esto, céntrese en la propia entrada del registro de cambios: es muy importante documentar:
uk: Тепер давайте сфокусуємося на тому що має міститися у самому запису файлу changelog. Дуже важливо задокументувати:

source: where the change was done
es: dónde se hizo el cambio
uk: де зроблено зміну

source: what was changed
es: qué se ha cambiado
uk: що було змінено

source: where the discussion of the change happened
es: dónde ocurrió la discusión acerca del cambio
uk: де відбувалося обговорення цієї зміни

source: In our (very sparse) example the last point is covered by ``(LP: #123456)`` which refers to Launchpad bug 123456. Bug reports or mailing list threads or specifications are usually good information to provide as a rationale for a change. As a bonus, if you use the ``LP: #<number>`` notation for Launchpad bugs, the bug will be automatically closed when the package is uploaded to Ubuntu.
es: En este (muy sencillo) ejemplo el último punto se cubre por «(LP: #123456)» que se refiere al reporte 123456 en Launchpad. Los reportes de errores, discusiones en listas de correos y documentos de especificaciones son buenas fuentes de información que justifican las razones por las cuales se hacen los cambios. Como ventaja adicional, si se usa la notación «LP: #<número>» para de los errores de Launchpad, dichos errores se cerrarán automáticamente cuando los cambios se suban a Ubuntu.
uk: У нашому (досить поодинокому) прикладі останньому пункту відповідає ``(LP: #123456)``, тобто посилання на помилку на Launchpad з номером 123456. Звіти про вади, теми переліків розсилки або специфікації зазвичай є добрими джерелами інформації для обґрунтування змін. У якості додаткового заохочення, якщо Ви використовуєте нотацію ``LP: #<номер>`` для помилок на Launchpad, то помилка автоматично отримає статус закритої при відправці пакунку в Ubuntu.

source: Committing the fix
es: Aplicar la solución
uk: Закріплення зміни

source: With the changelog entry written and saved, you can just run::
es: Con la entrada del registro de cambios escrita y guardada, puede ejecutar simplemente::
uk: Написавши і зберігши запис в changelog, ми можемо просто запустити::

source: and the change will be committed (locally) with your changelog entry as a commit message.
es: y se aplicarán los cambios (localmente) con la entrada del archivo registro de cambios como mensaje de la confirmación.
uk: й зміну буде залито (локально) з Вашим записом changelog у якості повідомлення комміту.

source: To push it to Launchpad, as the remote branch name, you need to stick to the following nomenclature::
es: Para enviar los cambios a Launchpad, con el nombre de la rama remota, se debe mantener la siguiente nomenclatura::
uk: Для Launchpad-сховища, у який відправляти Ваші зміни, використовуйте таке ім’я::

source: This could for example be::
es: Un ejemplo podría ser::
uk: Це може бути, наприклад::

source: So if you just run::
es: Así, si ejecuta::
uk: Тож, якщо Ви просто виконаєте::

source: you should be all set. The push command should push it to Launchpad and the second command will open the Launchpad page of the remote branch in your browser. There find the "(+) Propose for merging" link, click it to get the change reviewed by somebody and included in Ubuntu.
es: habrá finalizado el proceso. La orden «push» envía los cambios a Launchpad y la segunda orden abre la página de Launchpad en la rama remota en su navegador. Localice ahí en enlace «(+) Propose for merging», púlselo para que se revise el cambio por algún desarrollador y se incluya en Ubuntu.
uk: усе повинно бути готово. Команда push виконає відправку на Launchpad, а друга команда відкриє сторінку віддаленої гілки на Launchpad у Вашому оглядачі. Найдіть там посилання «(+) Propose for merging» й клацніть на ньому, щоб хтось перевірив зміну і включив її в Ubuntu.

source: Our article about :doc:`seeking sponsorship<./udd-sponsorship>` goes into more detail about getting feedback for your proposed changes.
es: Nuestro artículo sobre :doc:`seeking sponsorship<./udd-sponsorship>` entra en más detalle sobre cómo obtener respuesta a los cambios propuestos.
uk: Наша стаття про :doc:`пошук поручительства<./udd-sponsorship>` надає додаткові подробиці про отримання зворотнього зв’язку для запропонованих Вами змін.

source: If your branch fixes issues in stable releases or it is a security fix, you might want to have a look at our :doc:`Security and stable release updates<./security-and-stable-release-updates>` article.
es: Si su rama correge incidencias en versiones estables o es una corrección de seguridad, es posible que le interese echar un vistazo al artículo :doc:`Security and stable release updates<./security-and-stable-release-updates>`.
uk: Якщо Ваша гілка виправляє помилку у стабільному випуску або це виправлення безпеки, прочитайте нашу статтю :doc:`Оновлення безпеки й стабільних випусків<./security-and-stable-release-updates>`.

source: Tutorial: Fixing a bug in Ubuntu
es: Tutorial: corregir un error en Ubuntu
uk: Демонстрація: виправлення помилки в Ubuntu

source: While the mechanics for :doc:`fixing a bug<./fixing-a-bug>` are the same for every bug, every problem you look at is likely to be different from another. An example of a concrete problem might help to get an idea what to consider generally.
es: Aunque los mecanismos para corregir un error (:doc:`fixing a bug<./fixing-a-bug>`) son los mismos para cada error, cada problema al que se enfrente es probable que sea distinto de los demás. Un ejemplo de un problema concreto le podría ayudar a formar una idea de lo que tener en cuenta de forma general.
uk: Хоч техніка :doc:`виправлення помилки<./fixing-a-bug>` однакова для будь-яких помилок, кожна помилка все ж у чомусь відрізняється від інших. Даний приклад виправлення конкретної помилки може допомогти Вам зрозуміти, що зазвичай потрібно прийняти до уваги.

source: At the time of writing this article this was not fixed yet. When you are reading the article this might actually be fixed. Take this as an example and try to adapt it to the specific problem you are facing.
es: En el momento de escribir este artículo esto no había sido corregido todavía, aunque es posible que para cuando esté leyéndolo ya se haya solucionado. Tómelo como un ejemplo e intente adaptarlo al problema concreto que está afrontando.
uk: Під час написання даної статті ця помилка ще не була виправлена. Можливо, до того часу, коли Ви будете читати статтю, помилку вже виправлять. Вважайте це просто прикладом й постарайтеся адаптувати його до конкретної проблеми, з якою Ви зіштовхнетеся.

source: Confirming the problem
es: Confirmar el problema
uk: Підтвердження проблеми

source: Let's say the package ``bumprace`` does not have a homepage in its package description. As a first step you would check if the problem is not solved already. This is easy to check, either take a look at Software Center or run::
es: Digamos que el paquete ``bumprace`` no tiene una página web en su descripción. Como primer paso podría comprobar que el problema no esté ya resulento. Es fácil de hacer, bien mirando al Centro de software o ejecutando::
uk: Припустимо, у описі пакунку ``bumprace`` відсутня інформація про його домашню сторінку. У якості першого кроку, слід перевірити, чи не виправлена вже ця помилка. Зробити це просто: подивіться у Центрі додатків або запустіть::

source: The output should be similar to this::
es: La salida debería ser algo parecido a esto::
uk: Вивід команди повинен бути приблизно таким::

source: A counter-example would be ``gedit``, which has a homepage set::
es: Un contraejemplo sería ``gedit``, el cual tiene definida una página web::
uk: У якості контрприкладу можна привести ``gedit``, де домашня сторінка вказана::

source: Sometimes you will find that a particular problem you are looking into is already fixed. To avoid wasting efforts and duplicating work it makes sense to first do some detective work.
es: A veces se encontrará con que un problema concreto que estaba mirando ya ha sido corregido. Para evitar desperdiciar esfuerzos y duplicar trabajos tiene sentido realizar antes cierto trabajo de investigación.
uk: У деяких випадках Ви можете зіштовхнутися з тим, що проблема, вирішення якої Ви шукаєте, вже кимось усунена. Щоб уникнути даремного витрачення часу й праці, має сенс проробити деяку детективну роботу.

source: Research bug situation
es: Investigar la situación de un error
uk: Вивчення ситуації з помилкою

source: First we should check if a bug for the problem exists in Ubuntu already. Maybe somebody is working on a fix already, or we can contribute to the solution somehow. For Ubuntu we have a quick look at https://bugs.launchpad.net/ubuntu/+source/bumprace and there is no open bug with our problem there.
es: Primero debería comprobar si ya existe un informe de error para el problema en Ubuntu. Quizá ya haya alguien trabajando en una corrección o podamos contribuir de alguna forma a la solución. Para Ubuntu echamos un vistazo rápido a https://bugs.launchpad.net/ubuntu/+source/bumprace y vemos que no hay un error abierto aquí para nuestro problema.
uk: Спочатку потрібно перевірити, чи не існує вже повідомлення про цю помилку в Ubuntu. Можливо, хтось вже працює над її виправленням, або ми можемо якось внести свій внесок у вирішення цієї проблеми. Для Ubuntu ми поглянемо на https://bugs.launchpad.net/ubuntu/+source/bumprace й побачимо, що відкритого звіту про нашу ваду там немає.

source: For Ubuntu the URL ``https://bugs.launchpad.net/ubuntu/+source/<package>`` should always take to the bug page of the source package in question.
es: Para Ubuntu la URL ``https://bugs.launchpad.net/ubuntu/+source/<package>`` siempre debería llevar la página de error del paquete fuente en cuestión.
uk: Для Ubuntu URL ``https://bugs.launchpad.net/ubuntu/+source/<пакунок>`` завжди приводить на сторінку помилок у вказаномум пакунку джерельного коду.

source: For Debian, which is the major source for Ubuntu's packages, we have a look at http://bugs.debian.org/src:bumprace and can't find a bug report for our problem either.
es: Para Debian, que es la fuente principal de paquetes para Ubuntu, echamos un vistazo a http://bugs.debian.org/src:bumprace y tampoco pudimos encontrar un informe de error sobre nuestro problema.
uk: У Debian, який є основним джерелом пакунків Ubuntu ми поглянемо на http://bugs.debian.org/src:bumprace й також не знайдемо там повідомлення про нашу ваду.

source: For Debian the URL ``http://bugs.debian.org/src:<package>`` should always take to the bug page of the source package in question.
es: Para Debian la URL ``http://bugs.debian.org/src:<package>`` siempre debería llevar la página de error del paquete fuente en cuestión.
uk: Для Debian URL ``http://bugs.debian.org/src:<пакет>`` завжди приводить на сторінку помилок у вказаному пакунку джерельного коду.

source: The problem we are working on is special as it only concerns the packaging-related bits of ``bumprace``. If it was a problem in the source code it would be helpful to also check the Upstream bug tracker. This is unfortunately often different for every package you have a look at, but if you search the web for it, you should in most cases find it pretty easily.
es: El problema en el que estamos trabajando es especial ya que sólo afecta a parte relacionada con el empaquetado de ``bumprace``. Si hubiera un problema en el código fuente sería útil comprobar también el registro de errores aguas arriba. Desafortunadamente este es a menudo diferente para cada paquete que mire, pero si lo busca en la web, en la mayoría de los casos debería encontrarlo fácilmente.
uk: Помилка, над якою ми працюємо, незвичайна у тому сенсі, що вона стосується лише пакункування ``bumprace``. Якби це була вада у джерельному коді, корисно було б також перевірити систему відстеження помилок апстріму. Нажаль, ця процедура часто різниться для кожного окремого пакунку, але завжди можна скористатися пошуком в інтернеті, й у більшості випадків Ви з’ясуєте, що вона виявиться не такою вже й складною.

source: Offering help
es: Ofrecer ayuda
uk: Пропозиція допомоги

source: If you found an open bug and it is not assigned to somebody and you are in a position to fix it, you should comment on it with your solution. Be sure to include as much information as you can: Under which circumstances does the bug occur? How did you fix the problem? Did you test your solution?
es: Si encuentra un error abierto que no está asignado a nadie y está en situación de corregirlo, debería añadir un comentario con su solución. Asegúrese de incluir tanta información como sea posible: ¿bajo qué circunstancias ocurre el error? ¿cómo ha corregido el problema? ¿ha probado la solución?
uk: Якщо Ви виявили відкриту ваду, яка ще нікому не призначена, й Ви готові взятися за її усунення, слід написати коментар з Вашим вирішенням. Включіть у нього щонайбільше інформації: При яких обставинах з’являється помилка? Як Ви її виправили? Чи тестували Ви свій спосіб усунення помилки?

source: If no bug report has been filed, you can file a bug for it. What you might want to bear in mind is: Is the issue so small that just asking for somebody to commit it is good enough? Did you manage to only partially fix the issue and you want to at least share your part of it?
es: Si no se ha rellenado ningún informe de error, puede crear uno. Lo que debe tener en cuenta es lo siguiente: ¿es la incidencia tan pequeña que simplemente pedir que alguien la confirme es suficiente? ¿ha podido únicamente corregir parcialmente la incidencia y desea al menos compartir su parte?
uk: Якщо повідомлення про помилку не було зареєстроване, Ви можете його створити. Подумайте над двома речами: Може бути, зміна настільки мала, що достатньо просто попрохати когось застосувати її? Може бути, в Вас вийшло лише частково виправити ваду, й Ви бажаєте поділитися Вашою часткою?

source: It is great if you can offer help and will surely be appreciated.
es: Es bueno poder ofrecer ayuda y con toda seguridad será apreciada.
uk: Буде чудово, якщо Ви можете запропонувати свою допомогу, й вона, без сумніву, буде з готовністю прийнята.

source: Fixing the issue
es: Corregir la incidencia
uk: Виправлення помилки

source: For this specific example it is enough to search the web for ``bumprace`` and find the homepage of it. Be sure it is a live site and not just a software catalogue. http://www.linux-games.com/bumprace/ looks like it is the proper place.
es: Para este ejemplo concreto es suficiente con buscar en la web ``bumprace`` y encontrar su página web. asegúrese de que es un sitio que está vivo y no solo un catálogo de software. http://www.linux-games.com/bumprace/ tiene pinta de ser el lugar apropiado.
uk: У даному конкретному прикладі недостатньо просто знайти веб-сайт ``bumprace`` й визначити адресу його домашньої сторінки. Потрібно переконатися, що сайт працює, й він не є просто каталогом різних проґрам. http://www.linux-games.com/bumprace/ виглядає відповідним місцем.

source: To address the issue in the source package, we first need the source and we can easily get it by running::
es: Para afrontar la incidencia en el paquete fuente, necesitamos antes el código fuente, que puede ser obtenido fácilmente ejecuntando::
uk: Щоб взятися за ваду у пакунку джерельного коду, нам знадобиться цей джерельний код, й ми легко можемо отримати його, набравши::

source: If you read :doc:`the Debian Directory Overview<./debian-dir-overview>` before, you might remember, that the homepage for a package is specified in the first part of ``debian/control``, the section which starts with ``Source:``.
es: Si ha leído antes sobre la visión general del directorio de Debian (:doc:`the Debian Directory Overview<./debian-dir-overview>`), podría recordar que la página web para un paquete se indica en la primera parte del archivo ``debian/control``, la sección que comienza con ``Source:``.
uk: Якщо Ви прочитали :doc:`огляд каталогу Debian<./debian-dir-overview>`, то пам’ятайте, ймовірно, що домашня сторінка вказується у першій частині ``debian/control``, у секції, що починається з ``Source:``.

source: So what we do next is run::
es: Así que lo siguiente que hacemos es ejecutar::
uk: Тож тепер ми маємо виконати команду::

source: and edit ``debian/control`` to add ``Homepage: http://www.linux-games.com/bumprace/``. At the end of the first section should be a good place for it. Once you have done this, save the file.
es: y editar ``debian/control`` para añadir ``Homepage: http://www.linux-games.com/bumprace/``. Al final de la primera sección debería ser un buen lugar. Una vez que lo haya hecho, guarde el archivo.
uk: й відредагувати ``debian/control``, додавши ``Homepage: http://www.linux-games.com/bumprace/``. У кінці першої секції має бути відповідне місце для цього. Після внесення змін збережіть файл.

source: If you now run::
es: Si ahora ejecuta::
uk: Якщо тепер Ви виконаєте::

source: you should see something like this:
es: debería ver algo como esto:
uk: Ви повинні побачити щось типу цього:
