Repository: canonical/ubuntu-packaging-guide
Catalog: po/*.po
Languages: es, uk

source: The last component of the path is arbitrary; it's up to you to pick something meaningful.
es: El último componente de la ruta es arbitrario; depende de usted elegir algo significativo.
uk: Останній компонент шляху у цьому прикладі вибраний довільно, вкажіть замість нього помилку яка реально існує.

source: However, this usually isn't enough to get Ubuntu developers to review and sponsor your change. You should next submit a *merge proposal*.
es: Sin embargo, esto no es normalmente suficiente para que los desarrolladores de Ubuntu revisen y patrocinen su cambio. Debería envíar una *propuesta de integración*.
uk: Але зазвичай цього недостатньо, аби розробники Ubuntu перевірили Вашу зміну й взяли на себе поручительство над ним. Вам потрібно відправити *пропозицію злиття* (merge proposal).

source: To do this open the bug page in a browser, e.g.::
es: Para hacerlo, abra la página del error en un navegador, por ejemplo::
uk: Для цього відкрийте сторінку помилки у оглядачі тенет, наприклад::

source: If that fails, then you can use::
es: Si eso falla, puede usar::
uk: Якщо зробити це не вдалося, Ви можете використовувати::

source: where most of the URL matches what you used for `bzr push`. On this page, you'll see a link that says *Propose for merging into another branch*. Type in an explanation of your change in the *Initial Comment* box. Lastly, click *Propose Merge* to complete the process.
es: donde la mayoría de los URL coincidan con las que ha usado para «bzr push». En esta página, verá un enlace que dice *Propose for merging into another branch* (proponer para ser integrada en otra rama). Escriba una explicación de su cambio en la casilla *Initial Comment* (comentario inicial). Finalmente, pulse *Propose Merge* (proponer integración) para completar el proceso.
uk: де більша частина URL збігається з тією URL, яку Ви вказували у команді `bzr push`. На цій сторінці Ви побачите посилання *Propose for merging into another branch*. Наберіть опис Вашої зміни у полі *Initial Comment*. Потім клацніть *Propose Merge*, щоб завершити процес.

source: Merge proposals to package source branches will automatically subscribe the `~ubuntu-branches` team, which should be enough to reach an Ubuntu developer who can review and sponsor your package change.
es: Las propuestas de integración a ramas de paquetes fuente subscribirán automáticamente al equipo «~ubuntu-branches», lo que debería ser suficiente para que lleguen a un desarrollador de Ubuntu que pueda revisar y patrocinar sus cambios al paquete.
uk: Пропозиції про злиття для джерельних гілок автоматично підпишуть команду `~ubuntu-branches`, чого має бути достатньо для того, щоб привернути увагу розробника Ubuntu, який зможе дати відклик Вашим змінам й стати поручителем.

source: Generating a debdiff
es: Generar un debdiff
uk: Створення debdiff

source: As noted above, some sponsors still prefer reviewing a *debdiff* attached to bug reports instead of a merge proposal. If you're requested to include a debdiff, you can generate one like this (from inside your `bug-12345` branch)::
es: Como se ha indicado anteriormente, algunos patrocinadores todavía prefieren revisar un archivo *debdiff* adjunto al informe de error en lugar de una propuesta de integración. Si se le pide que incluya un debdiff, puede generar uno de esta forma (desde dentro de su rama del error `bug-12345`)::
uk: Як було вказано вище, деякі поручителі віддають перевагу перевірці *debdiff*, прикріпленому до звіту про ваду, замість пропозиції злиття. Якщо вас попрохали включити debdiff, Ви можете створити його наступним чином (з Вашої гілки `bug-12345`)::

source: Another way is to is to open the merge proposal and download the diff.
es: Otra forma es abrir una propuesta de integración y descargar las diferencias (diff).
uk: Інший спосіб — відкрити пропозицію злиття й завантажити diff.

source: You should ensure that diff has the changes you expect, no more and no less. Name the diff appropriately, e.g. ``foobar-12345.debdiff`` and attach it to the bug report.
es: Debería asegurarse de que diff tiene los cambios que espera, ni más, ni menos. Dé un nombre apropiado al diff, por ejemplo ``foobar-12345.debdiff`` y adjúntelo al informe de error.
uk: Ви повинні переконатися, що diff-файл містить очікувані Вами зміни, не більше й не менше. Дайте йому відповідне ім’я, наприклад, ``foobar-12345.debdiff`` і прикріпіть до звіту про ваду.

source: Dealing with feedback from sponsors
es: Tratar los comentarios de los patrocinadores
uk: Робота зі зворотнім зв’язком від поручителів

source: If a sponsor reviews your branch and asks you to change something, you can do this fairly easily. Simply go to the branch that you were working in before, make the changes requested, and then commit::
es: Si un patrocinador revisa su rama y le pide que cambie algo, puede hacerlo de forma bastante sencilla. Simplemente vaya a la rama en la que estaba trabajando anteriormente, haga los cambios solicitados, y luego confírmelos::
uk: Якщо поручитель перевіряє Вашу гілку й прохає Вас щось змінити, то зробити це дуже легко. Просто перейдіть у гілку, над якою Ви працювали, зробіть потрібні зміни й виконайте фіксацію::

source: Now when you push your branch to Launchpad, Bazaar will remembered where you pushed to, and will update the branch on Launchpad with your latest commits. All you need to do is::
es: Ahora, cuando empuje su rama a Launchpad, Bazaar recordará donde la ha empujado y actualizará la rama de Launchpad con sus últimos cambios confirmados. Todo lo que necesita hacer es::
uk: Тепер коли Ви просунули свою гілку в Launchpad, Bazaar оновить гілку на Launchpad Вашими останніми змінами. Усе, що Вам потрібно зробити::

source: You can then reply to the merge proposal review email explaining what you changed, and asking for re-review, or you can reply on the merge proposal page in Launchpad.
es: Puede entonces responder al correo de revisión de la propuesta de integración explicando lo que ha cambiado y pidiendo que se vuelva a revisar o puede responder en la página de la propuesta de integración en Launchpad.
uk: Ви можете відповісти на email з оглядом пропозиції про злиття поясненням того, які зміни Ви внесли, а також можете попрохати провести повторний огляд; або ж Ви можете відправити свою відповідь через Launchpad.

source: Note that if you are sponsored via a debdiff attached to a bug report you need to manually update by generating a new diff and attaching that to the bug report.
es: Tenga en cuenta que si se le ha patrocinado mediante un archivo debdiff adjunto a un informe de error debe actualizarlo manualmente generando un nuevo archivo diff y adjuntándolo al informe de error.
uk: Зверніть увагу - Вас спонсорують через debdiff, прикріплений до звіту про ваду - Вам слід оновлювати його вручну, генеруючи новий diff й прикріплюючи його до звіту про ваду.

source: Expectations
es: Expectativas
uk: Очікування

source: The Ubuntu developers have set up a schedule of "patch pilots", who regularly review the sponsoring queue and give feedback on branches and patches. Even though this measure has been put in place it might still take several days until you hear back. This depends on how busy everybody is, if the development release is currently frozen, or other factors.
es: Los desarrolladores de Ubuntu han preparado una planificación de «pilotos de parches», que regularmente revisan la cola de patrocinio respondiendo sobre las ramas y los parches. Incluso aunque se ha activado esta medida es posible que tenga que esperar varios días hasta que tenga respuesta. Esto depende de lo ocupado que esté todo el mundo, y si la emisión en desarrollo está ya congelada u otros factores.
uk: Розробники Ubuntu склали розклад людей (так званих "patch pilots"), які регулярно перевіряють чергу поручительства й надають зворотній зв’язок з питань роботи з гілками та латками. Але, навіть не дивлячись на це, може пройти декілька днів, поки Ви отримаєте відповідь. Це залежить від їх зайнятості, від стану заморозки поточної версії та інших факторів.

source: If you haven't heard back in a while, feel free to join `#ubuntu-devel` on `irc.freenode.net` and find out if somebody can help you there.
es: Si no ha recibido respuesta en un tiempo, no tenga reparos en entrar en el canal `#ubuntu-devel` de `irc.freenode.net` y buscar ahí alguien que le pueda ayudar.
uk: Якщо Ви не отримуєте відповіді протягом тривалого часу, під’єднайтеся до каналу `#ubuntu-devel` на `irc.freenode.net` й знайдіть когось, хто може Вам допомогти.

source: For more information on the generall sponsorship process, review the documentation on our wiki as well: https://wiki.ubuntu.com/SponsorshipProcess
es: Para más información sobre el proceso de patrocinio general, revise la documentación de nuestro wiki también: https://wiki.ubuntu.com/SponsorshipProcess
uk: Щоб дізнатися більше про процес поручительства, прочитайте також нашу вікі-документацію: https://wiki.ubuntu.com/SponsorshipProcess

source: Uploading a package
es: Subir un paquete
uk: Завантаження пакунку

source: Once your merge proposal is reviewed and approved, you will want to upload your package, either to the archive (if you have permission) or to your `Personal Package Archive`_ (PPA). You might also want to do an upload if you are sponsoring someone else's changes.
es: Una vez que su propuesta de integración se ha revisado y aprobado, deseará subir el paquete, al repositorio (si tiene permiso) o a su archivo de paquetes personales (`Personal Package Archive`_, PPA). También es posible que desee realizar una subido si está patrocinando los cambios de otra persona.

source: Uploading a change made by you
es: Subir un paquete que ha modificado
uk: Вивантаження змін, зроблених Вами

source: When you have a branch with a change that you would like to upload you need to get that change back on to the main source branch, build a source package, and then upload it.
es: Cuando tenga una rama con cambios que le gustaría subir tendrá que llevar esos cambios de vuelta a la rama de código principal, compilar el paquete fuente y luego subirlo.
uk: Коли в Вас є гілка із змінами, які Ви бажаєте завантажити, то потрібно відправити цю зміну назад на джерельну гілку, створити джерельний пакунок, а потім завантажити його.

source: First, you need to check that you have the latest version of the package in your checkout of the development package trunk::
es: Primero necesita comprobar que dispone de la última versión del paquete en su extracción de la rama troncal del paquete de desarrollo::
uk: Спочатку Вам потрібно переконатися, що в Вас найостанніша версія пакунку у налагодженні дерева пакунку розробки::

source: This pulls in any changes that may have been committed while you were working on your fix. From here, you have several options. If the changes on the trunk are large and you feel should be tested along with your change you can merge them into your bug fix branch and test there. If not, then you can carry on merging your bug fix branch into the development trunk branch. As of bzr 2.5 and bzr-builddeb 2.8.1, this works with just the standard ``merge`` command::
es: Esto descarga todos los cambios que se hayan podido confirmar mientras ha estado trabajando en su corrección. A partir de este punto tiene varias opciones. Si los cambios en la rama troncal son importantes y considera que deberían probarse junto con sus cambios puede fusionarlos en su rama de corrección del error y probarlos ahí. Si no lo son, puede continuar integrando sus rama de corrección del error en la rama troncal del desarrollo. Desde las versiones 2.5 de bzr y 2.8.1 de bzr-builddeb funciona igual que la orden ``merge`` estándar.
uk: Це застосує будь-які зміни, які були внесені за час Вашої роботи над фіксом. Починаючи з цієї миті в Вас є декілька варіянтів. Якщо Ваші зміни великі й Ви відчуваєте, що їх слід протестувати разом з Вашими змінами - то можна об’єднати їх у гілці виправлення вад і провести тестування там. Якщо ні, то Ви можете продовжити процес злиття у Вашій гілці виправлення вади. Стосовно bzr 2.5 і bzr-builddeb 2.8.1, це працює так само як й стандартна команда ``merge``::

source: For older versions of bzr, you can use the ``merge-package`` command instead::
es: Para versiones más antigas de bzr, puede usar en su lugar la orden «merge-package»::
uk: Для старіших версій bzr можна використовувати назамін команду ``merge-package``::

source: This will merge the two trees, possibly producing conflicts, which you'll need to resolve manually.
es: Esto fusionará los dos árboles, posiblemente produciendo conflictos, que deberá resolver manualmente.
uk: Ця команда зіллє два дерева й, можливо, повідомить про конфлікти, які Вам потрібно буде вирішити вручну.

source: Next you should make sure the ``debian/changelog`` is as you would like, with the correct distribution, version number, etc.
es: Después debería asegurarse de que el archivo «debian/changelog» está como desea, con la distribución correcta, número de versión, etc.
uk: Далі потрібно переконатися у правильності вмісту ``debian/changelog``, тобто, що там правильно вказаний дистрибутив, номер версії тощо.

source: Once that is done you should review the change you are about to commit with ``bzr diff``. This should show you the same changes as a debdiff would before you upload the source package.
es: Una vez realizado deberia revisar el cambio que está a punto de confirmar con ``bzr diff``. Esto debería mostrarle los mismos cambios que devolvería debdiff antes de que suba el paquete fuente.
uk: Як тільки це зроблено, Ви повинні ще раз переперевірити зміни, які бажаєте відправити, за допомогою ``bzr diff``. Це має показати ті ж зміни, як показав би debdiff до завантаження джерельного пакунку.

source: The next step is to build and test the modified source package as you normally would::
es: El siguiente paso es construir y probar el paquete fuente como haría normalmente::
uk: Наступний крок — зібрати й протестувати змінений пакунок джерельного коду, як Ви це зазвичай робите::

source: When you're finally happy with your branch, make sure you've committed all your changes, then tag the branch with the changelog's version number. The ``bzr tag`` command will do this for you automatically when given no arguments::
es: Cuando por fin esté satisfecho con su rama, asegúrese de haber confirmado todos los cambios y luego etiquétela con el número de versión del registro de cambios (changelog). La orden ``bzr tag`` lo hará por usted de forma automática cuando no se le pasen parámetros::
uk: Коли Ви нарешті задоволені своєю гілкою, переконайтеся що відправили усі зміни, а потім позначте гілку номером версії логу змін. Команда ``bzr tag`` зробить це автоматично, якщо не вказано жодного аргументу::

source: This tag will tell the package importer that what is in the Bazaar branch is the same as in the archive.
es: Esta etiqueta le dirá al importador del paquete que lo que está en la rama de Bazaar es lo mismo que lo que está en el repositorio.
uk: Цей тег повідомить імпортуючому пакунок, що вміст гілки Bazaar ідентичний вмісту архіву.

source: Now you can push the changes back to Launchpad::
es: Ahora ya puede empujar los cambios de vuelta a Launchpad::
uk: Тепер Ви можете вивантажити командою push зміни назад на Launchpad::

source: (Change the destination if you are uploading an SRU or similar.)
es: (cambie el destino si está subiendo una SRU o similar).
uk: (Змініть місце призначення, якщо Ви вивантажуєте SRU або щось подібне.)

source: You need one last step to get your changes uploaded into Ubuntu or your PPA; you need to ``dput`` the source package to the appropriate location. For example, if you want to upload your changes to your PPA, you'd do::
es: Necesita un último paso para hacer que sus cambios se suban a Ubuntu o a su PPA: necesita hacer ``dput`` del paquete fuente a la ubicación apropiada. Por ejemplo, si quiere subir sus cambios a su PPA, debería hacer::
uk: Вам потрібен один останній крок, щоб відправити свої зміни в Ubuntu або Ваш PPA: Вам потрібно завантажити за допомогою ``dput`` пакунок джерельного коду у відповідне місце. Наприклад, щоб завантажити зміни в PPA, зробіть таке::

source: or, if you have permission to upload to the primary archive::
es: o, si tiene permisos para subir al repositorio primario::
uk: або, якщо в Вас є права завантаження до основного архіву::

source: You are now free to delete your feature branch, as it is merged, and can be re-downloaded from Launchpad if needed.
es: Ahora ya puede borrar su rama, ya que se ha integrado, y se puede volver a descargar de Launchpad si hiciera falta.
uk: Тепер Ви можете вилучити гілку, оскільки вона вже об’єднана, й за необхідності її можна поновій стягнути з Launchpad.

source: Sponsoring a change
es: Patrocinar un cambio
uk: Поручительство над зміною

source: Sponsoring someone else's change is just like the above procedure, but instead of merging from a branch you created, you merge from the branch in the merge proposal::
es: Para patrocinar los cambios de otra persona debe seguir el proceso descrito, pero en lugar de integrar los cambios de una rama que usted ha creado, lo hará desde la rama de la propuesta de integración.
uk: Поручительство над чийоюсь зміною схоже на процедуру описану вище, але замість злиття із створеної Вами гілки Ви виконуєте злиття з гілки, що є у пропозиції злиття::

source: If there are lots of merge conflicts you would probably want to ask the contributor to fix them up. See the next section to learn how to cancel a pending merge.
es: Si hay muchos conflictos en la integración probablemente desee pedirle al contribuyente que los arregle. Vea la siguiente sección para aprender cómo cancelar una integración pendiente.
uk: Якщо при злитті виникає багато конфліктів, можливо Ви забажаєте попрохати розробника їх виправити. Дивіться у наступному розділі як скасувати заплановане злиття.

source: But if the changes look good, commit and then follow the rest of the uploading process::
es: Pero si los cambios tienen buena pinta, confírmelos y luego siga el resto del proceso de subida::
uk: Але якщо із змінами усе добре - підтвердіть, а потім пройдіть частину процесу завантаження що залишилася::

source: Canceling an upload
es: Cancelar una descarga
uk: Скасування вивантаження

source: At any time before you `dput` the source package you can decide to cancel an upload and revert the changes::
es: En cualquier momento antes de haga `dput` del paquete fuente puede decidir cancelar una subida y deshacer los cambios::
uk: У будь-який час до виконання дії `dput` з джерельним пакунком Ви можете скасувати завантаження й зробити відкат усіх змін::

source: You can do this if you notice something needs more work, or if you would like to ask the contributor to fix up conflicts when sponsoring something.
es: Puede hacerlo si nota que algo necesita más trabajo o si le gustaría pedir a un contribuyente que arregle conflictos cuando esté patrocinando algo.
uk: Ви можете зробити це якщо помітите, що потрібно ще не багато роботи, або якщо бажаєте попрохати розробника виправити конфлікти (якщо виступаєте його поручителем).

source: Sponsoring something and making your own changes
es: Patrocinar algo y hacer sus propias modificaciones
uk: Поручительство над чимось і внесення своїх власних змін

source: If you are going to sponsor someone's work, but you would like to roll it up with some changes of your own then you can merge their work in to a separate branch first.
es: Si va a patrocinar el trabajo de otra persona, pero a la vez le gustaría añadir algunos cambios suyos puede hacerlo fusionando antes ambos trabajos en una rama independiente.
uk: Якщо Ви є поручителем над чийоюсь роботою, але бажаєте доповнити її декількома власними змінами, то Ви можете спочатку виконати злиття їх роботи у окрему гілку.

source: If you already have a branch where you are working on the package and you would like to include their changes, then simply run the ``bzr merge`` from that branch, instead of the checkout of the development package. You can then make the changes and commit, and then carry on with your changes to the package.
es: Si ya dispone de una rama en la que está trabajando en el paquete y quiere incluir sus cambios, simplemente ejecute ``bzr merge`` desde esa rama, en lugar de hacerlo desde la extracción del paquete de desarrollo. Puede entonces hacer los cambios y confirmarlos y seguir con sus cambios al paquete.
uk: Якщо в Вас вже є гілка, у якій Ви працюєте над пакунком й Ви бажаєте включити усі зміни - просто запустіть ``bzr merge`` з цієї гілки, замість налагодження пакунку розробки. Потім Ви можете внести зміни й відправити, а потім продовжити роботу із змінами до пакунку.

source: If you don't have an existing branch, but you know you would like to make changes based on what the contributor provides then you should start by grabbing their branch::
es: Si no tiene una rama existente, pero sabe que desea hacer cambios en base a lo proporcionado por el contribuyente, debería entonces comenzar por obtener su rama::
uk: Якщо в Вас немає існуючої гілки, але Ви знаєте, що бажали б внести зміни, основуючись на даних розробника, то Ви повинні найперш спарсити їх гілку::

source: then work in this new branch, and then merge it in to the main one and upload as if it was your own work. The contributor will still be mentioned in the changelog, and Bazaar will correctly attribute the changes they made to them.
es: luego trabaje en esta nueva rama, intégrela en la principal y súbala como si fuera su propio trabajo. Todavía se mencionará al contribuyente en el registro de cambios (changelog) y Bazaar le atribuirá correctamente los cambios que realizó.
uk: потім працюйте у цій новій гілці, а після цього виконайте її злиття з головною й завантажте таким чином, як якби завантажували власну роботу. Розробник-участник усе ще буде згаданий у логах змін, і Bazaar належним чином призначить їм внесені ними зміни.

source: Working on a Package
es: Trabajar en un paquete
uk: Робота з пакунком

source: Once you have the source package branch in a shared repository, you'll want to create additional branches for the fixes or other work you plan to do. You'll want to base your branch off the package source branch for the distro release that you plan to upload to. Usually this is the current development release, but it may be older releases if you're backporting to an SRU for example.
es: Una vez que tenga la rama del paquete fuente en el repositorio compartido, querrá crear ramas adicionales para las correcciones u otros trabajos que pretenda hacer. Deseará basar su rama a partir de la rama del paquete base para la emisión a la que tiene pensado subirlo. Normalmente se trata de la emisión actualmente en desarrollo, pero podrían ser también emisiones anteriores si está adaptando cambios a un SRU, por ejemplo.
uk: Як тільки в Вас є гілка з джерельним пакунком у загальнодоступному сховищі, Ви забажаєте створити додаткові гілки для фіксів або іншої запланованої роботи. Ви забажаєте, щоб Ваша гілка засновувалася на пакунку джерельної гілки релізу distro, куди Ви плануєте завантажувати. Зазвичай це поточний реліз розробки, але це можуть бути й старіші релізи, якщо Ви, наприклад, виконуєте зворотній порт на SRU.

source: Branching for a change
es: Bifurcar para hacer un cambio
uk: Гілкування для змін

source: The first thing to do is to make sure your source package branch is up-to-date. It will be if you just checked it out, otherwise do this::
es: Lo primero a hacer es asegurarse de que su rama del paquete fuente está actualizada. Lo estará si la acaba de extraer, de otra forma haga lo siguiente::
uk: Найперш переконайтеся, що гілка джерельного пакунку актуальна. Якщо Ви її тільки-но перевірили, то вона буде актуальною, якщо ж ні, то зробіть таке::
