Repository: canonical/ubuntu-packaging-guide
Catalog: po/*.po
Languages: es, uk

source: https://lists.ubuntu.com/mailman/listinfo/ubuntu-motu (MOTU Team discussion, get help with packaging)
es: https://lists.ubuntu.com/mailman/listinfo/ubuntu-motu (Discusión del equipo MOTU, para obtener ayuda con el empaquetado)
uk: https://lists.ubuntu.com/mailman/listinfo/ubuntu-motu (обговорення команди MOTU, отримання довідки зі створення пакунків)

source: IRC Channels
es: Canales IRC
uk: Канали IRC

source: For real-time discussions, please connect to irc.freenode.net and join one or any of these channels:
es: Para discusiones en tiempo real, conéctese a irc.freenode.net y únase a alguno de estos canales:
uk: Для дискусії у мережі під’єднайтеся до irc.freenode.net і приєднайтеся до будь-якого з каналів:

source: #ubuntu-devel (for general development discussion)
es: #ubuntu-devel (para discusiones generales sobre desarrollo)
uk: #ubuntu-devel (для головної дискусії розробників)

source: #ubuntu-motu (for MOTU team discussion and generally getting help)
es: #ubuntu-motu (para discusiones del equipo MOTU y solicitar ayuda generalmente)
uk: #ubuntu-motu (для обговорень команди MOTU та отримання допомоги)

source: Basic Overview of the ``debian/`` Directory
es: Descripción general básica del Directorio «debian/»
uk: Загальний огляд каталогу ``debian/``

source: This article will briefly explain the different files important to the packaging of Ubuntu packages which are contained in the ``debian/`` directory. The most important of them are ``changelog``, ``control``, ``copyright``, and ``rules``. These are required for all packages. A number of additional files in the ``debian/`` may be used in order to customize and configure the behavior of the package. Some of these files are discussed in this article, but this is not meant to be a complete list.
es: En este artículo explicaremos brevemente los diferentes archivos que son importantes para el empaquetado de paquetes Ubuntu los cuales están en el directorio «debian/». Los más importantes son «changelog», «control», «copyright» y «rules». Estos son requeridos por todos los paquetes. Un conjunto de archivos adicionales en «debian/» puede que sean usados para personalizar y configurar el comportamiento del paquete. Sobre algunos de ello se habla en este articulo, pero esto no pretende ser una lista completa.
uk: Ця стаття дає короткі пояснення до різних файлів, важливих для створення пакунків Ubuntu, які містяться у каталозі ``debian/``. Найважливішими з них є ``changelog``, ``control``, ``copyright``, і ``rules``. Вони потрібні для усіх пакунків. Багато додаткових файлів у ``debian/`` можуть використовуватися для налаштування та зміни поведінки пакунку. Деякі з цих файлів обговорюються у цій статті, але це далеко не повний перелік.

source: The changelog
es: El registro de cambios
uk: Файл changelog

source: This file is, as its name implies, a listing of the changes made in each version. It has a specific format that gives the package name, version, distribution, changes, and who made the changes at a given time. If you have a GPG key (see: :doc:`Getting set up<./getting-set-up/>`), make sure to use the same name and email address in ``changelog`` as you have in your key. The following is a template ``changelog``::
es: Este archivo es, como su nombre indica, un listado de los cambios realizados en cada versión. Tiene un formato especifico que da el nombre del paquete, versión, distribución, cambios, y quién realizó estos cambios en un determinado momento. Si tiene una clave GPG (vea: :doc:«Getting set up<./getting-set-up/>»), asegúrese de usar el mismo nombre y dirección de correo electrónico en «changelog». tal y cómo lo tiene en la clave. Lo siguiente es una plantilla de «changelog»::
uk: Цей файл, як видко з його назви — це перелік змін, внесених у кожну версію. Він має особливий формат, який показує ім’я пакунку, версію, дистрибутив, зміни, й хто вносив зміни в даний час. Якщо в Вас є ключ GPG (дивіться: :doc:`Підготовка<./getting-set-up/>`), переконайтеся, що Ви використовуєте в ``changelog`` ті ж ім’я та адресу електронної пошти, що й в Вашому ключі. Нижче наведено шаблон ``changelog``::

source: The format (especially of the date) is important. The date should be in :rfc:`5322` format, which can be obtained by using the command ``date -R``. For convenience, the command ``dch`` may be used to edit changelog. It will update the date automatically.
es: El formato (especialmente el de la fecha) es importante. La fecha debe estar en formato :rfc:`5322`, que puede obtenerse mediante la orden «date -R». Por conveniencia, la orden «dchx» se puede usar para editar el archivo changelog. Se actualizará la fecha de forma automática.
uk: Формат (особливо дати) важливий. Дата повинна бути у форматі :rfc:`5322`, який можна побачити при виконанні команди ``date -R``. Для зручності, можна використовувати для редагування changelog команду ``dch``. Вона оновить дату автоматично.

source: Minor bullet points are indicated by a dash "-", while major points use an asterisk "*".
es: Los puntos de segundo nivel se indican con un guión «-», los de primer nivel usan un asterisco «*».
uk: Пункти з незначними змінами позначаються тире «-», у той час як у важливих пунктах використовується зірочка «*».

source: If you are packaging from scratch, ``dch --create`` (``dch`` is in the ``devscripts`` package) will create a standard ``debian/changelog`` for you.
es: Si está empaquetando desde cero, «dch --create» («dch» se encuentra en el paquete «devscripts») creará un archivo «debian\changelog» estándar.
uk: Якщо Ви створюєте пакунок «з нуля», ``dch --create`` (``dch`` знаходиться у пакунку ``devscripts``) створить для Вас стандартний файл ``debian/changelog``.

source: Here is a sample ``changelog`` file for hello::
es: Este es un ejemplo del archivo «changelog» para hello::
uk: Ось приклад файлу ``changelog`` для hello::

source: Notice that the version has a ``-0ubuntu1`` appended to it, this is the distro revision, used so that the packaging can be updated (to fix bugs for example) with new uploads within the same source release version.
es: Observe que el paquete tiene un «-0ubuntu1» anexado a el, este representa la versión en la distribución y se usa para que el paquete pueda ser actualizado (para solucionar errores por ejemplo) con nuevas subidas usando la misma versión principal con la que se liberó.
uk: Зверніть увагу, що версія має ``-0ubuntu1`` доданий до нього, це - distro версія, яка використовується так, щоб упаковка могла бути оновлена (щоб виправити помилки, наприклад) з новими завантаженнями у тій же джерельній версії випуску.

source: Ubuntu and Debian have slightly different package versioning schemes to avoid conflicting packages with the same source version. If a Debian package has been changed in Ubuntu, it has ``ubuntuX`` (where ``X`` is the Ubuntu revision number) appended to the end of the Debian version. So if the Debian hello ``2.6-1`` package was changed by Ubuntu, the version string would be ``2.6-1ubuntu1``. If a package for the application does not exist in Debian, then the Debian revision is ``0`` (e.g. ``2.6-0ubuntu1``).
es: Ubuntu y Debian tienen esquemas de versión de paquetes ligeramente diferentes para evitar conflictos en los programas con la misma versión principal. Si una paquete de Debian sufre un cambio en Ubuntu, se le agrega el «ubuntuX» (donde «X» es el número de revisión en Ubuntu) al final de la versión de Debian. Si el paquete hello «2.6-1» de Debian ss modifica en Ubuntu, la versión quedaría «2.6-1ubuntu1». Si el paquete no existiera en Debian, entonces la revisión ahí sería «0» (y quedaría «2.6-0ubuntu1»).
uk: Ubuntu і Debian використовують схеми нумерації версій пакунків, що трохи різняться, щоб уникнути конфлікту пакунків з однією й тою самою початковою версією. Якщо пакунок Debian був змінений в Ubuntu, до кінця Debian-версії додається ``ubuntuX`` (де ``X`` — номер редакції в Ubuntu). Таким чином, якщо пакунок Debian hello ``2.6-1`` був змінений в Ubuntu, номер версії буде ``2.6-1ubuntu1``. Якщо пакунок додатку в Debian не існує, то редакція Debian дорівнює ``0`` (наприклад, ``2.6-0ubuntu1``).

source: For further information, see the `changelog section (Section 4.4) <http://www.debian.org/doc/debian-policy/ch-source.html#s-dpkgchangelog>`_ of the Debian Policy Manual.
es: Para obtener más información, consulte la sección de cambios `changelog section (Section 4.4) <http://www.debian.org/doc/debian-policy/ch-source.html#s-dpkgchangelog>`_ del Manual de normas de Debian.

source: The control file
es: El archivo de control
uk: Файл control

source: The ``control`` file contains the information that the package manager (such as ``apt-get``, ``synaptic``, and ``adept``) uses, build-time dependencies, maintainer information, and much more.
es: El archivo «control» contiene la información que usan administradores de paquetes (como «apt-get», «synaptic» y «adept»), dependencias de compilación, información del mantenedor y mucho más.
uk: Файл ``control`` містить інформацію, яку використовує менеджер пакунків (такий, як ``apt-get``, ``synaptic`` або ``adept``), збірочні залежності, інформацію мейнтейнера і багато іншого.

source: The first paragraph describes the source package including the list of packages required to build the package from source in the ``Build-Depends`` field. It also contains some meta-information such as the maintainer's name, the version of Debian Policy that the package complies with, the location of the packaging version control repository, and the upstream home page.
es: El primer párrafo describe el paquete fuente incluyendo la lista de paquetes requeridos para construirlo desde sus fuentes en el campo «Build-Depends». También contiene alguna metainformación como el nombre del mantenedor, la versión de la política de Debian que cumple el paquete, la ubicación del repositorio de control de versiones del paquete y la página principal para enviar el parche.
uk: Перший абзац дає опис джерельного пакунку, включаючи перелік пакунків, що потрібні для збірки даного пакунку з джерельного коду, у полі ``Build-Depends``. Він також містить деяку метаінформацію, таку як ім’я мейнтейнера, версію Debian Policy, з якою компілюється пакунок, місцерозташування репозиторію керування версіями та домашню сторінку апстріму.

source: Note that in Ubuntu, we set the ``Maintainer`` field to a general address because anyone can change any package (this differs from Debian where changing packages is usually restricted to an individual or a team). Packages in Ubuntu should generally have the ``Maintainer`` field set to ``Ubuntu Developers <ubuntu-devel-discuss@lists.ubuntu.com>``. If the Maintainer field is modified, the old value should be saved in the ``XSBC-Original-Maintainer`` field. This can be done automatically with the ``update-maintainer`` script available in the ``ubuntu-dev-tools`` package. For further information, see the `Debian Maintainer Field spec <https://wiki.ubuntu.com/DebianMaintainerField>`_ on the Ubuntu wiki.
es: Tenga en cuenta que en Ubuntu, se configura el campo «Maintainer» a una dirección general porque cualquiera puede cambiar cualquier paquete (esto se diferencia de Debian, donde se restringen los permisos para cambiar paquetes a individuos o equipos). Los paquetes en Ubuntu deben tener por lo general el campo «Maintainer» como «Ubuntu Developers <ubuntu-devel-discuss@lists.ubuntu.com>». Si el campo del mantenedor se cambia, el valor anterior debe guardarse en «XSBC-Original-Maintainer». Esto puede hacerse automáticamente con el script «update-maintainer» que es parte del paquete «ubuntu-dev-tools». Para obtener mayor información, véase la página `Debian Maintainer Field spec <https://wiki.ubuntu.com/DebianMaintainerField>`_ en la wiki de Ubuntu.

source: Each additional paragraph describes a binary package to be built.
es: Cada párrafo adicional describe un paquete binario a ser construido.
uk: Кожен додатковий абзац дає опис бінарного пакунку, який буде створений.

source: For further information, see the `control file section (Chapter 5) <http://www.debian.org/doc/debian-policy/ch-controlfields.html>`_ of the Debian Policy Manual.
es: Para obtener mayor información, véase la sección sobre el archivo de control `control file section (Chapter 5) <http://www.debian.org/doc/debian-policy/ch-controlfields.html>`_ del manual de normas de Debian.

source: The copyright file
es: El archivo copyright
uk: Файл copyright

source: This file gives the copyright information for both the upstream source and the packaging. Ubuntu and `Debian Policy (Section 12.5) <http://www.debian.org/doc/debian-policy/ch-docs.html#s-copyrightfile>`_ require that each package installs a verbatim copy of its copyright and license information to ``/usr/share/doc/$(package_name)/copyright``.
es: Este archivo almacena la información de derechos de autor para ambos, el proyecto original y el empaquetado. Tanto Ubuntu como Debian en la sección 12.5 de su manual de normas `Debian Policy (Section 12.5) <http://www.debian.org/doc/debian-policy/ch-docs.html#s-copyrightfile>`_ establecen que cada paquete debe instalar una copia literal del archivo de copyright y de la información del licenciamiento en «/usr/share/doc/$(nombre_del_paquete)/copyright».

source: Generally, copyright information is found in the ``COPYING`` file in the program's source directory. This file should include such information as the names of the author and the packager, the URL from which the source came, a Copyright line with the year and copyright holder, and the text of the copyright itself. An example template would be::
es: Por lo general, la información sobre los derechos de autor se encuentra en el archivo «COPYING» dentro del directorio de código fuente del programa. Este archivo debe contener información tal los nombres de los autores, del creador del paquete, la URL de donde salió el código fuente y una línea de Copyright con el año, el titular de los derechos de autor y el propio texto del copyright. Una plantilla de ejemplo sería::
uk: Як правило, інформацію про авторскькі права можна знайти у файлі ``COPYING`` в каталозі з джерельним кодом проґрами. Цей файл повинен включати таку інформацію, як імена автора та пакувальника, URL, з якої отримано джерело, рядок зі значком копірайту з вказівкою року і власника авторських прав, а також сам текст авторського права. Шаблон для прикладу::

source: This example follows the `Machine-readable debian/copyright <http://www.debian.org/doc/packaging-manuals/copyright-format/1.0/>`_ format. You are encouraged to use this format as well.
es: Este ejemplo sigue el formato de `Machine-readable debian/copyright <http://www.debian.org/doc/packaging-manuals/copyright-format/1.0/>`_ (archivo debian/copyright legible por una máquina). Se le anima a usar este formato de la misma forma.

source: The rules file
es: El archivo de reglas
uk: Файл rules

source: The last file we need to look at is ``rules``. This does all the work for creating our package. It is a Makefile with targets to compile and install the application, then create the ``.deb`` file from the installed files. It also has a target to clean up all the build files so you end up with just a source package again.
es: El último archivo que se necesita estudiar es el archivo «rules». Este archivo hace todo el trabajo para crear el paquete. Es un Makefile con secciones para compilar e instalar el programa, y después crear el archivo «.deb» a partir de los archivos instalados. También tiene una sección para limpiar todos los archivos generados por la compilación, con el fin de volver a quedarse únicamente con el paquete fuente.
uk: Останній файл, який ми розглянемо, це ``rules``. Він виконує усю роботу по збірці нашого пакунку. Це Makefile, у якому є функції компілювання проґрами, її встановлення та створення ``.deb``-пакунку з встановлених файлів. У ньому є також функція очистки файлів збірки, яка вилучає усе, крім власне пакунку джерельного коду.

source: Here is a simplified version of the rules file created by ``dh_make`` (which can be found in the ``dh-make`` package):
es: Esta es una versión simplificada del archivo de reglas creado por ``dh_make`` (el cual se puede encontrar en el paquete ``dh-make``):
uk: Ось спрощений приклад файлу rules, створеного ``dh_make`` (який можна знайти у пакунку ``dh-make``):

source: Let us go through this file in some detail. What this does is pass every build target that ``debian/rules`` is called with as an argument to ``/usr/bin/dh``, which itself will call all the necessary ``dh_*`` commands.
es: Analicemos con más detalle este archivo. Lo que hace es pasar cada sección de compilación invocada por «debian/rules» como un parámetro a «/usr/bin/dh», que a su vez ejecutará todos los comandos «dh_*» necesarios.
uk: Давайте розглянемо цей файл уважніше. На кожному етапі збірки ``debian/rules`` викликається з аргументом, який передається ``/usr/bin/dh``, який, у свою чергу, викликає необхідні команди ``dh_*``.

source: ``dh`` runs a sequence of debhelper commands. The supported sequences correspond to the targets of a ``debian/rules`` file: "build", "clean", "install", "binary-arch", "binary-indep", and "binary". In order to see what commands are run in each target, run::
es: «dh» ejecuta una secuencia de órdenes de debhelper. Las secuencias soportadas son las que corresponden a las secciones del archivo «debian/rules»: «build», «clean», «install», «binary-indep», y «binary». Para saber cuales son las órdenes que se ejecutan en cada sección, ejecute::
uk: ``dh`` запускає послідовність команд debhelper. Підтримувані послідовності відповідають призначенням файлу ``debian/rules``: «build», «clean», «install», «binary-arch», «binary-indep» і «binary». Щоб побачити, які команди виконуються у кожному призначенні, наберіть::

source: Commands in the binary-indep sequence are passed the "-i" option to ensure they only work on binary independent packages, and commands in the binary-arch sequences are passed the "-a" option to ensure they only work on architecture dependent packages.
es: A las órdenes de la secuencia binary-indep se incluye la opción «-i» para asegurar que solo funcionen en paquetes binarios independientes, mientras que a las órdenes de la secuencia binary-arch se les agrega una opción «-a» para asegurar que solo funcionen para paquetes independientes de la arquitectura.
uk: Командам з послідовності ``binary-indep`` передається аргумент ``-i``, щоб вони зачепали лише архітектурно-незалежні пакунки, а командам з послідовності ``binary-arch`` — аргумент ``-a``, щоб вони зачепали лише архітектурно-залежні пакунки.

source: Each debhelper command will record when it's successfully run in ``debian/package.debhelper.log``. (Which dh_clean deletes.) So dh can tell which commands have already been run, for which packages, and skip running those commands again.
es: Cada orden debhelper registrará cuando se ha ejecutado correctamente en «debian/package.debhelper.log» (archivo que dh_clean elimina). De esta manera dh puede saber qué órdenes ya han sido ejecutadas, para qué paquetes y evitar ejecutar esas órdenes de nuevo.
uk: Кожна команда debhelper при її успішному виконанні робить запис у журналі ``debian/package.debhelper.log`` (який потім вилучає dh_clean.) Таким чином dh може визначити, які команди вже були виконані й для яких пакунків, що допомогає уникнути повторного виконання цих команд.

source: Each time ``dh`` is run, it examines the log, and finds the last logged command that is in the specified sequence. It then continues with the next command in the sequence. The ``--until``, ``--before``, ``--after``, and ``--remaining`` options can override this behavior.
es: Cada vez que «dh» se ejecuta, comprueba el registro y busca la última orden registrada que está en la secuencia especificada. Continúa entonces con la siguiente orden de la secuencia. Las opciones «--until», «--before», «--after» y «--remaining» pueden modificar este comportamiento.
uk: При кожному запуску ``dh`` він вивчає журнал, знаходить додані останніми команди, які відносяться до вказаної послідовності. Потім він продовжує виконання з наступної команди у цій послідовності. Опції ``--until``, ``--before``, ``--after`` і ``--remaining`` можуть змінити цю поведінку.

source: If ``debian/rules`` contains a target with a name like ``override_dh_command``, then when it gets to that command in the sequence, ``dh`` will run that target from the rules file, rather than running the actual command. The override target can then run the command with additional options, or run entirely different commands instead. (Note that to use this feature, you should Build-Depend on debhelper 7.0.50 or above.)
es: Si el archivo «debian/rules» contiene una sección con el nombre «override_dh_command», cuando se llegue a esa orden en la secuencia, «dh» ejecutará esa sección en lugar de la orden original. La sección sobrescrita puede ejecutar entonces la orden con opciones adicionales, o ejecutar órdenes completamente diferentes en su lugar (téngase en cuenta que para usar esta característica, se debería construir las dependencias con debhelper 7.0.50 o superior).
uk: Якщо в ``debian/rules`` є функція з іменем, схожим на ``override_dh_команда``, то замість даної команди ``dh`` виконає дану функцію. Ця функція може запустити ту ж команду з іншими аргументами, або ж геть іншу команду. (Зауваження: для використання цієї функційності при збірці потрібен пакунок debhelper версії не менше 7.0.50).

source: Have a look at ``/usr/share/doc/debhelper/examples/`` and ``man dh`` for more examples. Also see `the rules section (Section 4.9) <http://www.debian.org/doc/debian-policy/ch-source.html#s-debianrules>`_ of the Debian Policy Manual.
es: Véase «/usr/share/doc/debhelper/examples/» y «man dh» para más ejemplos. Véase también la sección sobre el archivo de reglas`the rules section (Section 4.9) <http://www.debian.org/doc/debian-policy/ch-source.html#s-debianrules>`_ del manual de normas de Debian.
uk: За додатковими прикладами зверніться до ``/usr/share/doc/debhelper/examples/`` і ``man dh``. Дивіться також `розділ про файл rules (Розділ 4.9) <http://www.debian.org/doc/debian-policy/ch-source.html#s-debianrules>`_ в «Debian Policy Manual».

source: Additional Files
es: Archivos adicionales
uk: Додаткові файли

source: The install file
es: El archivo de instalación
uk: Файл install

source: The ``install`` file is used by ``dh_install`` to install files into the binary package. It has two standard use cases:
es: El archivo «install» lo usa «dh_install» para instalar archivos en el paquete binario. Tiene dos casos de uso estándar:
uk: Файл ``install`` використовується ``dh_install`` для встановлення файлів у двійковий пакунок. Він має два стандартних варіянти використання:

source: To install files into your package that are not handled by the upstream build system.
es: Para instalar archivos en el paquete que no son manejados por el sistema de compilación del proyecto original.
uk: Для встановлення у Ваш пакунок файлів, не встановлених оригінальною системою збірки.

source: Splitting a single large source package into multiple binary packages.
es: Partir paquete fuente en un único fichero grandeen varios paquetes binarios.
uk: Розділення одного великого пакунку джерела на декілька бінарних пакунків.
