Repository: canonical/ubuntu-packaging-guide
Catalog: po/*.po
Languages: es, uk

source: This guide focuses on the Ubuntu Distributed Development packaging method. This is a new way of packaging which uses Distributed Revision Control branches. It currently has some limitations which mean many teams in Ubuntu use :doc:`traditional packaging<./traditional-packaging>` methods. See the :doc:`UDD Introduction<./udd-intro>` page for an introduction to the differences.
es: Esta guía se centra en el método de empaquetado del desarrollo distribuido de Ubuntu. Es una nueva forma de empaquetado que usa ramas de control de revisiones distribuidas. Actualmente tiene algunas limitaciones lo que significa que muchos equipos de Ubuntu usan métodos de :doc:`empaquetado tradicional<./traditional-packaging>`. Véase la página :doc:`Introducción a UDD<./udd-intro>` para una introducción sobre las diferencias.
uk: Цей посібник фокусується на методі створення пакунків Ubuntu Distributed Development. Це новий спосіб роботи з пакунками, який використовує гілки розподіленої системи керування версіями. На цей час він має деякі обмеження, тому багато команд Ubuntu як і раніше користуються :doc:`традиційними<./traditional-packaging>` методами створення пакунків. Щоб дізнатися про відмінності, дивіться сторінку :doc:`Вступ в UDD<./udd-intro>`.

source: Articles
es: Artículos
uk: Статті

source: Knowledge Base
es: Base de conocimiento
uk: База знань

source: Introduction to Ubuntu Development
es: Introducción al desarrollo de Ubuntu
uk: Вступ у розробку Ubuntu

source: Ubuntu is made up of thousands of different components, written in many different programming languages. Every component - be it a software library, a tool or a graphical application - is available as a source package. Source packages in most cases consist of two parts: the actual source code and metadata. Metadata includes the dependencies of the package, copyright and licensing information, and instructions on how to build the package. Once this source package is compiled, the build process provides binary packages, which are the .deb files users can install.
es: Ubuntu está formado por miles de distintos componentes, escritos en muchos lenguajes de programación diferentes. Cada componente, ya sea una biblioteca software, una herramienta o una aplicación gráfica, está disponible como un paquete fuente. Los paquetes fuentes, en la mayoría de los casos, consisten en dos partes: el código fuente actual y los metadatos. Los metadatos incluyen las dependencias del paquete, los derechos de autor e información sobre la licencia e instrucciones sobre cómo compilar el paquete. Una vez que el paquete está compilado, el proceso de construcción proporciona los paquetes binarios, que son los archivos .deb que el usuario puede instalar.
uk: Ubuntu складається з тисяч різних компонентів, написаних великою кількістю мов проґрамування. Кожен компонент — бібліотека, засіб або графічний застосунок — доступний у вигляді пакунку джерельного коду. Пакунки джерельних кодів у більшості випадків складаються з двох частин: сам джерельний код і метадані. Метадані включають у себе залежності пакунку, інформацію про авторське право і ліцензію, а також інструкції зі збирання пакунку. Після того, як пакунок джерельних кодів скомпільований, у процесі збирання ми отримаємо двійкові пакунки, що є .deb файлами, які користувачі можуть встановити.

source: Every time a new version of an application is released, or when someone makes a change to the source code that goes into Ubuntu, the source package must be uploaded to Launchpad's build machines to be compiled. The resulting binary packages then are distributed to the archive and its mirrors in different countries. The URLs in ``/etc/apt/sources.list`` point to an archive or mirror. Every day CD images are built for a selection of different Ubuntu flavours. Ubuntu Desktop, Ubuntu Server, Kubuntu and others specify a list of required packages that get on the CD. These CD images are then used for installation tests and provide the feedback for further release planning.
es: Cada vez que se libera una nueva versión de una aplicación, o cuando alguien hace cambios al código fuente que va a Ubuntu, el paquete fuente debe ser subido a las máquinas de compilación de Launchpad para ser compilado. Los paquetes binarios resultantes se distribuyen entonces a los repositorios y sus espejos en distintos países. Las URLs de «/etc/apt/sources.list» apuntan a un repositorio o a un espejo. Cada día se crean imágenes de CD para una selección de variaciones de Ubuntu. Ubuntu Desktop, Ubuntu Server, Kubuntu y otros especifican una lista de paquetes requeridos que son incluidos en el CD. Estas imágenes de CD se usan para pruebas de instalación y proporcionan información para la planificación de emisiones.

source: Ubuntu's development is very much dependent on the current stage of the release cycle. We release a new version of Ubuntu every six months, which is only possible because we have established strict freeze dates. With every freeze date that is reached developers are expected to make fewer, less intrusive changes. Feature Freeze is the first big freeze date after the first half of the cycle has passed. At this stage features must be largely implemented. The rest of the cycle is supposed to be focused on fixing bugs. After that the user interface, then the documentation, the kernel, etc. are frozen, then the beta release is put out which receives a lot of testing. From the beta release onwards, only critical bugs get fixed and a release candidate release is made and if it does not contain any serious problems, it becomes the final release.
es: El desarrollo de Ubuntu depende en gran medida de la fase actual del ciclo de emisión. Se libera una nueva versión de Ubuntu cada seis meses, lo que solo es posible porque se han establecido fechas estrictas de congelación. Con cada fecha de congelación que se alcanza los desarrolladores esperan hacer menos cambios y menos intrusivos. La congelación de funciones («Feature Freeze») es la primera gran fecha de congelación después de haber pasado la primera mitad del ciclo. En esta fase las funciones deben estar ya prácticamente implementadas. El resto del ciclo se supone que se centrará en corregir errores. Después de que la interfaz de usuario, la documentación, el núcleo, etc. se congelan, se libera una versión beta que pasa gran cantidad de pruebas. De la versión beta en adelante, solo se corrigen errores críticos y se libera la versión candidata y si no contiene ningún problema sería, es la que se convierte en versión definitiva.
uk: Розробка Ubuntu дуже залежить від поточної фази циклу випуску. Ми випускаємо нову версію Ubuntu щопів-року, що можливо лише завдяки тому, що ми встановлюємо точні дати «заморожування». При досягненні кожної дати заморожування очікується, що розробники будуть вносити рідші та менш значущі зміни. Заморожування нових функцій (feature freeze) — це перша велика дата заморожування, що приходить після проходження першої половини циклу розробки. На цьому етапі нові функції повинні бути переважно зреалізовані. У залишкову частину циклу має бути зосередженя на виправленні вад. Після цього «заморожується» користувацький інтерфейс, потім документація, ядро й тощо, після чого випускається бета-версія (beta release), яка інтенсивно тестується. Після того, як випущена бета-версія, виправляються лише критичні помилки, й випускається release candidate, який, якщо він не містить серйозних помилок, стає у подальшому кінцевим випуском.

source: Thousands of source packages, billions of lines of code, hundreds of contributors require a lot of communication and planning to maintain high standards of quality. At the beginning of each release cycle we have the Ubuntu Developer Summit where developers and contributors come together to plan the features of the next releases. Every feature is discussed by its stakeholders and a specification is written that contains detailed information about its assumptions, implementation, the necessary changes in other places, how to test it and so on. This is all done in an open and transparent fashion, so even if you cannot attend the event in person, you can participate remotely and listen to a streamcast, chat with attendants and subscribe to changes of specifications, so you are always up to date.
es: Miles de los paquetes fuente, miles de millones de líneas de código, cientos de contribuyentes requieren de mucha comunicación y de una planificación para mantener altos estándares de calidad. Al principio de cada ciclo de emisión tiene lugar la «Ubuntu Developer Summit» (cumbre de desarrolladores de Ubuntu) en la que los desarrolladores y contribuyentes se juntan para planificar las características de las próximas versiones. Cada característica es discutida por sus accionistas y se escribe una especificación que contiene información detallada sobre sus supuestos, implementación, cambios necesarios en otras partes, cómo probarla y así sucesivamente. Todo esto se hace de forma abierta y transparente, así que incluso si no puede asistir al evento en persona, puede participar de forma remota y escuchar una transmisión, chalar con los asistentes y suscribirse a cambios en las especificaciones, de forma que siempre esté al día.

source: Not every single change can be discussed in a meeting though, particularly because Ubuntu relies on changes that are done in other projects. That is why contributors to Ubuntu constantly stay in touch. Most teams or projects use dedicated mailing lists to avoid too much unrelated noise. For more immediate coordination, developers and contributors use Internet Relay Chat (IRC). All discussions are open and public.
es: Sin embargo, no todos los cambios pueden ser discutidos en una reunión, particularmente porque Ubuntu depeden de cambios que se hacen en otros proyectos. Es por esto que los contribuyentes se mantienen en contacto permanente. La mayoría de los equipos o proyectos usan listas de correo dedicadas para evitar demasiado ruido sin relación. Para una coordinación más inmediata, los desarrolladores y contribuyentes usan charlas en IRC («Internet Relay Chat»). Todas las discusiones son abiertas y públicas.
uk: Втім на нараді можуть бути обмірковані не усі зміни, оскільки Ubuntu залежить від змін, що вносяться у інші проєкти. Тому участники розробки Ubuntu залишаються постійно на зв’язку. Більшість команд або проєктів використовують окремі переліки розсилки, щоб уникнути більшого потоку не пов’язаних з їх спеціялізацією листів. Для більш безпосереднього координування розробники і добровільні участники використовують Internet Relay Chat (IRC). Усі оговорення є відкритими та публічними.

source: Another important tool regarding communication is bug reports. Whenever a defect is found in a package or piece of infrastructure, a bug report is filed in Launchpad. All information is collected in that report and its importance, status and assignee updated when necessary. This makes it an effective tool to stay on top of bugs in a package or project and organise the workload.
es: Otra herramienta importante relativa a la comunicación son los informes de errores. Siempre que se encuentra un error en un paquete o en un parte de la infraestructura, se rellena un informe de error en Launchpad. Se recoge toda la información en dicho informe y se actualiza cuando sea necesario su importancia, estado y desarrollador asignado. Esto lo convierte en una herramienta efectiva para mantenerse por encima de los errores de un paquete o proyecto y para organizar la carga de trabajo.
uk: Ще одним важливим інструментом зв’язку є звіти про вади. Якщо у пакунку або частині інфраструктури виявлена помилка, звіт про неї відправляється на Launchpad. У цьому звіті зібрана уся інформація, й при необхідності відомості про важливість, статус помилки, та особа призначена для її усунення оновлюються. Це робить звіт про ваду ефективним засобом відстежування помилок у пакунках або проєктах й оптимізації робочого навантаження.

source: Most of the software available through Ubuntu is not written by Ubuntu developers themselves. Most of it is written by developers of other Open Source projects and then integrated into Ubuntu. These projects are called "Upstreams", because their source code flows into Ubuntu, where we "just" integrate it. The relationship to Upstreams is critically important to Ubuntu. It is not just code that Ubuntu gets from Upstreams, but it is also that Upstreams get users, bug reports and patches from Ubuntu (and other distributions).
es: La mayoría del software disponible a través de Ubuntu no está escrito por los propios desarrolladores de Ubuntu. La mayoría está escrito por otros desarrolladores de otros proyectos de código abierto que luego son integrados en Ubuntu. Estos proyectos se denominan «upstreams» (aguas arriba), porque su código fuente fluye a Ubuntu, donde «simplemente» se integra. La relación con los proyectos «upstream» tiene una importancia crítica para Ubuntu. No es solo código lo que Ubuntu recoge aguas arriba, sino que los proyectos «upstream» obtienen también usuarios, informes de error y parches de Ubuntu (y de otras distribuciones).
uk: Велика частина доступних в Ubuntu проґрам створена не самими розробниками Ubuntu. Багато з проґрам написані розробниками з інших проєктів з відкритим джерельним кодом, а потім інтегровані в Ubuntu. Такі проєкти прийнято називати «апстрімом» (від англ. upstream — угору за течією), оскільки їх джерельний код вливається в Ubuntu, де ми «просто» інтегруємо його у систему. Зв’язок з апстрімом дуже важливий для Ubuntu. Не лише Ubuntu отримує проґрамний код з апстріму, але й апстрім отримує від користувачів Ubuntu(й інших дистрибутивів) звіти про вади та латки.

source: The most important Upstream for Ubuntu is Debian. Debian is the distribution that Ubuntu is based on and many of the design decisions regarding the packaging infrastructure are made there. Traditionally, Debian has always had dedicated maintainers for every single package or dedicated maintenance teams. In Ubuntu there are teams that have an interest in a subset of packages too, and naturally every developer has a special area of expertise, but participation (and upload rights) generally is open to everyone who demonstrates ability and willingness.
es: El proyecto «upstream» más importante para Ubuntu es Debian. Debian es la distribución en la que se basa Ubuntu y muchas de las decisiones de diseño relativas a la infraestructura de empaquetado se hacen allí. Traicionalmente, Debian ha tenido siempre mantenedores dedicados para cada paquete individual o equipos dedicados de mantenimiento. En Ubuntu hay equipos que tienen interés en un subconjunto de paquetes también y, naturalmente, cada desarrollador tiene un área de especialización, pero la participación (y permisos de subida) está generalmente abierta a cualquiera que demuestre capacidad y voluntad.
uk: Найважливішим апстрімом для Ubuntu є Debian. Debian — це дистрибутив, на якому заснована Ubuntu, й саме там створені багато інженерних рішень, що стосуються інфраструктури пакунків. За традицією, в Debian для кожного окремого пакунку завжди є супроводжуючий (мейнтейнер) або окрема група супроводу. В Ubuntu теж є команди, зацікавлені у роботі над підмножиною пакунків й, зрозуміло, кожен розробник має власну область компетенції, але участь (і права завантаження змін) зазвичай доступні будь-кому, хто продемонструє здатність та бажання працювати.

source: Getting a change into Ubuntu as a new contributor is not as daunting as it seems and can be a very rewarding experience. It is not only about learning something new and exciting, but also about sharing the solution and solving a problem for millions of users out there.
es: Conseguir un cambio en Ubuntu como un nuevo contribuyente no es tan desalentador como parece y puede resultar una experiencia muy gratificante. No se trata únicamente de aprender algo nuevo y excitante, sino también de compartir la solución y resolver un problema para millones de otros usuarios.
uk: Внести зміну в Ubuntu новому участнику не так складно, як здається, й це може бути вельми корисним досвідом. Це дозволяє не лише навчитися чомусь новому й захоплюючому, але й поділитися своїм вирішенням проблеми з мільйонами інших користувачів.

source: Open Source Development happens in a distributed world with different goals and different areas of focus. For example there might be the case that a particular Upstream is interested in working on a new big feature while Ubuntu, because of the tight release schedule, is interested in shipping a solid version with just an additional bug fix. That is why we make use of "Distributed Development", where code is being worked on in various branches that are merged with each other after code reviews and sufficient discussion.
es: Los desarrollos de código abierto se producen en un mundo distribuido con distintos objetivos diferentes y con áreas de interés diferentes. Por ejemplo, podría darse el caso de que alguien en particular «upstream» esté interesado en trabajar en una nueva funcionalidad importante mientras que Ubuntu, debido a su estricta planificación de emisiones, está interesado en distribuir una versión sólida solo con algunas correcciones de errores. Es por ello que se usa el «desarrollo distribuido», en el que se trabaja en distintas ramas de código que son combinadas con las demás después de revisiones de código y suficientes discusiones.
uk: Розробка відкритого проґрамного забезпечення відбувається у розподіленому світі, у якому у розробників можуть бути різні цілі й різні області інтересів. Наприклад, може бути так, що окремий апстрім зацікавлений у роботі над великим нововведенням, в той час як Ubuntu, внаслідок тісного розкладу релізів, більше зацікавлена у випуску стабільної версії, у якій лише виправлені деякі вади. Тому ми використовуємо «Ubuntu Distributed Development», де робота над кодом ведеться у різних гілках, які потім зливаються один з одним після перевірки коду й достатньої кількості обговорень.

source: In the example mentioned above it would make sense to ship Ubuntu with the existing version of the project, add the bugfix, get it into Upstream for their next release and ship that (if suitable) in the next Ubuntu release. It would be the best possible compromise and a situation where everybody wins.
es: En el ejemplo mencionado anteriormente tendría sentido emitir Ubuntu con una versión existente del proyecto, añadir la corrección del error, integrarla aguas arriba («upstream») para su próxima emisión y distribuirla (si fuera conveniente) en la próxima emisión de Ubuntu. Sería el mejor compromiso posible y una situación en la que todo el mundo gana.
uk: У приведеному вище прикладі має сенс включити в Ubuntu існуючу версію проєкту, зробити виправлення вад, додати їх у апстрім для наступного випуску проєкту й включити його (якщо він до цього придатний) у наступний випуск Ubuntu. Це буде найкращим компромісом і ситуацією у якій виграють обидві сторони.

source: To fix a bug in Ubuntu, you would first get the source code for the package, then work on the fix, document it so it is easy to understand for other developers and users, then build the package to test it. After you have tested it, you can easily propose the change to be included in the current Ubuntu development release. A developer with upload rights will review it for you and then get it integrated into Ubuntu.
es: Para arreglar un error en Ubuntu, primero debería obtener el código fuente del paquete, luego trabajar en la solución, documentarla de forma que sea fácil de entender por otros desarrolladores y usuarios y luego compilar el paquete para probarlo. Después de que lo haya probado, puede fácilmente proponer que el cambio se incluya en la emisión actualmente en desarrollo de Ubuntu. Un desarrollador con permisos para subir el código lo revisará y hará que se integre en Ubuntu.
uk: Щоб виправити помилку в Ubuntu, потрібно спочатку отримати джерельний код пакунку, попрацювати над його виправленням, забезпечити свою роботу документацією, щоб іншим розробникам та користувачам було легко зрозуміти, що саме Ви зробили, а потім зібрати пакунок й протестувати його. Після того, як Ви протестували змінений пакунок, можна запропонувати включити його у поточний розроблюваний реліз Ubuntu. Розробник з правом завантаження перевірить Ваш пакунок й потім інтегрує його в Ubuntu.

source: When trying to find a solution it is usually a good idea to check with Upstream and see if the problem (or a possible solution) is known already and, if not, do your best to make the solution a concerted effort.
es: Cuando intente encontrar una solución es habitualmente una buena idea comprobar los proyectos «upstreams» para ver si el problema (o una posible solución) es conocido y, si no, hacer lo mejor posible para que la solución sea un esfuerzo concertado.
uk: При спробі знайти вирішення корисно перевірити, чи відомо про проблему, над якою Ви працюєте в апстрімі, й чи не знайдено там вже її можливе вирішення. Якщо ні, зробіть усе можливе, щоб вирішити проблему спільними зусиллями.

source: Additional steps might involve getting the change backported to an older, still supported version of Ubuntu and forwarding it to Upstream.
es: Podrían ser necesarios pasos adicionales para hacer que el cambio se incluya en una versión antigua, aunque todavía soportada de Ubuntu, y enviarlo aguas arriba («upstream»).
uk: Додаткові кроки, які Ви можете зробити, — це адаптування Вашої зміни для попередніх підтримуваних випусків Ubuntu й відправлення її в апстрім.

source: The most important requirements for success in Ubuntu development are: having a knack for "making things work again," not being afraid to read documentation and ask questions, being a team player and enjoying some detective work.
es: Los requisitos más importantes para tener éxito en el desarrollo de Ubuntu son: tener una habilidad especial para «hacer que las cosas funcionen de nuevo», no tener miedo a leer documentación y a hacer preguntas, ser un jugador de equipo y disfrutar de algún trabajo detectivesco.
uk: Найважливішими вимогами для успішної розробки в Ubuntu є: вміти «примушувати речі знову працювати», не боятися читати документацію й задавати питання, бути командним гравцем та мати певну схильність до роботи детектива.

source: Good places to ask your questions are ``ubuntu-motu@lists.ubuntu.com`` and ``#ubuntu-motu`` on ``irc.freenode.net``. You will easily find a lot of new friends and people with the same passion that you have: making the world a better place by making better Open Source software.
es: Algunos buenos sitios en los que hacer preguntas son «ubuntu-motu@lists.ubuntu.com» y «#ubuntu-motu» en «irc.freenode.net». Encontrará fácilmente un montón de nuevos amigos y personas con la misma pasión que usted: hacer del mundo un lugar mejor haciendo mejor software de código abierto.
uk: Відповідними місцями для отримання відповідей на Ваші питання є ``ubuntu-motu@lists.ubuntu.com`` і ``#ubuntu-motu`` на ``irc.freenode.net``. Там Ви легко знайдете багато нових друзів і людей, які поділяють вашу пристрасть: робити світ кращим, поліпшуючи відкрите проґрамне забезпечення.

source: KDE Packaging
es: Empaquetado de KDE
uk: Робота з пакунками KDE

source: Packaging of KDE programs in Ubuntu is managed by the Kubuntu and MOTU teams. You can contact the Kubuntu team on the `Kubuntu mailing list`_ and ``#kubuntu-devel`` Freenode IRC channel. More information about Kubuntu development is on the `Kubuntu wiki page`_.
es: El empaquetado de programas de KDE en Ubuntu se gestiona por los equipos de Kubuntu y MOTU. Puede contactar con el equipo de Kubuntu en `Kubuntu mailing list`_ (lista de correo de Kubuntu) y en el canal de IRC de Freenode «#kubuntu-devel». Puede encontrar más información sobre el desarrollo de Kubuntu en la página wiki `Kubuntu wiki page`_.
