Repository: canonical/ubuntu-packaging-guide
Catalog: po/*.po
Languages: es, uk

source: To make the library dependencies more precise we keep ``.symbols`` files that list all the symbols in a library and the version they appeared in.
es: Para hacer más precisas las dependencias de las bibliotecas matenemos archivos «.symbols» que listan todos los símbolos de una librería y la versión en la que aparecen.
uk: Щоб точніше вказувати залежності від бібліотек, ми створили файл ``.symbols``, який перераховує усі символи бібліотеки й версії, у яких вони з’явилися.

source: libnova has no symbols file so we can create one. Start by compiling the package::
es: libnova no tiene archivo de símbolos así que podemos crear uno. Comience por compilar el paquete::
uk: libnova не має символьного файлу, тож ми можемо створити його. Почніть з компілювання пакунку::

source: The ``-nc`` will cause it to finish at the end of compilation without removing the built files. Change to the build and run ``dpkg-gensymbols`` for the library package::
es: La opción ``-nc`` hará que se finalice al completar la compilación sin que se eliminen los archivos compilados. Cámbiese al directorio compilado y ejecute ``dpkg-gensymbols`` para el paquete de la biblioteca::
uk: Опція ``-nc`` вказує не вилучати збірочні файли після завершення компілювання. Перейдіть у каталог збірки й виконайте ``dpkg-gensymbols`` для пакунку бібліотеки::

source: This makes a diff file which you can self apply::
es: Esto genera un archivo de diferencias (diff) que puede aplicar::
uk: Це створить diff-файл, який Ви зможете застосувати самостійно::

source: Which will create a file named similar to ``dpkg-gensymbolsnY_WWI`` that lists all the symbols. It also lists the current package version. We can remove the packaging version from that listed in the symbols file because new symbols are not generally added by new packaging versions, but by the upstream developers::
es: Lo que creará un archivo con un nombre similar a ``dpkg-gensymbolsnY_WWI`` que lista todos los símbolos. También lista la versión de paquete actual. Podemos eliminar la versión de empaquetado que se lista en el archivo de símbolos porque generalmente no se añaden nuevos símbolos por versiones más modernas de empaquetado, sino por los desarrolladores aguas arriba::
uk: Це створить файл з іменем вигляду ``dpkg-gensymbolsnY_WWI``, у якому будуть перераховані усі символи. Він також вказує поточну версію пакунку. Версію пакунку можна прибрати з файлу, оскільки нові символи зазвичай додаються не з новою версією пакунку, а розробниками початкової бібліотеки.

source: Now move the file into its location, commit and do a test build::
es: Ahora mueva el archivo a su ubicación, confirme y haga una prueba de compilación::
uk: Тепер перемістіть файл туди, де він має знаходитися, зафіксуйте зміни та виконайте тестову збірку::

source: If it successfully compiles the symbols file is correct. With the next upstream version of libnova you would run dpkg-gensymbols again and it will give a diff to update the symbols file.
es: Si compila con éxito es que el archivo de símbolos es correcto. Con la siguiente versión aguas arriba de libnova podría ejecutar de nuevo dpkg-gensymbols y obtendrá un archivo de diferencias para actualizar el archivo de símbolos.
uk: Якщо компілювання виконується успішно, значить символьний файл не містить вад. З виходом наступної апстрім-версії libnova Вам доведеться знову запустити dpkg-gensymbols, щоб створити diff для оновлення символьного файлу.

source: C++ Library Symbols Files
es: Archivos de símbolos de bibliotecas de C++
uk: Символьні файли бібліотек C++

source: C++ has even more exacting standards of binary compatibility than C. The Debian Qt/KDE Team maintain some scripts to handle this, see their `Working with symbols files`_ page for how to use them.
es: C++ tiene estándares de compatibilidad binaria incluso más exigentes que C. El equipo Qt/KDE de Debian mantiene algunos scripts para gestionarlo. Véase su página `Working with symbols files`_ para saber cómo usarlos.

source: Further Reading
es: Lecturas adicionales
uk: Матеріяли для подальшого читання

source: Junichi Uekawa's `Debian Library Packaging Guide`_ goes into this topic in more detail.
es: `Debian Library Packaging Guide`_ (guía de empaquetado de bibliotecas Debian) de Junichi Uekawa profundiza en estos temas con más detalle.

source: Packaging New Software
es: Empaquetando nuevo software
uk: Створення пакунків для нових проґрам

source: While there are thousands of packages in the Ubuntu archive, there are still a lot nobody has gotten to yet. If there is an exciting new piece of software that you feel needs wider exposure, maybe you want to try your hand at creating a package for Ubuntu or a PPA_. This guide will take you through the steps of packaging new software.
es: A pesar de que hay miles de paquetes en el repositorio de Ubuntu, todavía hay muchos que nadie ha conseguido. Si hay una nueva y excitante porción de software que siente que necesita una exposición más amplia, quizá quiera intentar crear un paquete para Ubuntu o un PPA_. Esta guía le acompañará a través de los pasos del empaquetado de nuevo software.
uk: Хоч у архіві Ubuntu є тисячі пакунків, вистачає проґрам, якими ніхто не займається. Якщо Ви знаєте про якусь чудову проґраму, про яку, на Вашу думку, варто взнати ширшому колу користувачів, Ви можете спробувати докласти свою руку до створення пакунку для Ubuntu або PPA_. Цей посібник проведе Вас через етапи створення пакунку для нової проґрами.

source: You will want to read the :doc:`Getting Set Up<./getting-set-up>` article first in order to prepare your development environment.
es: Probablemente quiera leer el artículo :doc:`Getting Set Up<./getting-set-up>` antes para preparar su entorno de desarrollo.
uk: Спочатку Вам слід прочитати статтю :doc:`Підготовка<./getting-set-up>`, щоб підготувати своє середовище розробки.

source: Checking the Program
es: Comprobar el programa
uk: Перевірка проґрами

source: The first stage in packaging is to get the released tar from upstream (we call the authors of applications "upstream") and check that it compiles and runs.
es: La primera fase del empaquetado es obtener el archivo tar liberado aguas arriba (llamamos a los autores de las aplicación aguas arriba, «upstream») y comprobar que compila y se ejecuta.
uk: Першим етапом створення пакунку є отримання tar-файлу з апстріму («апстрімом» ми звемо авторів застосунків) й перевірка того, що він нормально компілюється та запускається.

source: If you don't have the build tools lets make sure we have them first. Also if you don't have the required dependencies lets install those as well.
es: Si no tiene las herramientas de compilación asegúrese de obtenerlas antes. Si tampoco tiene instaladas todas las dependencias necesarias, instálelas igualmente.
uk: Якщо в Вас ще немає інструментів збірки, встановіть їх. Також встановіть усі необхідні залежності.

source: Install build tools::
es: Instalar herramientas de compilación::
uk: Встановимо інструменти збірки::

source: Download main package::
es: Descargar el paquete «main»::
uk: Стягнемо основний пакунок::

source: Now uncompress main package::
es: Descomprimir el paquete «main»::
uk: Тепер розпакуємо основний пакунок::

source: This application uses the autoconf build system so we want to run ``./configure`` to prepare for compilation.
es: Esta aplicación usa el sistema de compilación autoconf, así que debemos ejecutar «./configure» para preparar la compilación.
uk: Цей застосунок використовує систему збірки autoconf, тож нам потібно запустити ``./configure`` для підготовки до компілювання.

source: This will check for the required build dependencies. As ``hello`` is a simple example, ``build-essential`` should provide everything we need. For more complex programs, the command will fail if you do not have the needed libraries and development files. Install the needed packages and repeat until the command runs successfully.::
es: Esto comprobará las dependencias de compilación necesiaras. Como «hello» es un ejemplo sencillo, «build-essential» debería proporcionar todo lo que necesitamos. Para programas más complejos, la orden fallará si no tiene las librerias y archivos de desarrollo necesarios. Instale los paquetes necesarios y repita hasta que la orden se ejecute correctamente.::
uk: При цьому буде перевірено наявність необхідних для збірки залежностей. Оскільки ``hello`` — простий приклад, ``build-essential`` забезпечить нас усім, що потрібно. Для складніших проґрам, команда завершиться помилкою, якщо в нас немає необхідних бібліотек і файлів для розробки. Встановіть потрібні пакунки й повторіть процес, поки команда не завершиться з успіхом.::

source: Now you can compile the source::
es: Ahora puede compilar el fuente::
uk: Тепер потрібно скомпілювати джерельний код::

source: If compilation completes successfully you can install and run the program::
es: Si la compilación finaliza con éxito puede instalar y ejecutar el programa::
uk: Якщо компілювання завершилося успішно, можна встановити та запустити проґраму::

source: Starting a Package
es: Iniciar un paquete
uk: Створення пакунку

source: ``bzr-builddeb`` includes a plugin to create a new package from a template. The plugin is a wrapper around the ``dh_make`` command. You should already have these if you installed ``packaging-dev``. Run the command providing the package name, version number, and path to the upstream tarball::
es: ``bzr-builddeb`` incluye un complemento para crear nuevos paquetes a partir de una plantilla. El complemento es un envoltorio alrededor de la orden ``dh_make``. Ya debería tenerlos instalados si instaló ``packaging-dev``. Ejecute la orden indicando el nombre del paquete, número de versión y la ruta al archivo tar de aguas arriba::
uk: ``bzr-builddeb`` містить модуль для створення нового пакунку з шаблону. Цей модуль є обгорткою навколо команди ``dh_make`` . Він вже повинен бути в Вас, якщо Ви встановили ``packaging-dev``. Запустіть команду, вказавши ім’я пакунку, номер версії та шлях до tar-архіву з апстріму::

source: When it asks what type of package type ``s`` for single binary. This will import the code into a branch and add the ``debian/`` packaging directory. Have a look at the contents. Most of the files it adds are only needed for specialist packages (such as Emacs modules) so you can start by removing the optional example files::
es: Cuando pregunte por el tipo de paquete escriba «s» para binario simple. Esto importará el código en u n rama y añadirá el directorio de empaquetado «debian/». Eche un vistazo al contenido. La mayoría de los archivos que añade son sólo necesarios para paquetes especialistas (como los módulos de Emacs) así que puede comenzar por eliminar los archivos de ejemplo opcionales::
uk: Коли він спитає тип пакунку, оберіть ``s``: одинарний бінарник. Це імпортує код у гілку й створить теку ``debian/``. Погляньте на її вміст: більшість автоматично створених файлів потрібні лише для спеціялізованих пакунків (наприклад модулі Emacs), тож можна почати з вилучення зайвих файлів::

source: You should now customise each of the files.
es: Ahora debería personalizar cada uno de los archivos.
uk: Тепер потрібно внести зміни у кожен з файлів.

source: In ``debian/changelog`` change the version number to an Ubuntu version: ``2.7-0ubuntu1`` (upstream version 2.7, Debian version 0, Ubuntu version 1). Also change ``unstable`` to the current development Ubuntu release such as ``precise``.
es: En «debian/changelog» cambie el número de versión a una versión de Ubuntu: «2.7-0ubuntu1» (versión aguas arriba 2.7, versión Debian 0, versión Ubuntu 1). Cambie también «unstable» a la versión de desarrollo de Ubuntu actual, como «precise».

source: Much of the package building work is done by a series of scripts called ``debhelper``. The exact behaviour of ``debhelper`` changes with new major versions, the compat file instructs ``debhelper`` which version to act as. You will generally want to set this to the most recent version which is ``8``.
es: Mucho del trabajo de construcción de paquetes se realiza por una serie de scripts llamados «debhelper». El comportamiento exacto de «debhelper» cambia con cada nueva versión mayor, el archivo «compat» indica a «debhelper» como qué versión actuar. Generalmente querrá establecerlo a la versión más reciente que es la «8».

source: ``control`` contains all the metadata of the package. The first paragraph describes the source package. The second and following paragraphs describe the binary packages to be built. We will need to add the packages needed to compile the application to ``Build-Depends:``. For ``hello``, make sure that it includes at least::
es: ``control`` contiene todos los metadatos del paquete. El primer párrafo describe el paquete fuente. El segundo y siguientes describen los paquetes binarios a construir. Necesitaremos añadir los paquetes necesarios para compilar la aplicación a ``Build-Depends:``. Para ``hello``, asegúrese de que incluye al menos::
uk: Файл ``control`` містить усі метадані пакунку. Перший абзац дає опис пакунку джерельних кодів. Другий та наступні абзаци дають опис двійкових пакунків, які повинні бути зібрані. Нам знадобиться додати пакунки, необхідні для компілювання додатку в ``Build-Depends:``. Для ``hello`` він має включати, як мінімум::

source: You will also need to fill in a description of the program in the ``Description:`` field.
es: También necesitará rellenar la descripción del programa en el campo «Description:».
uk: Також потрібно заповнити опис проґрами у полі ``Description:``.

source: ``copyright`` needs to be filled in to follow the licence of the upstream source. According to the hello/COPYING file this is GNU GPL 3 or later.
es: Debe rellenar «copyright» para que siga la licencia de los fuentes aguas arriba. Según el archivo hello/COPYING es GNU GPL 3 o superior.
uk: ``copyright`` потрібно заповнити у відповідності з ліцензією на джерело з апстріму. Згідно файлу hello/COPYING, це ліцензія GNU GPL 3 або пізніша її версія.

source: ``docs`` contains any upstream documentation files you think should be included in the final package.
es: «docs» contiene cualquier archivo de documentación de aguas arriba que piense que debería ser incluido en el paquete final.
uk: ``docs`` повинен містити будь-які файли документації з апстріму, які, на Вашу думку, мають бути включені у готовий пакунок.

source: ``README.source`` and ``README.Debian`` are only needed if your package has any non-standard features, we don't so you can delete them.
es: «README.source» y «README.Debian» solo son necesarios si su paquete tiene características no estándar. No las tiene, así que se pueden borrar.
uk: ``README.source`` і ``README.Debian`` необхідні, лише якщо Ваш пакунок має якісь нестандартні функції. В нас таких немає, тож можна вилучити ці файли.

source: ``source/format`` can be left as is, this describes the version format of the source package and should be ``3.0 (quilt)``.
es: «source/format» se puede dejar como está. Describe el formato de la versión del paquete fuente y debería ser «3.0 (quilt)».
uk: ``source/format`` можна залишити як є, він дає опис формату версії пакунку джерельного коду, який повинен бути ``3.0 (quilt)``.

source: ``rules`` is the most complex file. This is a Makefile which compiles the code and turns it into a binary package. Fortunately most of the work is automatically done these days by ``debhelper 7`` so the universal ``%`` Makefile target just runs the ``dh`` script which will run everything needed.
es: «rules» es el archivo más complejo. Es un Makefile que compila el código y lo convierte en un paquete binario. Afortunadamente la mayor parte del trabajo hoy en día se realiza automáticamente por «debhelper 7» así que el objetivo Makefile «%» universal simplemente ejecuta el script «dh» que a su vez ejecutará todo lo que haga falta.
uk: ``rules`` — найскладніший файл. Це Makefile, який компілює код й перетворює його у двійковий пакунок. На щастя, основну частину роботи на сьогодні автоматично виконує ``debhelper 7``, тож універсальна мета ``%`` просто запускає сценарій ``dh``, який робить усе, що потрібно.

source: All of these file are explained in more detail in the :doc:`overview of the debian directory<./debian-dir-overview>` article.
es: Todos estos archivos se explican con más detalle en el artículo :doc:`resumen del directorio debian<./debian-dir-overview>`.
uk: Детальніший опис усіх цих фалів у статті :doc:`огляд каталогу debian <./debian-dir-overview>`.

source: Finally commit the code to your packaging branch::
es: Finalmente confirme el código en su rama de empaquetado::
uk: Нарешті, закоммте код у гілку для пакунків::

source: Building the package
es: Construir el paquete
uk: Збірка пакунку

source: Now we need to check that our packaging successfully compiles the package and builds the .deb binary package::
es: Ahora necesitamos comprobar que el empaquetado compila con éxito el paquete y genera el paquete binario .deb::
uk: Тепер нам потрібно перевірити, що наші джерельні файли для пакунку успішно компілюються й збираються у двійковий .deb-пакунок::

source: ``bzr builddeb`` is a command to build the package in its current location. The ``-us -uc`` tell it there is no need to GPG sign the package. The result will be placed in ``..``.
es: ``bzr builddeb`` es una orden para compilar el paquete en su ubicación actual. Los parámetros ``-us -uc`` le indicarán que no es necesario firmar con GPG el paquete. El resultado se dejará en ``..``.
uk: ``bzr builddeb`` — це команда для збірки пакунку у його поточному місцезнаходженні. ``-us -uc`` повідомляє що підписувати пакунок за допомогою GPG не потрібно. Результат буде поміщений у каталог «..».

source: You can view the contents of the package with::
es: Puede ver el contenido del paquete con::
uk: Продивитися вміст пакунку можна за допомогою::

source: Install the package and check it works::
es: Instale el paquete y compruebe que funcione::

source: Next Steps
es: Siguientes pasos
uk: Наступні кроки

source: Even if it builds the .deb binary package, your packaging may have bugs. Many errors can be automatically detected by our tool ``lintian`` which can be run on both the source .dsc metadata file and the .deb binary package::
es: Incluso si genera el paquete binario .deb, el empaquetado puede contener errores. Muchos errores se pueden detectar automáticamente mediante la herramienta «lintian» que se puede ejecutar tanto sobre el archivo fuente .dsc de metadatos como sobre el paquete binario .deb::

source: A description of each of the problems it reports can be found on the `lintian website`_.
es: Se puede encontrar una descripción de los problemas que reporta en el sitio web de lintian `lintian website`_.

source: After making a fix to the packaging you can rebuild using ``-nc`` "no clean" without having to build from scratch::
es: Después de realizar una corrección al empaquetado puede reconstruirlo usando la opción «-nc» («no clean», sin limpiar) para no tener que compilarlo desde el principio::
uk: Після створення виправлення для файлів пакунку можна перезібрати його з параметром ``-nc`` ("no clean"), щоб не починати збірку з самого початку::

source: Having checked that the package builds locally you should ensure it builds on a clean system using ``pbuilder``. Since we are going to upload to a PPA (Personal Package Archive) shortly, this upload will need to be *signed* to allow Launchpad to verify that the upload comes from you (you can tell the upload will be signed because the ``-us`` and ``-uc`` flags are not passed to ``bzr builddeb`` like they were before). For signing to work you need to have set up GPG. If you haven't set up ``pbuilder-dist`` or GPG yet, :doc:`do so now<./getting-set-up>`::
es: Después de comprobar que el paquete se compila en local debería asegurarse de que lo hace también en un sistema limpio usando ``pbuilder``. Puesto que se va a subir en breve a un PPA (archivo de paquetes personal), esta proceso de subida deberá ser *firmado* para permitir a Launchpad que verifique que la carga proviene de usted (puede saber que la carga se firmará porque no se pasan los marcadores ``-us`` y ``-uc`` a ``bzr builddeb`` como se hizo antes). Para firmar su trabajo necesita haber configurado GPG. Si no ha configurado todavía ``pbuilder-dist`` o GPG todavía, :doc:`do so now<./getting-set-up>`::
uk: Переконавшись, що пакунок успішно збирається локально, Ви повинні перевірити, чи правильно його збирання буде відбуватися у чистій системі, за допомогою ``pbuilder``. Оскільки незабаром ми збираємося завантажити його в PPA (персональний архів пакунків), це завантаження потрібно забезпечити *цифровим підписом*, щоб Launchpad міг переконатися, що завантаження зробили Ви (дізнатися про те, що завантаження буде підписане, можна за відсутністю передаваних ``bzr builddeb`` прапорців ``-us`` і ``-uc``, які ми використовували раніше). Для підписування своєї роботи Вам знадобиться налаштувати GPG. Якщо Ви ще не налаштували ``pbuilder-dist`` або GPG, :doc:`зробіть це зараз<./getting-set-up>`::

source: When you are happy with your package you will want others to review it. You can upload the branch to Launchpad for review::
es: Cuando esté satisfecho con su paquete deseará que otros lo revisen. Puede subirlo la rama a Launchpad para su revisión::
uk: Після того як Ви залишитеся задоволені отриманим пакунком, потрібно, щоб його перевірили інші люди. Ви можете вивантажити гілку на Launchpad для перевірки::

source: Uploading it to a PPA will ensure it builds and give an easy way for you and others to test the binary packages. You will need to set up a PPA in Launchad then upload with ``dput``::
es: Al subirlo a un PPA («Personal Package Archivo», repositorio de paquetes personal) se asegurará de que compila y que le proporciona a usted y a los demás una forma fácil de probar los paquetes binarios. Necesitará configurar un PPA en Launchpad y luego subirlo con ``dput``::

source: See :doc:`uploading<./udd-uploading>` for more information.
es: Véase :doc:`subir<./udd-uploading>` para más información.
uk: Дивіться розділ «:doc:`Завантаження<./udd-uploading>`» для додаткової інформації.

source: You can ask for reviews in ``#ubuntu-motu`` IRC channel, or on the `MOTU mailing list`_. There might also be a more specific team you could ask such as the GNU team for more specific questions.
es: Puede pedir que se revise en el canal de IRC «#ubuntu-motu», o en la lista de correo de MOTU ` IRC channel, or on the `MOTU mailing list`_. También podría existir un equipo más específico al que se lo podría solicitar como el equipo GNU para temas más concretos.

source: Submitting for inclusion
es: Enviar para su inclusión
uk: Відправка на включення
