Repository: canonical/ubuntu-packaging-guide
Catalog: po/*.po
Languages: es, uk

source: There are a number of paths that a package can take to enter Ubuntu. In most cases, going through Debian first can be the best path. This way ensures that your package will reach the largest number of users as it will be available in not just Debian and Ubuntu but all of their derivatives as well. Here are some useful links for submitting new packages to Debian:
es: Existe varios caminos por los que un paquete puede entrar en Ubuntu. En la mayoría de los casos, ir antes por Debian puede ser la mejor alternativa. De esta forma se asegura de que su paquete llegará al mayor número de usuarios, ya que también estará disponible no solo para Debian y Ubuntu, sino para todos sus derivados también. Estos son algunos enlaces útiles para enviar nuevos paquetes a Debian:
uk: Існує декілька шляхів, якими пакунок може потрапити в Ubuntu. У більшості випадків кращим шляхом може бути проходження спочатку через Debian. Це дозволить Вашому пакунку стати доступним для щонайбільшої кількості користувачів, оскільки він буде доступний не лише в Debian та Ubuntu, але й в усіх дистрибутивах, створених на їх основі. Ось декілька корисних посилань з відправки нових пакунків в Debian:

source: `Debian Mentors FAQ`_ - debian-mentors is for the mentoring of new and prospective Debian Developers. It is where you can find a sponsor to upload your package to the archive.
es: `Debian Mentors FAQ`_ - debian-mentors está para la tutoría de nuevos y futuros desarrolladores de Debian. Es el lugar en el que puede encontrar un patrocinador que suba su paquete al repositorio.

source: `Work-Needing and Prospective Packages`_ - Information on how to file "Intent to Package" and "Request for Package" bugs as well as list of open ITPs and RFPs.
es: `Work-Needing and Prospective Packages`_ - Información sobre cómo presentar errores «Intención de empaquetar» y «Petición para empaquetar» así como una lista de ITPs y RFPs abiertos.

source: `Debian Developer's Reference, 5.1. New packages`_ - The entire document is invaluable for both Ubuntu and Debian packagers. This section documents processes for submitting new packages.
es: `Debian Developer's Reference, 5.1. New packages`_- El documento completo es una fuente inestimable para empaquetadores tanto de Ubuntu como de Debian. Esta sección documenta el proceso de envío de nuevos paquetes.

source: Patches to Packages
es: Parches a los paquetes
uk: Латки для пакунків

source: Sometimes, Ubuntu package maintainers have to change the upstream source code in order to make it work properly on Ubuntu. Examples include, patches to upstream that haven't yet made it into a released version, or changes to the upstream's build system needed only for building it on Ubuntu. We could change the upstream source code directly, but doing this makes it more difficult to remove the patches later when upstream has incorporated them, or extract the change to submit to the upstream project. Instead, we keep these changes as separate patches, in the form of diff files.
es: A veces, los mantenedores de paquetes de Ubuntu tienen que cambiar el código fuente recibido desde aguas arriba para que funcione correctamente en Ubuntu. Ejemplos de esto incluyen parches aguas arriba que no han llegado todavía a la versión emitida, o cambios al sistema de compilación aguas arribas que son necesarios únicamente para compilarlos en Ubuntu. Se podría cambiar el código recibido de aguas arriba directamente, pero al hacerlo que dificulta la eliminación de los parches posteriormente cuando se hayan incorporado los cambios aguas arriba, o extraer el cambio para enviarlo al proyecto aguas arriba. En su lugar, se mantienen los cambios como parches independientes, en forma de archivos de diferencias (diff).
uk: Інколи розробникам пакунку Ubuntu потрібно змінити джерельний код апстріму, щоб примусити його працювати в Ubuntu належним чином. Приклади включають латки для апстрімів, які ще не потрапили у версію релізу, або зміни до систем білдів апстріму, необхідні лише для їх збірки на Ubuntu. Ми будемо міняти джерельний код апстріму напряму, але такий метод робить складнішим подальше вилучення латок, коли апстрім вже застосував їх, також ускладнюючи витягнення змін для їх відправки у проєкт апстріму. Замість цього, ми будемо зберігати ці зміни як окремі латки у формі diff файлів.

source: There are a number of different ways of handling patches in Debian packages, fortunately we are standardising on one system, `Quilt`_, which is now used by most packages.
es: Existen varias formas de gestionar los parches de paquetes Debian, pero afortunadamente se están estandarizando en un solo sistema, `Quilt`_, que actualmente se usa en la mayoría de los paquetes.

source: Let's look at an example package, ``kamoso`` in Natty::
es: Veámoslo con un paquete de ejemplo, ``kamoso`` en Natty::

source: The patches are kept in ``debian/patches``. This package has one patch ``kubuntu_01_fix_qmax_on_armel.diff`` to fix a compile failure on ARM. The patch has been given a name to describe what it does, a number to keep the patches in order (two patches can overlap if they change the same file) and in this case the Kubuntu team adds their own prefix to show the patch comes from them rather than from Debian.
es: Los parches se mantienen en «debian/patches». Este paquete tiene un parche «kubuntu_01_fix_qmax_on_armel.diff» para arreglar un fallo de compilación en ARM. Al parche se le ha dado un nombre descriptivo de lo que hace, un número para mantener los parches ordenados (dos parches se puede solapar si cambian el mismo archivo) y en este caso el equipo de Kubuntu añade su propio prefijo para mostrar que el parche proviene de ellos en lugar de venir de Debian.
uk: Латки зберігаються в ``debian/patches``. Для цього пакунку є одна латка ``kubuntu_01_fix_qmax_on_armel.diff`` для виправлення вади компілювання на платформі ARM. Цій латці привласнено ім’я, що дає опис, того що вона робить, номер патчу за порядком (щоб уникнути плутанини, якщо дві латки мають однакове ім’я) й, у даному випадку, команда Kubuntu додала свій власний префікс, щоб показати, що латка походить від них, а не від Debian.

source: The order of patches to apply is kept in ``debian/patches/series``.
es: El orden de los parches a aplicar se mantiene en «debian/patches/series».
uk: Порядок застосування латок зберігається в ``debian/patches/series``.

source: Patches with Quilt
es: Parches con Quilt
uk: Латки за допомогою Quilt

source: Before working with Quilt you need to tell it where to find the patches. Add this to your ``~/.bashrc``::
es: Antes de comenzar a trabajar con Quilt necesita indicarle dónde encontrar los parches. Añádalo a su archivo «~/.bashrc»::
uk: Перед роботою з Quilt потрібно вказати цій системі, де шукати латки. Додайте в ``~/.bashrc`` таке::

source: And source the file to apply the new export::
es: Y como fuente el archivo para aplicar la nueva exportación::
uk: Й джерело файлу для застосування нового експорту::

source: By default all patches are applied already to UDD checkouts or downloaded packages. You can check this with::
es: Por defecto todos los parches ya están aplicados a las extracción UDD o a los paquetes descargados. Puede comprobarlo con::
uk: Типово усі латки застосовуються вже з UDD витягнень або завантажуваних пакунків. Ви можете перевірити це за допомогою::

source: If you wanted to remove the patch you would run ``pop``::
es: Si quería eliminar el parche debería ejecutar «pop»::
uk: Якщо Ви бажаєте вилучити латку, потрібно виконати ``pop``::

source: And to apply a patch you use ``push``::
es: Y para aplicar un parche use «push»::
uk: А щоб застосувати латку, використовуйте ``push``::

source: Adding a New Patch
es: Añadir un nuevo parche
uk: Додавання нової латки

source: To add a new patch you need to tell Quilt to create a new patch, tell it which files that patch should change, edit the files then refresh the patch::
es: Para añadir un nuevo parche necesita indicarle a Quilt que cree un nuevo parche, qué archivos debería cambiar ese parche, editar los archivos y refrescar el parche::
uk: Для додавання нової латки потрібно вказати Quilt створити нову латку, повідомити йому, які файли ця латка повинна змінити, відредагувати файли, а потім оновити латку::

source: The ``quilt add`` step is important, if you forget it the files will not end up in the patch.
es: El paso «quilt add» es importante, si lo olvida los archivos no terminarán en el parche.
uk: Крок ``quilt add`` важливий: якщо Ви забудете його зробити, файли не потраплять у латку.

source: The change will now be in ``debian/patches/kubuntu_02_program_description.diff`` and the ``series`` file will have had the new patch added to it. You should add the new file to the packaging::
es: El cambio estará ahora en «debian/patches/kubuntu_02_program_description.diff» y en el archivo «series» se habrá añadido el parche. Ahora debería añadir el archivo al empaquetado::
uk: Тепер зміни будуть в ``debian/patches/kubuntu_02_program_description.diff``, а у файл ``series`` буде додана інформація про нову латку. Ви повинні додати новий файл у джерельні файли для пакунку::

source: Quilt keeps its metadata in the ``.pc/`` directory, so currently you need to add that to the packaging too. This should be improved in future.
es: Quilt mantiene sus metadatos en el directorio «.pc/», así que actualmente necesita añadirlo también al empaquetado. Esto debería mejorarse en el futuro.
uk: Quilt містить свої мета-дані у директорії ``.pc/`', тому зараз Вам потрібно додати у пакунок і її. Це має бути покращено у майбутньому.

source: As a general rule you should be careful adding patches to programs unless they come from upstream, there is often a good reason why that change has not already been made. The above example changes a user interface string for example, so it would break all translations. If in doubt, do ask the upstream author before adding a patch.
es: Como regla general debería tener cuidado al añadir parches a programas a menos que lleguen desde aguas arriba, frecuentemente hay una buena razón para que el cambio no se haya hecho todavía. El ejemplo anterior cambia una cadena de la interfaz de usuario por ejemplo, así que invalidaría todas las traducciones. Si duda, pregunte al autor aguas arriba antes de añadir el parche.
uk: Як правило, слід проявляти обережність при додаванні латок до проґрам, якщо вони походять не з апстріму. Часто є вагома причина, з якої зміни ще не були зроблені. У розглянутому вище прикладі змінюється рядок у користувацькому інтерфейсі, тож це може зламати усі переклади. Якщо маєте сумнів, спитайте автора з апстріму перед тим, як додати латку.

source: Upgrading to New Upstream Versions
es: Actualizar a nuevas versiones de aguas arriba
uk: Оновлення до нових версій з апстріму

source: When you upgrade to a new upstream version, patches will often become out of date. They might need to be refreshed to match the new upstream source or they might need to be removed altogether.
es: Cuando actualiza a una nueva versión aguas arriba, los parches normalmente quedan obsoletos. Podría ser necesario actualizarlos para que coincidan con el nuevo código fuente de aguas arriba o podría incluso ser necesario eliminarlos completamente.

source: You should start by ensuring no patches are applied. Unfortunately a commit is needed before you can merge in the new upstream (this is `bug 815854`_)::
es: Debería comenzar por asegurarse de que no se aplica ningún parche. Desafortunadamente hace falta una confirmación antes de que se pueda combinar con lo nuevo de aguas arriba (este es el error `bug 815854`_::

source: Then upgrade to the new version::
es: Luego actualice a la nueva versión::

source: Then apply the patches one at a time to check for problems::
es: Entonces aplique los cambios uno cada vez para comprobar si hay problemas::

source: If it can be reverse-applied this means the patch has been applied already by upstream, so we can delete the patch::
es: Si puede ser aplicado a la inversa significa que el parche ya ha sido aplicado aguas arriba, de forma que ya se puede borrar::
uk: Якщо для латки вказано ``it can be reverse-applied``, значить латку вже було застосовано апстрімом, тож ми можемо вилучити цю латку::

source: Then carry on::
es: Luego continúe::
uk: Потім продовжуйте::

source: It is a good idea to run refresh, this will update the patch relative to the changed upstream source::
es: Es una buena idea hacer un refresco, lo que actualizará el parche relativo a los fuentes cambiados aguas arriba::
uk: Непоганою думкою буде виконати refresh, це оновить латку відносно змін джерельного коду в апстрімі::

source: Then commit as usual::
es: Luego confirme como siempre::
uk: Потім виконайте фіксацію, як звичайно::

source: Making A Package Use Quilt
es: Hacer que un paquete use Quilt
uk: Створення пакунку з використанням Quilt

source: Modern packages use Quilt by default, it is built into the packaging format. Check in ``debian/source/format`` to ensure it says ``3.0 (quilt)``.
es: Los paquetes modernos usan Quilt de forma predeterminada, están incluido en el formato de empaquetado. Compruebe «debian/source/format» para asegurarse que pone «3.0 (quilt».
uk: Сучасні пакунки використовують Quilt типово, це вбудовано у формат джерельних файлів пакунку. Перевірте, що в ``debian/source/format`` вказано ``3.0 (quilt)``.

source: Older packages using source format 1.0 will need to explicitly use Quilt, usually by including a makefile into ``debian/rules``.
es: Los paquetes más antiguos que usen el formato fuente 1.0 necesitarán usar Quilt explícitamente, normalmente incluyéndo un archivo makefile en «debian/rules».
uk: Для старіших пакунків, що використовують формат 1.0, необхідно використовувати Quilt явно, зазвичай за допомогою включення make-файлу у ``debian/rules``.

source: Other Patch Systems
es: Otros sistemas de parches
uk: Інші системи керування латками

source: Other patch systems used by packages include ``dpatch`` and ``cdbs simple-patchsys``, these work similarly to Quilt by keeping patches in debian/patches but have different commands to apply, un-apply or create patches. You can use ``edit-patch``, shown in previous chapters, as a reliable way to work with all systems.
es: Otros sistemas de parches que se usan con los paquetes incluyen «dpatch» y «cdbs simple-patchsys», que funcionan de forma similar a Quilt, manteniendo los parches en debian/patches pero usan diferentes órdenes para aplicarlos, des-aplicarlos o crear parches. Puede usar «edit-patch», mostrado en capítulos anteriores, como una forma fiable de trabajar con todos los sistemas.

source: In even older packages changes will be included directly to sources and kept in the ``diff.gz`` source file. This makes it hard to upgrade to new upstream versions or differentiate between patches and is best avoided.
es: En paquetes todavía más antiguos los cambios se incluirán directamente en los fuentes y los mantendrán el archivo fuente ``diff.gz`. Esto complica la actualización a nuevas versiones de aguas arribas o distinguir entre parches por lo que lo mejor es evitarlo.
uk: У старіших пакунках зміни будуть включені напряму у джерела і зберігатися у джерельному файлі ``diff.gz``. Це робить складнішим процес оновлення до нових версій апстріму або відмінності між латками - ліпше уникати.

source: Bazaar Loom is a way to keep patches as part of bzr trees, see :doc:`Working with Patches via Loom<./udd-patchsys>` for more information.
es: Bazaar Loom is una manera de mantener los parches como parte de árboles bzr, véase :doc:`Trabajar con parches vía Loom<./udd-patchsys>` para más información.

source: Do not change a package's patch system without discussing it with the Debian maintainer or relevant Ubuntu team. If there is no existing patch system then feel free to add Quilt.
es: No cambie el sistema de parches de un paquete sin haberlo discutido con el mantenedor de Debian o el equipo pertinente de Ubuntu. Si no existe un sistema parches no tenga problemas en añadir Quilt.
uk: Не змінюйте систему латання, не обміркувавши це з супроводжуючим Debian або командою Ubuntu яка має відношення до справи. Якщо існуючої системи латання немає, можете додати Quilt.

source: Packaging Python modules and applications
es: Empaquetar módulos y aplicaciones de Python

source: Our packaging follows Debian’s `Python policy`_. We will use the `python-markdown`_ package as an example, which can be downloaded from `PyPI`_. You can look at its packaging at its `Subversion repository`_.
es: Nuestro empaquetado sigue la `Python policy`_ de Debian. Usaremos el paquete `python-markdown`_ como ejemplo, el cual se puede descargar desde `PyPI`_. Puede ver su empaquetado en su `Subversion repository`_.

source: There are two types of Python packages — *modules* and *apps*.
es: Existen dos tipos de paquetes de Python: *módulos* y *aplicaciones*.

source: At the time of writing, Ubuntu has two incompatible versions of Python — *2.x* and *3.x*. ``/usr/bin/python`` is a symbolic link to a default Python 2.x version, and ``/usr/bin/python3`` — to a default Python 3.x version. Python modules should be built against all supported Python versions.
es: En el momento de escribir esto, Ubuntu tiene dos versiones incompatibles de Python: *2.x* y *3.x*. ``/usr/bin/python`` es un enlace simbólico a la versión Python 2.x predeterminada y ``/usr/bin/python3`, a la versión Python 3.x predeterminada. Los módulos de Python se deberían construir contra todas las versiones de Python soportadas.

source: If you are going to package a new Python module, you might find the ``py2dsc`` tool useful (available in `python-stdeb`_ package).
es: Si va a empaquetar un nuevo módulo Python, encontrará la herramienta ``py2dsc`` útil (disponible en el paquete `python-stdeb`_).

source: Python 2.x and 3.x versions of the package should be in separate binary packages. Names should have ``python{,3}-modulename`` format (like: ``python3-dbus.mainloop.qt``). Here, we will use ``python-markdown`` and ``python3-markdown`` for module packages and ``python-markdown-doc`` for the documentation package.
es: Las versiones Python 2.x y 3.x del paquete deberían estar en paquetes binarios separados. Los nombres deberían tener el formato ``python{,3}-modulename`` (como: ``python3-dbus.mainloop.qt``). Aquí usaremos ``python-markdown`` y ``python3-markdown`` para los paquetes del módulo y ``python-markdown-doc`` para el paquete de documentación.

source: Things in ``debian/control`` that are specific for a Python package:
es: Elementos de ``debian/control`` que son específicos para los paquetes Python:

source: The section of module packages should be ``python``, and ``doc`` for the documentation package. For an application, a single binary package will be enough.
es: La sección de los paquetes de módulos debería ser ``python`` y ``doc`` para el paquete de documentación. Para una aplicación, un simple paquete binario será suficiente.

source: We should add build dependencies on ``python-all (>= 2.6.6-3~)`` and ``python3-all (>= 3.1.2-7~)`` to make sure Python helpers are available (see the next section for details).
es: Deberían añadirse dependencias de compilación a `python-all (>= 2.6.6-3~)`` y ``python3-all (>= 3.1.2-7~)`` para asegurarse de que los asistentes de Python están disponibles (véase la siguiente sección para más detalles).

source: It’s recommended to add ``X-Python-Version`` and ``X-Python3-Version`` fields — see “`Specifying Supported Versions`_” section of the Policy for details. For example::
es: Se recomienda añadir los campos ``X-Python-Version`` y ``X-Python3-Version``, véase la sección «`Specifying Supported Versions`_» de la política para más información. Por ejemplo::

source: If your package works only with Python 2.x or 3.x, build depend only on one ``-all`` package and use only one ``-Version`` field.
es: Si su paquete funciona sólo con Python 2.x o 3.x, la compilación depende solo de un paquete ``-all`` y usa solo un campo ``-Version``.

source: Module packages should have ``{python:Depends}`` and ``{python3:Depends}`` substitution variables (respectively) in their dependency lists.
es: Los paquetes de módulos deberían tener variables de sustitución ``{python:Depends}`` y ``{python3:Depends}`` (respectivamente) en sus listas de dependencias.

source: The recommended helpers for python modules are ``dh_python2`` and ``dh_python3``. Unfortunately, ``debhelper`` doesn’t yet build Python 3.x packages automatically (see `bug 597105`_ in Debian BTS), so we’ll need to do that manually in override sections (skip this if your package doesn’t support Python 3.x).
es: Los asistentes recomendados para módulos python son ``dh_python2`` y ``dh_python3``. Desafortunadamente, ``debhelper`` no compila todavía paquetes Python 3.x automáticamente (véase `bug 597105`_ en Debian BTS), así que deberá hacerlo manualmente en las secciones «override» (omita esto si su paquete no soporta Python 3.x).

source: Here’s our ``debian/rules`` file (with annotations):
es: Aquí tiene nuestro archivo ``debian/rules`` (con anotaciones):

source: It is also a good practice to run tests during the build, if they are shipped by upstream. Usually tests can be invoked using ``setup.py test`` or ``setup.py check``.
es: También es una buena práctica ejecutar pruebas durante la compilación, si se distribuyen desde aguas arriba. Normalmente las pruebas se pueden invocar usando ``setup.py test`` o ``setup.py check``.

source: Python 2.x modules are installed into ``/usr/share/pyshared/`` directory, and symbolic links are created in ``/usr/lib/python2.x/dist-packages/`` for every interpreter version, while Python 3.x ones are all installed into ``/usr/lib/python3/dist-packages/``.
es: Los módulos de Python ".x se instalan en el directorio ``/usr/share/pyshared/`` y se crean enlaces simbólicos en ``/usr/lib/python2.x/dist-packages/`` para cada versión del intérprete, mientras que los de Python 3.x se instalan en ``/usr/lib/python3/dist-packages/``.

source: If your package is an application and has private Python modules, they should be installed in ``/usr/share/module``, or ``/usr/lib/module`` if the modules are architecture-dependent (e.g. extensions) (see “`Programs Shipping Private Modules`_” section of the Policy).
es: Si su paquete es una aplicación y tiene módulos de Python privados, debería instalarse en ``/usr/share/module`` o en ``/usr/lib/module` si los módulos son dependientes de la arquitectura (por ejemplo, extensiones). Véase la sección de programas que incluyen módulos privados (“`Programs Shipping Private Modules`_”) de la política.

source: So, our ``python-markdown.install`` file will look like this (we’ll also want to install a ``markdown_py`` executable)::
es: Así que nuestro archivo ``python-markdown.install`` se parecerá a esto (también queremos instalar un ejecutable ``markdown_py``)::

source: and ``python3-markdown.install`` will only have one line::
es: y ``python3-markdown.install`` tendrá únicamente una línea::

source: The ``-doc`` package
es: El paquete ``-doc``

source: The tool most commonly used for building Python docs is `Sphinx`_. To add Sphinx documentation to your package (using ``dh_sphinxdoc`` helper), you should:
es: La herramientas más comúnmente usada para compilar documentos Python es `Sphinx`_, Para añadir documentación Sphinx a su paquete (usando el asistente ``dh_sphinxdoc``), debería:

source: Add a build-dependency on ``python-sphinx`` or ``python3-sphinx`` (depending on what Python version do you want to use);
es: Añadir una dependencia de compilación a ``python-sphinx`` o a ``python3-sphinx`` (dependiendo de la versión de Python que desee usar);

source: Append ``sphinxdoc`` to the ``dh --with`` line;
es: Añadir ``sphinxdoc`` a la línea ``dh --with``;
