Repository: canonical/ubuntu-packaging-guide
Catalog: po/*.po
Languages: es, uk

source: Many Ubuntu packages are based on the packages in Debian, UDD also imports the Debian package into our branches. In the *kdetoys* branch above the Debian versions from *unstable* are from the merge with blue circles while those from *Debian experimental* are from the merge with yellow circles. Debian releases are tagged with their version number, e.g., ``4:4.2.2-1``.
es: Muchos paquetes de Ubuntu se basan en paquetes de Debian, UDD también importa el paquete de Debian en nuestras ramas. En la rama *kdetoys* anterior las versiones Debian de *unstable* vienen de la fusión con los círculos azules, mientras que las de *Debian experimental* vienen de fusiones con los círculos amarillos. Las versiones de Debian están etiquetadas con su número de versión, por ejemplo, ``4:4.2.2-1``.
uk: Багато пакунків Ubuntu засновані на пакунках в Debian, UDD також імпортує й пакунок Debian у наші гілки. У гілці *kdetoys* вище версії Debian з *unstable* після об’єднання позначені синіми колами, у той час як з *Debian experimental* після об’єднання позначені жовтими. Релізи Debian позначені номерами своїх версій, наприклад, ``4:4.2.2-1``.

source: So from a UDD branch you can see the complete history of changes to the package and compare any two versions. For example, to see the changes between version 4.2.2 in Debian and the 4.2.2 in Ubuntu use::
es: Así que desde una rama UDD puede ver el historial completo de cambios del paquete y comparar dos versiones cualesquiera. Por ejemplo, para ver los cambios entre la versión 4.2.2 en Debian y la 4.2.2 en Ubuntu use::
uk: Таким чином з UDD-гілки Ви можете побачити повну історію змін пакунку й порівняти будь-які дві версії. Наприклад, щоб побачити відмінності між версією 4.2.2 в Debian і 4.2.2 в Ubuntu, використовуйте::

source: (This command uses *qbzr* for a GUI, run ``diff`` instead of ``qdiff`` for console output.)
es: (esta orden usa *qbzr* como IGU, ejecute «diff» en lugar de «qdiff» para una salida por consola).
uk: (Ця команда використовує графічний інтерфейс *qbzr*. Запустіть ``diff`` замість ``qdiff`` для виводу у консоль.)

source: From this we can clearly see what has changed in Ubuntu compared to Debian, very handy.
es: Con esto podemos ver claramente qué ha cambiado en Ubuntu comparado con Debian, lo que es muy útil.
uk: Тут ми можемо ясно побачити, що було змінено в Ubuntu у порівнянні з Debian-версією. Дуже зручно.

source: UDD branches use Bazaar, a distributed revision control system intended to be easy to use for those familiar with popular systems such as Subversion while offering the power of Git.
es: Las ramas UDD usan Bazaar, como sistema de control de versiones distribuido pensado para ser fácil de usar para gente familiarizada con otros sistemas populares como Subversion, pero ofreciendo la potencia de Git.
uk: Гілки UDD використовують Bazaar — розподілену систему керування версіями, яка проста у використанні для тих, хто знайомий з такими популярними системами, як Subversion, й у той же час уявляє усю міць Git.

source: To do packaging with UDD you will need to know the basics of how to use Bazaar to manage files. For an introduction to Bazaar see the `Bazaar Five Minute Tutorial <http://doc.bazaar.canonical.com/bzr.dev/en/mini-tutorial/index.html>`_ and the `Bazaar Users Guide <http://doc.bazaar.canonical.com/bzr.dev/en/user-guide/index.html>`_.
es: Para empaquetar con UDD necesitará tener nociones básicas de Bazaar para gestionar archivos. Como introducción a Bazaar consulte el `tutorial de cinco minutos de Bazaar y la `guía de usuario de Bazaar`Bazaar Five Minute Tutorial <http://doc.bazaar.canonical.com/bzr.dev/en/mini-tutorial/index.html>`_ `Bazaar Users Guide <http://doc.bazaar.canonical.com/bzr.dev/en/user-guide/index.html>`_.

source: Limitations of UDD
es: Limitaciones del UDD
uk: Обмеження UDD

source: Ubuntu Distributed Development is a new method for working with Ubuntu packages. It currently has some notable limitations:
es: El desarrollo distribuido de Ubuntu es un nuevo método para trabajar con paquetes de Ubuntu. Actualmente tiene algunas limitaciones importantes:
uk: Ubuntu Distributed Development — новий метод роботи з пакунками Ubuntu. На даний час він має деякі суттєві обмеження:

source: Doing a full branch with history can take a lot of time and network resources. You may find it quicker to do a lightweight checkout ``bzr checkout --lightweight ubuntu:kdetoys`` but this will need a network access for any further bzr operations.
es: Realizar una bifurcación completa con historial puede suponer mucho tiempo y recursos d ered. Puede resultar más rápido realizar una extracción ligera «bzr checkout --lightweight ubuntu:kdetoys» pero esto necesitará de acceso a la red para cualquier operación de bzr posterior.
uk: Створення повної гілки з історією може забрати багато часу та мережевих ресурсів. Можливо Вам швидше буде зробити легке налагодження ``bzr checkout --lightweight ubuntu:kdetoys``, але тоді знадобиться мережевий доступ для будь-яких подальших операцій bzr.

source: Working with patches is fiddly. Patches can be seen as a branched revision control system, so we end up with RCS on top of RCS.
es: Trabajar con parches es engorroso. Los parches se pueden considerar como un sistema de control de versiones bifucardo, así que se termina con un RCS sobre otro RCS.
uk: Робота над латками дуже клопітка. Латки можна розглядати як розгілковану переробку системи керування, таким чином ми отримуємо RCS поверх RCS.

source: There is no way to build directly from branches. You need to create a source package and upload that.
es: No hay manera de construir directamente desde las ramas. Necesita crear un paquete fuente y subirlo.
uk: Немає способу створювати білди напряму з гілок. Потрібно створювати джерельний пакунок і завантажувати його.

source: Some packages have not been successfully imported into UDD branches. Recent versions of Bazaar will automatically notify you when this is the case. You can also check the `status of the package importer`_ manually before working on a branch.
es: Algunos paquetes no se han importado con éxito en ramas UDD. Las versiones recientes de Bazaar notificarán automáticamente cuando se dé este caso. También puede comprobar manualmente el estado del importador de paquetes `status of the package importer`_ antes de trabajar en una rama.

source: All of the above are being worked on and UDD is expected to become the main way to work on Ubuntu packages soon. However currently most teams within Ubuntu do not yet work with UDD branches for their development. However because UDD branches are the same as the packages in the archive any team should be able to accept merges against them.
es: Se está trabajando en todo lo anterior y se espera que UDD se convierta en la principal forma de trabajar en paquetes de Ubuntu próximamente. Sin embargo, actualmente la mayoría de los equipos dentro de Ubuntu todavía no trabajan con ramas UUD para sus desarrollos. Puesto que las ramas UDD son lo mismos que los paquetes en el repositorio todos los equipos deberían ser capaces de aceptar fusiones contra ellas.
uk: Над усім вищеперерахованим наразі ведеться робота й очікується, що UDD незабаром стане основним способом роботи над пакунками Ubuntu. Втім, зараз більшість команд Ubuntu ще не працювали з гілками UDD. Але оскільки UDD гілки є тим самим, що й пакунки у архіві, будь-яка команда має бути у змозі з ними працювати.

source: Getting The Latest
es: Obtener lo último
uk: Отримання останніх змін

source: If someone else has landed changes on a package, you will want to pull those changes in your own copies of the package branches.
es: Si alguien más ha introducido cambios en un paquete, deseará descargarse esos cambios en su propia copia de las ramas de paquetes.
uk: Якщо хтось ще вніс зміни у пакунок, Вам може знадобитися отримати ці зміни у Ваші копії гілок пакунку.

source: Updating your main branch
es: Actualizar su rama principal
uk: Оновлення Вашої основної гілки

source: Updating your copy of a branch that corresponds to the package in a particular release is very simple, simply use `bzr pull` from the appropriate directory::
es: Actualizar su copia de una rama que se corresponda con el paquete en una versión particular es muy sencillo, simplemente use «bzr pull» desde el directorio apropiado::
uk: Оновити Вашу копію гілки, що відповідає пакунку у певному випуску, дуже просто: виконайте `bzr pull` з відповідного каталогу::

source: This works wherever you have a checkout of a branch, so it will work for things like branches of `maverick`, `hardy-proposed`, etc.
es: Esto funciona cuando ha realizado una extracción de una rama, así que funcionará para ramas como «maverick», «hardy-proposed», etc.

source: Getting the latest in to your working branches
es: Obtener lo último en sus ramas de trabajo
uk: Отримання останніх змін у Ваші робочі гілки

source: Once you have updated your copy of a distroseries branch, then you may want to merge this in to your working branches as well, so that they are based on the latest code.
es: Una vez que haya actualizado su copia de una rama de una serie de la distribución, puede que desee fusionarlo en sus ramas de trabajo también, de forma que estén basadas en el código más reciente.
uk: Як тільки Ви оновили свою копію гілки distroseries, то можливо забажаєте також об’єднати її зі своїми робочими гілками, щоб вони працювали на найостаннішому коді.

source: You don't have to do this all the time though. You can work on slightly older code with no problems. The disadvantage would come if you were working on some code that someone else changed. If you are not working on the latest version then your changes may not be correct, and may even produce conflicts.
es: Sin embargo no tiene por qué hacer esto todo el tiempo. Puede trabajar con código ligeramente más antiguo sin problemas. La desventaja vendría si estuviera trabajando en algún código que alguien más ya haya cambiado. Si no está trabajando con la versión más reciente sus cambios puede que no sean correctos e incluso pueden producir conflictos.
uk: Втім, Вам не потрібно робити це щоразу. Ви можете без проблем працювати й з трохи старим кодом. Недоліки можуть виявитися якщо Ви працювали над кодом, який змінив хтось ще. Якщо Ви працюєте не з найостаннішою версією, Ваші зміни можуть бути некоректними, й навіть можуть стати причиною конфлікту.

source: The merge does have to be done at some point though. The longer it is left, the harder may be, so doing it regularly should keep each merge simple. Even if there are many merges the total effort would hopefully be less.
es: Sin embargo, la integración debe realizarse en algún punto. Cuando más se retrase, más complicado puede ser, así que realizarlo de forma regular debería hacer que cada integración sea sencilla. Incluso si hay muchas fusiones el esfuerzo total sería afortunadamente menor.
uk: Злиття потрібно виконувати у певний момент. Чим довше Ви працюєте - тим складнішим може бути процес у майбутньому. Виконуйте злиття регулярно, щоб максимально спростити процес. Якщо навіть злиттів багато, у підсумку потрібно застосовувати менше загальних зусиль.

source: To merge the changes you just need to use ``bzr merge``, but you must have committed your current work first::
es: Para fusionar los cambios solo necesita usar «bzr merge», pero debe haber confirmado su trabajo actual antes::
uk: Щоб виконати злиття змін, Вам потрібно використовувати ``bzr merge``, але спочатку Ви повинні відправити свою поточну роботу::

source: Any conflicts will be reported, and you can fix them up. To review the changes that you just merged use ``bzr diff``. To undo the merge use ``bzr revert``. Once you are happy with the changes then use ``bzr commit``.
es: Se reportarán todos los conflictos y podrá solucionarlos. Para revisar los cambios que acaba de fusionar use «bzr diff». Para deshacer el cambio use «bzr revert». Cuando esté satisfecho con los cambios use «bzr commit».
uk: Про будь-які конфлікти буде повідомлятися. Тож Ви зможете їх виправити у подальшому. Щоб розглянути зміни, використовуйте ``bzr diff``. Як тільки Ви закінчили роботу - використовуйте ``bzr commit``.

source: Referring to versions of a package
es: Referirse a versiones de un paquete
uk: Відносно версій пакунку

source: You will often think in terms of versions of a package, rather than the underlying Bazaar revision numbers. `bzr-builddeb` provides a revision specifier that makes this convenient. Any command that takes a ``-r`` argument to specify a revision or revision range will work with this specifier, e.g. ``bzr log``, ``bzr diff``, and so on. To view the versions of a package, use the ``package:`` specifier::
es: Frecuentemente pensará en términos de versiones de un paquete, en lugar de números de versión subyacentes de Bazaar. «bzr-builddeb» proporciona un especificador de revisión que hace que sea práctico. Cualquier orden que incluya un parámetro «-r» para especificar una revisión o un rango de revisiones funcionará con este especificador, como por ejemplo «bzr log», «bzr diff» y otros. Para ver la versión de un paquete, use el especificador «package»::
uk: Ви часто будете думати відносно версій пакунку, а не просто про цифри попередніх виправлень в Bazaar. `bzr-builddeb` для зручності надає специфікатор виправлень. Будь-яка команда, що використовує аргумент ``-r`` для вказувань виправлення або діапазону виправлень, буде працювати з цим специфікатором, наприклад, ``bzr log``, ``bzr diff``тощо. Щоб продивитися версії пакунку, використовуйте специфікатор ``package:``::

source: This shows you the difference between package version 0.1-1 and 0.1-2.
es: Esto le mostrará la diferencia entre las versiones de los paquetes 0.1-1 y 0.1-2.
uk: Ця команда покаже Вам відмінності між версіями пакунку 0.1-1 і 0.1-2.

source: Merging — Updating from Debian and Upstream
es: Combinar — Actualizar desde Debian y desde aguas arriba («Upstream»)
uk: Злиття — оновлення з Debian та апстріму

source: Merging is one of the strengths of Bazaar, and something we do often in Ubuntu development. Updates can be merged from Debian, from a new upstream release, and from other Ubuntu developers. Doing it in Bazaar is pretty simple, and all based around the ``bzr merge`` command [#]_.
es: Combinar (o integrar) es uno de los puntos fuertes de Bazaar, y algo que se realiza de forma frecuente en el desarrollo de Ubuntu. Las actualizaciones se pueden combinar desde Debian, desde una nueva revisión aguas arriba, y desde cambios de otros desarrolladores de Ubuntu. Realizarlo en Bazaar es muy sencillo, y todo está basado en torno al comando ``bzr merge`` [#]_.
uk: Злиття — це одна з найсильніших сторін Bazaar, й ми часто виконуємо його у процесі розробки Ubuntu. Злиття може бути виконано з оновленнями з Debian, з нового випуску у апстрімі й від інших розробників Ubuntu. Зробити це в Bazaar дуже просто, усе засновано на команді ``bzr merge`` [#]_.

source: While you are in any branch's working directory, you can merge in a branch from a different location. First check that you have no uncommitted changes::
es: Mientras se encuentre en el directorio de trabajo de una rama, puede integrar una rama desde una ubicación diferente. Primero compruebe que no tiene cambios sin confirmar::
uk: Знаходячись у робочому каталозі будь-якої гілки, Ви можете виконати злиття змін з гілки у іншому місці. Спочатку перевірте, що в Вас немає незафіксованих змін::

source: If that reports anything then you will either have to commit the changes, revert them, or shelve them to come back to later.
es: Si eso le reporta cualquier cosa, entonces tendrá que confirmar los cambios, revertirlos o dejarlos de lado para volver más tarde.
uk: Якщо з’явиться звіт, то Вам потрібно або застосувати зміни, зробити відкат, або відкласти вирішення (й повернутися до їх вирішення пізніше).

source: Merging from Debian
es: Fusionar desde Debian
uk: Злиття з Debian

source: Next run ``bzr merge`` passing the URL of the branch to merge from. For example, to merge from the version of the package in Debian Squeeze_ run::
es: Después ejecute «bzr merge» pasándole la URL de la rama desde la que fusionar. Por ejemplo, para fusionar desde la versión del paquete de Debian Squeeze_ ejecute::

source: This will merge the changes since the last merge point and leave you with changes to review. This may cause some conflicts. You can see everything that the ``merge`` command did by running::
es: Esto fusionará los cambios desde el último punto de integración y le dejará con cambios para revisar. Esto puede provocar algunos conflictos. Puede ver todo lo que la orden «merge» realizó ejecutando::
uk: Це додасть зміни, внесені з миті останнього злиття й дасть Вам усі зміни для огляду. Це може потягнути конфлікти. Ви можете побачити усі дії, виконані командою ``merge``, запустивши::

source: If conflicts are reported then you need to edit those files to make them look how they should, removing the *conflict markers*. Once you have done this, run::
es: Si se reportan conflictos necesitará editar esos archivos para que se vean como deben, eliminando los *marcadores de conflicto*. Una vez que lo haya realizado, ejecute::
uk: Якщо з’явиться звіт про конфлікти, Вам потрібно відредагувати відповідні файли, щоб привести їх до потрібного вигляду, прибравши конфліктуючі маркери (*conflict markers*). Як тільки Ви це зробите, виконайте::

source: This will resolve any conflicted files that you fixed, and then tell you what else you have to deal with.
es: Esto resolverá todos los archivos conflictivos que haya corregido y luego le dirá qué más tiene hacer.
uk: Це вирішить проблему з конфліктуючими файлами, які Ви виправляли, й повідомить що ще Вам потрібно зробити.

source: Once any conflicts are resolved, and you have made any other changes that you need, you will add a new changelog entry, and commit::
es: Una vez resueltos los conflictos y de que haya realizado los cambios que crea oportunos, deberá añadir una entrada en el registro de cambios (changelog) y realizará la confirmación::
uk: Після того, як усі конфлікти вирішено, й Ви внесли усі інші необхідні зміни, потрібно додати новий запис у changelog й виконати фіксацію::

source: as described earlier.
es: como se describió anteriormente.
uk: як був опис вище.

source: However, before you commit, it is always a good thing to check all the Ubuntu changes by running::
es: Sin embargo, antes de realizar la confirmación, siempre es conveniente comprobar todos los paquetes de Ubuntu ejecutando::
uk: Втім перед фіксацією завжди бажано перевірити усі зміни, зроблені в Ubuntu, виконавши::

source: which will show the differences between the Debian (0.6.10-5) and Ubuntu versions (0.6.10-5ubuntu1). In similar way you can compare to any other versions. To see all available versions run::
es: lo que le mostrará las diferencias entre las versiones Debian (0.6.10-5) y Ubuntu (0.6.10-5ubuntu1). De forma similar puede comparar cualquier otras versiones. Para ver todas las versiones disponibles ejecute::
uk: Ця команда покаже відмінності між версіями в Debian (0.6.10-5) і Ubuntu (0.6.10-5ubuntu1). Подібно Ви можете виконати порівняння з будь-якими іншими версіями. Щоб побачити усі доступні версії, виконайте::

source: After testing and committing the merge, you will need to seek sponsorship or upload to the archive in the normal way.
es: Después de probar y confirmar la fusión, necesitará buscar un patrocinador o subirlo al repositorio de la forma habitual.
uk: Після перевірки та фіксації злиття, Вам потрібно знайти поручителя або вивантажити пакунок у архів у звичний спосіб.

source: If you are going to build the source package from this merged branch, you would use the ``-S`` option to the ``bd`` command. One other thing you'll want to consider is also using the ``--package-merge`` option. This will add the appropriate ``-v`` and ``-sa`` options to the source package so that all the changelog entries since the last Ubuntu change will be included in your ``_source.changes`` file. For example::
es: Si va a construir el paquete fuente desde la rama fusionada, debería usar la opción «-S» en la orden «bd». Otra cosa que querrá tener en cuenta es usar la opción «--package-merge». Esto añadirá las opciones «-v» y «-sa» adecuadas al paquete fuente de forma que todas las entradas del registro de cambios (changelog) desde el último cambio de Ubuntu se incluyan en su archivo `_source.changes`. Por ejemplo::
uk: Якщо Ви збираєтеся створити джерельний пакунок з цієї об’єднаної гілки, то потрібно використовувати опцію ``-S`` команди ``bd``. Також Вам закортить розглянути використання опції ``--package-merge``. Це додасть відповідні опції ``-v`` і ``-sa`` до джерельного пакунку, щоб усі записи у лозі змін після останніх змін в Ubuntu були включені у Ваш файл ``_source.changes``. Наприклад::

source: Merging a new upstream version
es: Integrar una nueva versión de aguas arriba
uk: Злиття з новою версією з апстріму

source: When upstream releases a new version (or you want to package a snapshot), you have to merge a tarball into your branch.
es: Cuando aguas arriba se libera una nueva versión (o quiere empaquetar una instantánea), tendrá que integrar un archivo tar en su rama.
uk: Коли в апстрімі випускається нова версія (або Ви бажаєте запакувати зняток), Вам потрібно виконати злиття tar-архіву й Вашої гілки.

source: This is done using the ``bzr merge-upstream`` command. If your package has a valid ``debian/watch`` file, from inside the branch that you want to merge to, just type this::
es: Eso se hace mediante la orden «bzr merge-upstream». Si su paquete tiene un archivo «debian/watch» válido, desde dentro de la rama en la que quiere realizar la integración, escriba simplemente::
uk: Це робиться командою ``bzr merge-upstream``. Якщо у Вашому пакунку є файл ``debian/watch`` з правильним вмістом, то з каталогу гілки, у яку Ви збираєтеся злити зміни, просто наберіть::

source: This will download the tarball and merge it into your branch, automatically adding a ``debian/changelog`` entry for you. ``bzr-builddeb`` looks at the ``debian/watch`` file for the upstream tarball location.
es: Esto descargará el tar y lo integrará en su rama, añadiendo automáticamente por usted una entrada en «debian/changelog». «bzr-builddeb» busca en el archivo «debian/watch» la ubicación del archivo tar de aguas arriba.
uk: Команда завантажить тарбол й зіллє його у Вашу гілку, автоматично додавши запис в ``debian/changelog``. ``bzr-builddeb`` продивляється файл ``debian/watch``, щоб визначити місцезнаходження тарболу з апстріму.

source: If you do *not* have a ``debian/watch`` file, you'll need to specify the location of the upstream tarball, and the version manually::
es: Si *no* dispone de un archivo «debia/watch» necesitará indicar la ubicación del archivo tar de aguas arriba y la versión manualmente::
uk: Якщо в Вас *відсутній* файл ``debian/watch``, то Вам потрібно вручну вказати місцезнаходження тарболу з апстріму й версію::

source: The ``--version`` option is used to specify the upstream version that is being merged in, as the command isn't able to infer that (yet).
es: La opción «--version» se usa para especificar la versión de aguas arriba que se está integrando, ya que la orden no es capaz de deducirlo (de momento).
uk: Опція ``--version`` використовується для вказування версії апстріму, з якої виконується злиття, оскільки команда не здатна (поки) дізнатися її самостійно.
