Repository: canonical/ubuntu-packaging-guide
Catalog: po/*.po
Languages: es, uk

source: Now GPG will create a key for you, which can take a little bit of time; it needs random bytes, so if you give the system some work to do it will be just fine. Move the cursor around, type some paragraphs of random text, load some web page.
es: Ahora GPG creará la clave, lo que le puede llevar un tiempo; necesita algunos bytes aleatorios, así que si le da al sistema algún trabajado para hacer, mejor. Mueva el cursor, escriba algunos párrafos de texto aleatorio o cargue alguna página web.
uk: Тепер GPG створить для Вас ключ, що може зайняти певний час. Для його створення знадобляться випадкові байти, тому буде просто чудово, якщо Ви задасте своїй системі якусь роботу. Порухайте вказівник миші, наберіть декілька абзаців будь-якого тексту, завантажте будь-яку веб-сторінку.

source: Once this is done, you will get a message similar to this one::
es: Una vez hecho esto, recibirá un mensaje similar a::
uk: Коли процес буде завершено, Ви отримаєте повідомлення типу такого::

source: In this case ``43CDE61D`` is the *key ID*.
es: En este caso «43CDE61D» es el *ID de clave*.
uk: У даному випадку, ``43CDE61D`` — це ідентифікатор ключа (*key ID*).

source: Next, you need to upload the public part of your key to a keyserver so the world can identify messages and files as yours. To do so, enter::
es: Después necesitará cargar la parte pública de su clave a un servidor de claves, de forma que el resto del mundo pueda identificar los mensajes y archivos como suyos. Para hacerlo, escriba::
uk: Потім потрібно завантажити відкриту (public) частину Вашого ключа на сервер ключів, щоб усі могли ідентифікувати повідомлення і файли, як відправлені Вами. Для цього уведіть::

source: This will send your key to one keyserver, but a network of keyservers will automatically sync the key between themselves. Once this syncing is complete, your signed public key will be ready to verify your contributions around the world.
es: Esto mandará su clave a un servidor de claves, con lo que una red de servidores de claves la sincronizarán automáticamente entre ellos. Una vez que se complete esta sincronización, su clave pública firmada estará lista para verificar sus contribuciones por todo el mundo.

source: Create your SSH key
es: Crear su clave SSH
uk: Створення ключа SSH

source: SSH_ stands for *Secure Shell*, and it is a protocol that allows you to exchange data in a secure way over a network. It is common to use SSH to access and open a shell on another computer, and to use it to securely transfer files. For our purposes, we will mainly be using SSH to securely upload source packages to Launchpad.
es: SSH_ viene de *Secure Shell* (intérprete de órdenes seguro) y es un protocolo que le permite intercambiar datos de una forma segura en una red. Es habitual usar SSH para acceder a un intérprete de órdenes en otro equipo y usarlo para transferir archivos de forma segura. Para nuestros propósitos, usaremos SSH básicamente para subir paquetes fuentes a Launchpad.
uk: SSH_ або *Secure Shell* — це протокол, який дозволяє безпечно обмінюватися даними мережею. Звичайною практикою є використання SSH для доступу й відкриття командної оболонки на іншому комп’ютері й для безпечної пересилки файлів. З нашою метою ми переважно будемо використовувати SSH для безпечної відправки пакунків джерельного коду на Launchpad.

source: To generate an SSH key, enter::
es: Para generar una clave SSH, escriba::
uk: Щоб згенерувати ключ SSH, уведіть::

source: The default file name usually makes sense, so you can just leave it as it is. For security purposes, it is highly recommended that you use a passphrase.
es: El nombre de archivo por defecto normalmente tiene sentido, así que puede dejarlo tal cual. Por motivos de seguridad, se recomienda encarecidamente que use una frase de paso.
uk: Типове ім’я файлу цілком влаштує, тож можете залишити його як є. З метою безпеки настійно рекомендується вказати парольне гасло.

source: Set up pbuilder
es: Configurar pbuilder
uk: Налаштування pbuilder

source: ``pbuilder`` allows you to build packages locally on your machine. It serves a couple of purposes:
es: «pbuilder» le permite compilar paquetes localmente en su equipo. Sirve para un par de propósitos:
uk: ``pbuilder`` дозволяє локально збирати пакунки на Вашому комп’ютері. Він слугує декільком цілям:

source: The build will be done in a minimal and clean environment. This helps you make sure your builds succeed in a reproducible way, but without modifying your local system
es: La compilación se hará en un entorno mínimo y limpio. Esto le ayuda a asegurarse de que sus compilaciones se completan de una forma reproducible, pero sin modificar su sistema local.
uk: Збірка буде виконана у мінімальному й чистому середовищі. Це дасть можливість переконатися, що збірку вдастся успішно відтворити й на інших комп’ютерах, але при цьому допоможе уникнути змін у Вашій локальній системі

source: There is no need to install all necessary *build dependencies* locally
es: No es necesario instalar todas las *dependencias de compilación* necesarias de forma local.
uk: Зникає необхідність у локальному встановленні усіх *збірочних залежностей*

source: You can set up multiple instances for various Ubuntu and Debian releases
es: Puede configurar varias instancias para distintas versiones de Ubuntu y Debian.
uk: Можна налаштувати декілька екземплярів для різних випусків Ubuntu і Debian

source: Setting ``pbuilder`` up is very easy, run::
es: Configurar «pbuilder» es muy fácil, ejecute::
uk: Налаштувати ``pbuilder`` дуже просто. Наберіть ::

source: where <release> is for example `natty`, `maverick`, `lucid` or in the case of Debian maybe `sid`. This will take a while as it will download all the necessary packages for a "minimal installation". These will be cached though.
es: donde <versión> es, por ejemplo, «natty», «maverick», «lucid» o, en el caso de Debian, quizá «sid». Le llevará un rato ya que descargará todos los paquetes necesarios para una «instalación mínima». Sin embargo, estos paquetes serán cacheados.

source: Get set up to work with Launchpad
es: Preparar una configuración para trabajar con Launchpad
uk: Підготовка до роботи з Launchpad

source: With a basic local configuration in place, your next step will be to configure your system to work with Launchpad. This section will focus on the following topics:
es: Con una configuración local básica establecida, el siguiente paso será configurar el sistema para trabajar con Launchpad. Esta sección se centrará en los siguientes temas:
uk: Після того, як базова локальна конфігурація створена, наступним кроком буде налаштування системи для роботи з Launchpad. У цьому розділі ми сфокусуємося на таких питаннях:

source: What Launchpad is and creating a Launchpad account
es: Qué es Launchpad y la creación de una cuenta de Launchpad
uk: Що таке Launchpad й як створити обліковий запис на Launchpad

source: Uploading your GPG and SSH keys to Launchpad
es: Subir claves GPG y SSH a Launchpad
uk: Завантаження Ваших ключів GPG та SSH на Launchpad

source: Configuring Bazaar to work with Launchpad
es: Configurar Bazaar para trabajar con Launchpad
uk: Налаштування Bazaar для роботи з Launchpad

source: Configuring Bash to work with Bazaar
es: Configurar Bash para trabajar con Bazaar
uk: Налаштування Bash для роботи з Bazaar

source: About Launchpad
es: Acerca de Launchpad
uk: Відомості про Launchpad

source: Launchpad is the central piece of infrastructure we use in Ubuntu. It not only stores our packages and our code, but also things like translations, bug reports, and information about the people who work on Ubuntu and their team memberships. You will also use Launchpad to publish your proposed fixes, and get other Ubuntu developers to review and sponsor them.
es: Launchpad es la pieza central de la infraestructura usada en Ubuntu. No sólo almacena todos sus paquetes y código, sino también cosas tales como traducciones, informes de errores e información sobre la gente que trabaja en Ubuntu y su pertenencia a equipos. También usará Launchpad para publicar sus propuestas de solución y hacer que otros desarrolladores de Ubuntu las revisen y esponsoricen.
uk: Launchpad є центральним елементом інфраструктури, що використовується нами в Ubuntu. Він зберігає не лише наші пакунки й наш код, але й такі речі, як переклади, звіти про вади, а також інформацію про людей, що працюють над Ubuntu і їх приналежність до різних команд. Ви можете також використовувати Launchpad, щоб оголосити пропоновані Вами виправлення й попрохати інших розробників Ubuntu перевірити та підтримати їх.

source: You will need to register with Launchpad and provide a minimal amount of information. This will allow you to download and upload code, submit bug reports, and more.
es: Necesitará registrarse en Launchpad y proporcionar una cantidad mínima de información. Esto le permitirá descargar y subir código, enviar informes de error y más cosas.
uk: Вам потрібно буде зареєструватися на Launchpad та надати певну мінімальну кількість інформації про себе. Це дозволить Вам стягувати або відправляти джерельний код, відправляти звіти про вади тощо.

source: Besides hosting Ubuntu, Launchpad can host any Free Software project. For more information see the `Launchpad Help wiki <https://help.launchpad.net/>`_.
es: Además de hospedar a Ubuntu, Launchpad puede hospedar a cualquier otro proyecto de software libre. Para más información véase la `Launchpad Help wiki <https://help.launchpad.net/>`_.
uk: Крім хостингу Ubuntu, Launchpad може надавати місце для будь-якого вільного проґрамного проєкту. Додаткову інформацію дивіться на `Довідкових вікі-сторінках Launchpad <https://help.launchpad.net/>`_

source: Get a Launchpad account
es: Obtener una cuenta de Launchpad
uk: Створення облікового запису на Launchpad

source: If you don't already have a Launchpad account, you can easily `create one`_. If you have a Launchpad account but cannot remember your Launchpad id, you can find this out by going to https://launchpad.net/~ and looking for the part after the `~` in the URL.
es: Si no tiene todavía una cuenta de Launchpad, puede fácilmente `create one`_. Si tiene una cuenta de Launchpad pero no puede recordar su identificador de Launchpad, puede encontrarlo visitando https://launchpad.net/~ y mirando en la parte que sigue al símbolo «~» en la URL.

source: Launchpad's registration process will ask you to choose a display name. It is encouraged for you to use your real name here so that your Ubuntu developer colleagues will be able to get to know you better.
es: El proceso de registro de Launchpad le pedirá que elija un nombre de usuario. Se recomienda que use su nombre real de forma que los colegas desarrolladores de Ubuntu lleguen a conocerle mejor.
uk: При реєстрації на Launchpad Вас попрохають вибрати відображуване ім’я. Рекомендується вказати тут Ваше справжнє ім’я, щоб Ваші колеги - розробники Ubuntu могли краще з Вами познайомитися.

source: When you register a new account, Launchpad will send you an email with a link you need to open in your browser in order to verify your email address. If you don't receive it, check in your spam folder.
es: Cuando registre una nueva cuenta, Launchpad le enviará un correo con un enlace que deberá abrir en su navegador para verificar su dirección de correo electrónico. Si no lo recibe, compruebe su carpeta de correo no deseado (spam).
uk: При реєстрації нового облікового запису Launchpad відправить Вам листа з посиланням, яке потрібно відкрити у оглядачі тенет, щоб підтвердити вказану Вами адресу електронної пошти. Якщо Ви не отримали листа, перевірте теку небажаної пошти (спаму).

source: `The new account help page <https://help.launchpad.net/YourAccount/NewAccount>`_ on Launchpad has more information about the process and additional settings you can change.
es: `The new account help page <https://help.launchpad.net/YourAccount/NewAccount>`_ en Launchpad contiene más información sobre el proceso y parámetros adicionales que puede cambiar.

source: Upload your GPG key to Launchpad
es: Subir su clave GPG a Launchpad
uk: Завантаження Вашого ключа GPG на Launchpad

source: To find about your GPG fingerprint, run::
es: Para buscar su huella de GPG, ejecute::
uk: Щоб взнати свій відбиток ключа GPG (fingerprint), наберіть::

source: and it will print out something like::
es: y le mostrará algo como::
uk: й Ви побачите щось типу::

source: Head to https://launchpad.net/~/+editpgpkeys and copy the "Key fingerprint" into the text box. In the case above this would be ``5C28 0144 FB08 91C0 2CF3 37AC 6F0B F90F 43CD E61D``. Now click on "Import Key".
es: Diríjase a https://launchpad.net/~/+editpgpkeys y copie la huella de la clave («Key fingerprint») en la casilla de texto. En el caso anterior sería «5C28 0144 FB08 91C0 2CF3 37AC 6F0B F90F 43CD E61D». Ahora pulse en «Import Key» (importar clave).
uk: Зайдіть на https://launchpad.net/~/+editpgpkeys й скопіюйте дані з рядка «Key fingerprint» у текстове поле. У наведеному вище прикладі це буде ``5C28 0144 FB08 91C0 2CF3 37AC 6F0B F90F 43CD E61D``. Потім клацніть «Import Key».

source: Launchpad will use the fingerprint to check the Ubuntu key server for your key and, if successful, send you an encrypted email asking you to confirm the key import. Check your email account and read the email that Launchpad sent you. `If your email client supports OpenPGP encryption, it will prompt you for the password you chose for the key when GPG generated it. Enter the password, then click the link to confirm that the key is yours.`
es: Launchpad usará la huella para comprobar su clave en el servidor de claves de Ubuntu. Si tiene éxito, le enviará un correo electrónico cifrado, pidiéndole que confirme la clave importada. Compruebe su cuenta de correo electrónico y lea el mensaje que le ha enviado Launchpad. `Si su cliente de correo electrónico soporta el cifrado de OpenPGP, le pedirá la contraseña que eligió para la clave cuando la generó GPG. Escriba la contraseña, y luego pulse en el enlace que confirma que esa clave es suya.`
uk: Launchpad скористається відбитком ключа для перевірки наявності Вашого ключа на сервері ключів Ubuntu й, у випадку успіху, відправить Вам зашифроване повідомлення електронної пошти, з пропозицією підтвердити імпорт ключа. Перевірте свою пошту й прочитайте листа, отриманого з Launchpad. `Якщо Ваш клієнт електронної пошти підтримує шифрування OpenPGP, він запропонує увести пароль, який Ви вибрали при створенні ключа GPG. Уведіть пароль, потім клацніть на посиланні, аби підтвердити, що цей ключ належить Вам.`

source: Launchpad encrypts the email, using your public key, so that it can be sure that the key is yours. If your email software does not support OpenPGP encryption, copy the encrypted email's contents, type ``gpg`` in your terminal, then paste the email contents into your terminal window.
es: Launchpad cifra el mensaje, usando su clave pública, de forma que puede estar seguro de que esa clave es suya. Si su software de correo electrónico no soporta el cifrado de OpenPGP, copie el contenido del correo electrónico cifrado, escriba «gpg» en su terminal y luego copie el contenido de sul mensaje en su ventana del terminal.

source: Back on the Launchpad website, use the Confirm button and Launchpad will complete the import of your OpenPGP key.
es: De vuelta a la web de Launchpad, use el botón «Confirm» (confirmar) y Launchpad completará la importación de su clave OpenPGP.
uk: Повернувшись на сайт Launchpad, скористайтеся кнопкою «Confirm», щоб Launchpad завершив імпорт Вашого ключа OpenPGP.

source: Find more information at https://help.launchpad.net/YourAccount/ImportingYourPGPKey
es: Encuentre más información en https://help.launchpad.net/YourAccount/ImportingYourPGPKey
uk: Додаткову інформацію можна знайти на https://help.launchpad.net/YourAccount/ImportingYourPGPKey

source: Upload your SSH key to Launchpad
es: Subir su clave SSH a Launchpad
uk: Завантаження Вашого ключа SSH на Launchpad

source: Open https://launchpad.net/~/+editsshkeys in a web browser, also open ``~/.ssh/id_rsa.pub`` in a text editor. This is the public part of your SSH key, so it is safe to share it with Launchpad. Copy the contents of the file and paste them into the text box on the web page that says "Add an SSH key". Now click "Import Public Key".
es: Abra https://launchpad.net/~/+editsshkeys en su navegador web y abra también «~/.ssh/id_rsa.pub» en un editor de textos. Esta es la parte pública de su clave SSH, así que es seguro compartirla en Launchpad. Copie el contenido del archivo y péguelo en la casilla de texto de la página web que dice «Add an SSH key" (añadir una clave SSH). Ahora pulse «Import Public Key» (importar clave pública).
uk: Відкрийте у оглядачі тенет https://launchpad.net/~/+editsshkeys, а у текстовому редакторі файл ``~/.ssh/id_rsa.pub``. Це відкрита частина Вашого ключа SSH, тому можна без побоювань надати до неї спільний доступ на Launchpad. Скопіюйте вміст файлу й вставьте його у текстове поле на веб-сторінці з міткою «Add an SSH key». Потім клацніть «Import Public Key».

source: For more information on this process, visit the `creating an SSH keypair <https://help.launchpad.net/YourAccount/CreatingAnSSHKeyPair>`_ page on Launchpad.
es: Para más información sobre este proceso, visite la página `<creating an SSH keypair <https://help.launchpad.net/YourAccount/CreatingAnSSHKeyPair>`_ en Launchpad.

source: Configure Bazaar
es: Configurar Bazaar
uk: Налаштування Bazaar

source: Bazaar is the tool we use to store code changes in a logical way, to exchange proposed changes and merge them, even if development is done concurrently. It is used for the new Ubuntu Distributed Development method of working with Ubuntu packages.
es: Bazaar es la herramienta que se usa para almacenar cambios en el código de una manera lógica, para intercambiar los cambios propuestos y para combinarlos, incluso si el desarrollo se realiza de forma concurrente. Se usa para el nuevo método de desarrollo distribuido de Ubuntu para trabajar con paquetes de Ubuntu.
uk: Bazaar — це інструмент, який ми використовуємо для зберігання змін у коді, у логічний і передбачуваний спосіб, а також обміну пропонованими змінами й їх злиття, навіть у тому випадку, якщо розробка ведеться параллельно декількома людьми. Він використовується у новому методі роботи з пакунками Ubuntu — Ubuntu Distributed Development.

source: To tell Bazaar who you are, simply run::
es: Para decirle a Bazaar quién es usted, simplemente ejecute::
uk: Щоб повідомити Bazaar про те, хто Ви, просто наберіть::

source: `whoami` will tell Bazaar which name and email address it should use for your commit messages. With `launchpad-login` you set your Launchpad ID. This way code that you publish in Launchpad will be associated with you.
es: `whoami` le dirá a Bazaar qué nombre y dirección de correo electrónico debería usar para enviarle mensajes. Con `launchpad-login` establece su ID de Launchpad. De esta forma el código que publique en Launchpad se asociará a usted.
uk: `whoami` повідомить Bazaar, яке ім’я й адресу електронної пошти він повинен використовувати для Ваших коммітів. За допомогою `launchpad-login` Ви вказуєте свій Launchpad ID. Це код, який ідентифікує Ваш обліковий запис на Launchpad.

source: Note: If you can not remember the ID, go to https://launchpad.net/~ and see where it redirects you. The part after the "~" in the URL is your Launchpad ID.)
es: Nota: si no puede recordar el ID, visite https://launchpad.net/~ y mire a dónde le redirecciona. La parte tras el símbolo «~» en la URL es su ID de Launchpad.
uk: Нотатка: якщо Ви не пам’ятаєте свій ідентифікатор, перейдіть на https://launchpad.net/~ й подивіться, куди Вас переспрямовує ця сторінка. Частина URL після символу «~» — це й є Ваш Launchpad ID.

source: Configure your shell
es: Configurar el intérprete de órdenes
uk: Налаштування командної оболонки

source: Similar to Bazaar, the Debian/Ubuntu packaging tools need to learn about you as well. Simply open your `~/.bashrc` in a text editor and add something like this to the bottom of it::
es: De forma similar a Bazaar, las herramientas de empaquetado de Debian/Ubuntu necesitan conocerle. Simplemente abra su `~/.bashrc` en un editor de textos y añada lo siguiente al final del mismo::
uk: Як і Bazaar, інструментам створення пакунків Debian/Ubuntu знадобиться деяка інформація про Вас. Просто відкрийте `~/.bashrc` у текстовому редакторі й додайте внизу щось типу цього::

source: Now save the file and either restart your terminal or run::
es: Ahora guarde el archivo y reinicie su terminal o ejecute::
uk: Потім збережіть файл й перезапустіть термінал або наберіть::

source: (If you do not use the default shell, which is `bash`, please edit the configuration file for that shell accordingly.)
es: (si no usa el intérprete de órdenes por defecto, que es `bash`, edite el archivo de configuración de dicho intérprete como corresponda).
uk: (Якщо Ви не користуєтеся стандартною командною оболонкою `bash`, відредагуйте конфігураційний файл тієї оболонки, яку Ви полюбляєте використовувати.)

source: Ubuntu Packaging Guide
es: Guía de empaquetado de Ubuntu
uk: Посібник розробника Ubuntu

source: Ubuntu is not only a free and open source operating system, its platform is also open and developed in a transparent fashion. The source code for every single component can be obtained easily and every single change to the Ubuntu platform can be reviewed.
es: Ubuntu no solo un sistema operativo libre, gratuito y de código abierto, su plataforma también es abierta y está desarrollada de forma transparente. El código fuente para cada uno de los componentes se puede obtener fácilmente y todos los cambios realizados a la plataforma de Ubuntu pueden ser revisados.
uk: Ubuntu — не лише вільна операційна система з відкритим джерельним кодом, її платформа також є відкритою й забезпечує прозорість розробки. Можна легко отримати джерельний код для кожного окремого компонента, й кожну окрему зміну у платформі Ubuntu можна перевірити.

source: This means you can actively get involved in improving it and the community of Ubuntu platform developers is always interested in helping peers getting started.
es: Esto significa que puede involucrarse activamente en mejorarlo y que la comunidad de desarrolladores de la plataforma de Ubuntu está siempre interesada en ayudar a las personas que comienzan.
uk: Це означає, що Ви можете прийняти активну участь у її покращенні, й спільнота розробників платформи Ubuntu завжди зацікавлена у залученні нових участників.

source: The guide is split up into two sections:
es: La guía está separada en dos secciones:
uk: Цей посібник складається з двох розділів:

source: A list of articles based on tasks, things you want to get done.
es: Una lista de artículos basados en tareas, cosas que puede desear que se hagan.
uk: Перелік статтей, заснованих на певних завданнях, які Вам можливо знадобиться виконати.

source: A set of knowledge-base articles that dig deeper into specific bits of our tools and workflows.
es: Un conjunto de artículos de la base de conocimientos que profundizan en partes especificas de las herramientas y flujos de trabajo.
uk: Набір статтей бази знань, у яких детальніше розглядаються використовувані нами інструменти й робочі процеси.
