Repository: canonical/ubuntu-packaging-guide
Catalog: po/*.po
Languages: es, uk

source: To create a patch file that you can send to others or attach to a bug report for sponsorship, run::
es: Para crear un archivo de parche que pueda enviar a otros o adjuntando a un informe de error para su patrocinio, ejecute::
uk: Щоб створити файл латки, який можна відправити іншим або прикласти до звіту про ваду для схвалення, виконайте::

source: Applying a Debdiff
es: Aplicar un Debdiff
uk: Застосування Debdiff

source: In order to apply a debdiff, first make sure you have the source code of the version that it was created against::
es: Para aplicar un debdiff, primero asegúrese de que tiene el código fuente de la versión para la que se creó::
uk: Щоб застосувати debdiff, потрібно мати джерельний код версії, на основі якої він був створений::

source: Then in a terminal, change the to the directory where the source was uncompressed::
es: Luego, en un terminal, entre en el directorio en el que se ha descomprimido el fuente::

source: A debdiff is just like a normal patch file. Apply it as usual with::
es: Un debdiff es igual que un archivo de parche normal. Aplíquelo de la forma habitual con::
uk: Фактично, debdiff схожий на звичайний файл латки. Застосуйте його, як завжди, за допомогою::

source: Source package URLs
es: URLs de los paquetes fuente
uk: URL пакунків джерельного коду

source: Bazaar provides some very nice shortcuts for accessing Launchpad's source branches of packages in both Ubuntu and Debian.
es: Bazaar proporciona varios atajos muy buenos para acceder a las ramas fuentes de paquetes de Launchpad tanto de Ubuntu como de Debian.
uk: Bazaar надає декілька дуже зручних скорочень для доступу до гілок джерельного коду з Launchpad для пакунків як Ubuntu, так і Debian.

source: To refer to source branches use::
es: Para referirse a las ramas fuentes use::
uk: Щоб послатися на гілки джерельного коду, використовуйте::

source: where *package* refers to the package name you're interested in. This URL refers to the package in the current development version of Ubuntu. To refer to the branch of Tomboy in the development version, you would use::
es: donde *paquete* se refiere el nombre del paquete en el que está interesado. Esta URL se refiere al paquete en la versión de desarrollo actual de Ubuntu. Para referirse a la rama de Tomboy en la versión de desarrollo, debería usar::
uk: де *package* — ім’я пакунку, який Вам потрібен. Ця URL посилається на пакунки у поточній розроблюваній версії Ubuntu. Щоб послатися на гілку Tomboy у розроблюваній версії, потрібно використовувати::

source: To refer to the version of a source package in an older release of Ubuntu, just prefix the package name with the release's code name. E.g. to refer to Tomboy's source package in Maverick_ use::
es: Para referirse a la versión de un paquete fuente de una versión más antigua de Ubuntu, añada al nombre del paquete el prefijo con el código de nombre de la versión. Por ejemplo, para referirse al paquete fuente de Tomboy en Maverick_ use::

source: Since they are unique, you can also abbreviate the distro-series name::
es: Puesto que son únicos, también puede abreviar el nombre de las series de distribuciones::
uk: Оскільки перші літери кодових імен не повторюються, можна скоротити ім’я випуску::

source: You can use a similar scheme to access the source branches in Debian, although there are no shortcuts for the Debian distro-series names. To access the Tomboy branch in the current development series for Debian use::
es: Puede usar un esquema similar para acceder a las ramas fuentes de Debian, aunque en este caso no hay atajos para nos nombres de las series de distribuciones de Debian. Para acceder a la rama de Tomboy en la serie de desarrollo de Debian actual use::
uk: Схожу схему можна використовувати для доступу до гілок джерельного коду в Debian, хоч тут немає скорочень для імен випусків Debian. Щоб отримати доступ до гілки Tomboy у поточному розроблюваному випуску Debian, використовуйте::

source: and to access Tomboy in Debian Lenny_ use::
es: y para acceder a Tomboy en Debian Lenny_ use::

source: Getting the source
es: Obtener el código fuente
uk: Отримання джерельного коду

source: Every source package in Ubuntu has an associated source branch on Launchpad. These source branches are updated automatically by Launchpad, although the process is not currently foolproof.
es: Cada paquete fuente de Ubuntu tiene asociada una rama fuente en Launchpad. Estas ramas fuentes son actualizadas automáticamente por Launchpad, aunque el proceso actualmente no es infalible.
uk: Кожен пакунок джерельного коду в Ubuntu пов’язаний з гілкою джерельного коду на Launchpad. Launchpad автоматично оновлює ці гілки джерельного коду, хоч процес не повністю «захищений від дурня».

source: There are a couple of things that we do first in order to make the workflow more efficient later. Once you are used to the process you will learn when it makes sense to skip these steps.
es: Hay un par de cosas que se hacen antes para que el flujo de trabajo posterior sea más eficiente. Una vez que se acostumbre al proceso aprenderá cuando puede saltarse estos pasos.
uk: Є декілька речей, які ми зробимо у першу чергу, щоб зробити робочий процес ефективнішим напотім. Після того, як Ви засвоїте процес, Ви взнаєте, коли є сенс пропускати ці етапи.

source: Creating a shared repository
es: Crear un repositorio compartido
uk: Створення загальнодоступного сховища

source: Say that you want to work on the Tomboy package, and you've verified that the source package is named ``tomboy``. Before actually branching the code for Tomboy, create a shared repository to hold the branches for this package. The shared repository will make future work much more efficient.
es: Digamos que desea trabajar en el paquete Tomboy, y que ha comprobado que el paquete fuente se llama ``tomboy``. Antes de efectuar la bifurcación del código de Tomboy, cree un repositorio compartido para mantener las ramas de este paquete. Este repositorio compartido hará que el trabajo futuro sea mucho más eficiente.
uk: Наприклад, Ви бажаєте працювати над пакунком Tomboy, й Ви вже перевірили, що джерельний пакунок називається ``tomboy``. Перед фактичним гілкуванням коду для Tomboy створіть загальноступне сховище для зберігання гілок цього пакунку. Загальнодоступне сховище зробить майбутню роботу ефективнішою.

source: Do this using the `bzr init-repo` command, passing it the directory name we would like to use::
es: Hágalo usando la orden «bzr init-repo», pasándole el nombre de directorio que le gustaría usar::
uk: Скористайтеся для цього командою `bzr init-repo`, передавши їй ім’я каталогу, який Ви бажаєте використовувати::

source: You will see that a `tomboy` directory is created in your current working area. Change to this new directory for the rest of your work::
es: Verá que se crea un directorio «tomboy» en su área de trabajo actual. Cambie a este nuevo directorio para el resto del proceso::
uk: Ви побачите, що у Вашій поточній робочій області створено каталог `tomboy`. Перейдіть у нього для продовження роботи::

source: Getting the trunk branch
es: Obtener la rama troncal
uk: Отримання гілки trunk

source: We use the `bzr branch` command to create a local branch of the package. We'll name the target directory `tomboy.dev` just to keep things easy to remember::
es: Se usa la orden «bzr branch» para crear una rama local del paquete. Llamaremos al directorio destino «tomboy.dev» sólo para mantenerlo fácil de recordar::
uk: Ми використовуємо команду `bzr branch` для створення локальної гілки пакунку. Каталог призначення назвемо `tomboy.dev`, просто тому, що так легше запам’ятати::

source: The tomboy.dev directory represents the version of Tomboy in the development version of Ubuntu, and you can always ``cd`` into this directory and do a `bzr pull` to get any future updates.
es: El directorio tomboy.dev representa la versión de Tomboy en la versión de desarrollo de Ubuntu y siempre puede cambiarse («cd») a este directorio y hacer «bzr pull» para obtener actualizaciones futuras.
uk: Каталог tomboy.dev представляє собою версію Tomboy у розроблюваній версії Ubuntu, й Ви завжди можете перейти у цей каталог та виконати `bzr pull` для отримання будь-яких майбутніх оновлень.

source: Ensuring the version is up to date
es: Asegurarse de que la versión está actualizada
uk: Перевірка актуальності версії

source: When you do your ``bzr branch`` you will get a message telling you if the packaging branch is up to date. For example::
es: Cuando hace «bzr branch» obtendrá un mensaje indicándole si la rama de empaquetado está actualizada. Por ejemplo::
uk: Коли Ви робите свою ``bzr branch``, то отримаєте повідомлення про те чи є гілка пакунків актуальною. Наприклад::

source: Occasionally the importer fails and packaging branches do not match what is in the archive. A message saying::
es: Ocasionalmente el importador falla y las ramas de empaquetado no coincidirán con lo que hay en el repositorio. Un mensaje diciendo::
uk: Інколи імпорт не відбувається успішно й гілки пакунку не збігаються з тими, що знаходяться у архіві. Повідомлення::

source: means the importer has failed. You can find out why on http://package-import.ubuntu.com/status/ and `file a bug on the UDD project`_ to get the issue resolved.
es: significa que el importador ha fallado. Puede averiguar por qué en http://package-import.ubuntu.com/status/ y presentar un error en el proyecto `file a bug on the UDD project`_ para hacer que se resuelva la incidencia.

source: Upstream Tar
es: Tar aguas arriba («upstream»)
uk: Tar-файл з апстріму

source: You can get the upstream tar by running::
es: Puede obtener un tar de aguas arriba ejecutando::
uk: Отримати tar з апстріму можна за допомогою::

source: This will try a number of methods to get the upstream tar, firstly by recreating it from the ``upstream-x.y`` tag in the bzr archive, then by downloading from the Ubuntu archive, lastly by running ``debian/rules get-orig-source``. The upstream tar will also be recreated when using bzr to build the package::
es: Esto probará varios métodos para obtener el archivo tar de aguas arriba, primero recreándolo desde la etiqueta «upstream-x.y» del archivo bzr, luego descargándolo desde el repositorio de Ubuntu y finalmente ejecutando «debian/rules get-orig-source». El tar de aguas arriba también se recreará cuando se usa bzr para construir el paquete::
uk: Таким чином пробуються декілька методів для потрапляння в tar апстріму, спочатку відтворюючи його з тегу ``upstream-x.y`` у архіві bzr, потім стягуючи з архіву Ubuntu, а потім запускаючи ``debian/rules get-orig-source``. Tar апстріму також буде відтворений при використанні bzr для побудови пакунку::

source: The `builddeb` plugin has several `configuration options`_.
es: El complemento «builddeb» tiene varias opciones de configuración `configuration options`_.

source: Getting a branch for a particular release
es: Obtener una rama de una versión en particular
uk: Отримання гілки для певного випуску

source: When you want to do something like a `stable release update`_ (SRU), or you just want to examine the code in an old release, you'll want to grab the branch corresponding to a particular Ubuntu release. For example, to get the Tomboy package for Maverick do::
es: Cuando desee hacer algo como una `stable release update`_ (SRU, actualización de versión estable) o si simplemente quiere examinar el código de una versión antigua, deberá obtener la rama correspondiente a una versión de Ubuntu en particular. Por ejemplo, para obtener el paquete de Tomboy para Maverick haga::

source: Importing a Debian source package
es: Importar un paquete fuente de Debian
uk: Імпорт пакунку джерельного коду Debian

source: If the package you want to work on is available in Debian but not Ubuntu, it's still easy to import the code to a local bzr branch for development. Let's say you want to import the `newpackage` source package. We'll start by creating a shared repository as normal, but we also have to create a working tree to which the source package will be imported (remember to cd out of the `tomboy` directory created above)::
es: Si el paquete en el que desea trabajar está disponible en Debian, pero no en Ubuntu, sigue siendo fácil importar el código a una rama de bzr local para el desarrollo. Digamos que quiere importar el paquete fuente «newpackage». Empezaremos por crear un repositorio compartido como habitualmente, pero también debemos crear un árbol de trabajo en el que importar el paquete fuente (recuerde salir del directorio «tomboy» creado anteriormente)::
uk: Якщо пакунок, над яким Ви бажаєте працювати, доступний в Debian, але не в Ubuntu - код легко імпортувати у локальну гілку bzr для розробки. Наприклад, Ви бажаєте імпортувати джерельний пакунок `newpackage`. Ми почнемо із створення загальнодоступного сховища у якості звичайного, але нам також потрібно створити робоче дерево, у яке буде імпортовано джерельний пакунок (не забудьте виконати cd out директорії `tomboy`, створеній вище)::

source: As you can see, we just need to provide the remote location of the dsc file, and Bazaar will do the rest. You've now got a Bazaar source branch.
es: Como puede ver, solo hace falta proporcionar la ubicación remota del archivo dsc, y Bazaar hará el resto. Ya ha obtenido la rama fuente de Bazaar.
uk: Як Ви бачите - потрібно просто вказати віддалене розташування файлу dsc, а Bazaar зробить решту. Тепер в Вас є джерельна гілка Bazaar.

source: Ubuntu Distributed Development — Introduction
es: Desarrollo distribuido de Ubuntu («Ubuntu Distributed Development», UDD) — Introducción
uk: Розподілена розробка Ubuntu — вступ

source: This guide focuses on packaging using the *Ubuntu Distributed Development* (UDD) method.
es: Esta guía se centra en el empaquetado usando el método de *desarrollo distribuido de Ubuntu* (UDD).
uk: Цей посібник фокусується на роботі з пакунками з використанням методу *Ubuntu Distributed Development* (UDD).

source: *Ubuntu Distributed Development* (UDD) is a new technique for developing Ubuntu packages that uses tools, processes, and workflows similar to generic distributed version control system (DVCS) based software development. The DVCS used for UDD is Bazaar_.
es: El *desarrollo distribuido de Ubuntu* (UDD) es una nueva técnica para desarrollar paquetes de Ubuntu que usan herramientas, procesos y flujos de trabajos similares a desarrollos de software basados en sistemas de control de versiones distribuidos (DVCS) genéricos.
uk: *Ubuntu Distributed Development* (UDD) — це нова технологія розробки пакунків Ubuntu, що використовує інструменти, процеси й послідовності дій, характерні для типової схеми розробки проґрам, заснованій на розподіленій системі керування версіями (DVCS). DVCS, що використовується в UDD — це Bazaar_.

source: Traditional Packaging Limitations
es: Limitaciones del empaquetado tradicional
uk: Обмеження традиційних методів створення пакунків

source: Traditionally Ubuntu packages have been kept in tar archive files. A traditional source package is made up of the upstream source tar, a "debian" tar (or compressed diff file for older packages) containing the packaging and a .dsc meta-data file. To see a traditional package run::
es: Tradicionalmente los paquetes de Ubuntu se han mantenido en archivos comprimidos tar. Un paquete fuente tradicional se compone del tar fuente de aguas arriba, un tar de «debian» (o archivo diff comprimido para paquetes más antiguos) que contiene el empaquetado y un archivo .dsc de metadatos. Para ver un paquete tradicional ejecute::
uk: Традиційно пакунки Ubuntu зберігаються у архівних tar-файлах. Традиційний пакунок джерельного коду складається з tar-файлу з джерельним кодом із апстріму, "debian" tar-файлу (або стисненого diff-файлу для старіших пакунків), що містить набір вхідних файлів для ствроення пакунку, і файлу .dsc з метаданими. Щоб подивится на традиційний пакунок, виконайте команду::

source: This will download the upstream source ``kdetoys_4.6.5.orig.tar.bz2``, the packaging ``kdetoys_4.6.5-0ubuntu1.debian.tar.gz`` and the meta-data ``kdetoys_4.6.5-0ubuntu1~ppa1.dsc``. Assuming you have dpkg-dev installed it will extract these and give you the source package.
es: Esto descargará el fuente de aguas arriba «kdetoys_4.6.5.orig.tar.bz2», el empaquetado «kdetoys_4.6.5-0ubuntu1.debian.tar.gz» y los metadatos «kdetoys_4.6.5-0ubuntu1~ppa1.dsc». Suponiendo que tiene instalado dpkg-dev los extraerá y le proporcionará el paquete fuente.
uk: Вона завантажить джерельні коди з апстріму ``kdetoys_4.6.5.orig.tar.bz2``, набір вхідних файлів ``kdetoys_4.6.5-0ubuntu1.debian.tar.gz`` й метадані ``kdetoys_4.6.5-0ubuntu1~ppa1.dsc``. Якщо в Вас встановлено dpkg-dev, вона витягне їх вміст і надасть Вам пакунок джерельного коду.

source: Traditional packaging would edit these files and upload. However this gives limited opportunity to collaborate with other developers, changes have to be passed around as diff files with no central way to track them and two developers can not make changes at the same time. So most teams have moved to putting their packaging in a revision control system. This makes it easier for several developers to work on a package together. However there is no direct connection between the revision control system and the archive packages so the two must be manually kept in sync. Since each team works in its own revision control system a prospective developer must first work out where that is and how to get the packaging before they can work on the package.
es: En empaquetado tradicional editaría esos archivos y los subiría. Sin embargo, esto le limita las oportunidades de colaborar con otros desarrolladores, los cambios deben ser pasados como archivos diff sin que exista un lugar centralizado en el que rastrearlos y dos desarrolladores no pueden hacer cambios al mismo tiempo. Así que la mayoría de los equipos han puesto sus empaquetados en un sistema de control de versiones. Esto facilita mucho que varios desarrolladores puedan trabajar juntos en el mismo paquete. Sin embargo, no hay una conexión directa entre el sistema de control de versiones y el repositorio de paquetes, así que ambos deben mantenerse sincronizados manualmente. Puesto que cada equipo trabaja en su propio sistema de control de versiones un futuro desarrollador debe primero averiguar dónde se encuentra y cómo obtener el empaquetado antes de que pueda trabajar en el paquete.
uk: Традиційні методи створення пакунків відредагують та завантажать ці файли. Втім це дає обмежені можливості для співробітництва з іншими розробниками, зміни повинні передаватися через файли diff без центрального способу відстеження їх, на додаток два розробника не можуть вносити зміни одночасно. Тому більшість команд розробників перейшли від традиційного методу створення пакунків до системи контролю версій. Це дозволяє декільком розробникам працювати над пакунком разом. Втім немає прямого зв’язку між системою контролю версій й архівом пакунків, тому їх необхідно буде вручну синхронізувати. Оскільки кожна команда працює у власній системі контролю версій перспективний розробник повинен спочатку розібратися де, що й як отримати пакунок, перед тим як вони зможуть працювати з цим пакунком.

source: Ubuntu Distributed Development
es: Desarrollo distribuido de Ubuntu
uk: Розподілена розробка Ubuntu

source: With Ubuntu Distributed Development all packages in the Ubuntu (and Debian) archive are automatically imported into Bazaar branches on our code hosting site Launchpad. Changes can be made directly to these branches in incremental steps and by anyone with commit access. Changes can also be made in forked branches and merged back in with Merge Proposals when they are large enough to need review or if they are by someone without direct commit access.
es: Con el desarrollo distribuido de Ubuntu todos los paquetes del repositorio de Ubuntu (y de Debian) se importan automáticamente en ramas Bazaar en el sitio de hospedaje de código Launchpad. Los cambios se pueden hacer directamente en eses ramas en pasos incrementales y por cualquiera con permisos para confirmar. Los cambios también se pueden hacer en ramas bifurcadas y vueltas a fusionar con propuestas de integración («merge proposals») cuando son lo suficientemente grandes para necesitar una revisión o si están realizadas por alguien que no tiene permiso de confirmar directamente.
uk: З Ubuntu Distributed Development усі пакунки у архіві Ubuntu (і Debian) автоматично імпортуються у гілки Bazaar на нашому сайті хостингу коду Launchpad. Зміни можна вносити напряму у ці гілки кроками збільшення будь-яким користувачем, в якого є доступ. Зміни також можна вносити у роздвоєні гілки й з’єднувати їх назад за допомогою Пропозицій та Злиттів (Merge Proposals), коли вони стануть достатньо великими для розгляду, або якщо створені кимось без прямого доступу.

source: UDD branches are all in a standard location, so doing a checkout is easy::
es: Las ramas UDD están todas en una ubicación estándar, así que hacer una extracción es sencillo::
uk: UDD гілки усі знаходяться у стандартному місцезнаходженні, тому налагодження буде легким::

source: The merge history includes two separate branches, one for the upstream source and one which adds the ``debian/`` packaging directory::
es: El historial de fusiones incluye dos ramas separadas, una para el fuente de aguas arriba y otra que añade el directorio de empaquetado «debian/»::
uk: Історія об’єднань включає дві окремі гілки, одну для джерела апстріму й іншу, яка додасть директорію пакунку ``debian/``::

source: (This command uses *qbzr* for a GUI, run ``log`` instead of ``qlog`` for console output.)
es: (esta orden usa *qbzr* como IGU, ejecute «log» en lugar de «qlog» para una salida por consola).
uk: (Ця команда використовує у якості графічного інтерфейсу *qbzr*. Для виводу у консоль, запустіть ``log`` замість ``qlog``.)

source: This UDD branch of *kdetoys* shows the full packaging for each version uploaded to Ubuntu with grey circles and the upstream source versions with green circles. Versions are tagged with either the version in Ubuntu such as ``4:4.2.29-0ubuntu1`` or for the upstream branch with the upstream version ``upstream-4.2.96``.
es: Esta rama UDD de *kdetoys* muestra el empaquetado completo para cada versión subida a Ubuntu con círculos grises y las versiones fuentes de aguas arriba con círculos verdes. Las versiones se etiquetan o con la versión de Ubuntu como «4:4.2.29-0ubuntu1» o para las ramas de aguas arriba, con su versión, como «upstream-4.2.96».
uk: UDD гілка *kdetoys* позначає повний пакунок для кожної версії, завантаженій в Ubuntu сірими колами й версії джерела апстріму - зеленими. Версії позначаються або версіями Ubuntu (наприклад, ``4:4.2.29-0ubuntu1``) або для гілок апстріму - версією апстріму (``upstream-4.2.96``).
