Repository: canonical/ubuntu-packaging-guide
Catalog: po/*.po
Languages: es, uk

source: autopkgtest: Automatic testing for packages
es: autopkgtest: pruebas automáticas para paquetes
uk: autopkgtest: Автоматичне тестування пакунків

source: The `DEP 8 specification`_ defines how automatic testing can very easily be integrated into packages. To integrate a test into a package, all you need to do is:
es: `DEP 8 specification`_ define cómo se pueden integrar fácilmente pruebas automáticas en los paquetes. Para integrar una prueba en un paquete, todo lo que necesita hacer es:

source: add the following to the Source section in ``debian/control``::
es: añadir lo siguiente a la sección Source de ``debian/control``::
uk: додати наступний рядок до розділу Source в ``debian/control``::

source: add a file called ``debian/tests/control`` which specifies the requirements for the testbed,
es: añadir un archivo de nombre ``debian/tests/control`` que especifique los requisitos para el banco de pruebas,
uk: додати файл ``debian/tests/control``, який визначає вимоги до тестового оточення,

source: add the tests in ``debian/tests/``.
es: añadir las pruebas en ``debian/tests/``.
uk: додати тести в ``debian/tests``.

source: Testbed requirements
es: Requisitos del banco de pruebas
uk: Вимоги до тестового оточення

source: In ``debian/tests/control`` you specify what to expect from the testbed. So for example you list all the required packages for the tests, if the testbed gets broken during the build or if ``root`` permissions are required. The `DEP 8 specification`_ lists all available options.
es: En ``debian/tests/control`` se especifica lo que se espera del banco de pruebas. Así, por ejemplo, debe recoger todos los paquetes necesarios para las pruebas, si el banco de pruebas falla durante la compilación o si hacen falta permisos de ``root``.`DEP 8 specification`_ recoge todas las opciones disponibles.

source: Below we are having a look at the ``glib2.0`` source package. In a very simple case the file would look like this::
es: Más adelante vamos a ver el paquete fuente ``glib2.0``. En un caso muy simple el archivo podría tener la siguiente forma::
uk: Нижче ми розглянемо пакунок джерельного коду ``glib2.0``. У дуже простому випадку він буде виглядати так::

source: For the test in ``debian/tests/build`` this would ensure that the packages ``libglib2.0-dev`` and ``build-essential`` are installed.
es: Para la prueba de ``debian/tests/build`` esto se aseguraría que los paquetes ``libglib2.0-dev`` y ``build-essential`` están instalados.
uk: Це буде означати, що для тесту ``debian/tests/build`` потрібні пакунки ``libglib2.0-dev`` і ``build-essential``.

source: You can use ``@`` in the ``Depends`` line to indicate that you want all the packages installed which are built by the source package in question.
es: Puede usar ``@`` en la línea ``Depends`` para indicar que desea que estén instalados todos los paquetes que son compilados por el paquete fuente en cuestión.
uk: У полі ``Depends`` можна вказати ``@``, якщо Ви бажаєте встановлення усіх бінарних пакунків, зібраних з розглядуваного пакунку джерельного коду.

source: The actual tests
es: La prueba real
uk: Поточні тести

source: The accompanying test for the example above might be:
es: La prueba asociada al ejemplo anterior podría ser:
uk: Тест, що відповідає розглянутому вище прикладу, буде виглядати так:

source: Here a very simple piece of C code is written to a temporary directory. Then this is compiled with system libraries (using flags and library paths as provided by `pkg-config`). Then the compiled binary, which just exercises some parts of core glib functionality, is run.
es: Aquí una porción de código C muy simple se escribe en un directorio temporal. Luego es compilada con las bibliotecas del sistema (usando los marcadores y rutas de bibliotecas proporcionadas por `pkg-config`). Luego el binario compilado, que simplemente prueba algunas partes de la funcionalidad del núcleo de glib, se ejecuta.
uk: Тут невелика проґрама мовою C копіюється у тимчасову теку, потім компілюється з використанням системних бібліотек (з використанням прапорців та шляхів до бібліотек, визначених через ``pkg-config``). Потім запускається скомпільований файл, який запускає декілька основних функцій glib.

source: While this test is very small and basic, it tests quite a number of core components on a system. This may help to uncover critical issues early on.
es: Aunque esta prueba es muy pequeña y básica, prueba un buen número de componentes del sistema. Esto puede ayudar a descubrir de forma temprana incidencias críticas.

source: Executing the test
es: Ejecutando la prueba
uk: Виконання тесту

source: The test script can be easily executed on its own, but if you want to make sure that the testbed is properly set up, you might want to use ``adt-run`` from the ``autopkgtest`` package to execute the test. Simply run this command in the source tree::
es: El script de prueba se puede ejecutar fácilmente de forma independiente, pero si quiere asegurarse de que el banco de pruebas está correctamente configurado, deseará usar ``adt-run`` desde el paquete ``autopkgtest`` para ejecutar la prueba. Solo tiene que ejecutar la siguiente orden en el árbol fuente::

source: Further examples
es: Más ejemplos
uk: Подальші приклади

source: This list is not comprehensive, but might help you get a better idea of how automated tests are implemented and used in Ubuntu.
es: Esta lista no es completa, pero podría ayudarle a hacer una mejor idea de cómo están implementadas y cómo se usan las pruebas automatizadas en Ubuntu.
uk: Цей перелік не повний, але може допомогти Вам отримати уяву про те, як автоматичні тести реалізовані, й як вони використовуються в Ubuntu.

source: The `libxml2 tests`_ are very similar. They also run a test-build of a simple piece of C code and execute it.
es: `libxml2 tests`_ son muy parecidos. También realizan una generación de una prueba a partir de una porción de código C sencilla y la ejecutan.

source: The `gtk+3.0 tests`_ also do a compile/link/run check in the "build" test. There is an additional "python3-gi" test which verifies that the GTK library can also be used through introspection.
es: `gtk+3.0 tests`_ también realiza una comprobación de compilación/enlace/ejecución en la prueba «build». Hay una prueba adicional «python3-gi» que verifica que la biblioteca GTK es accesible también mediante introspección.

source: In the `ubiquity tests`_ the upstream test-suite is executed.
es: En `ubiquity tests`_ se ejecuta en conjunto de pruebas de aguas arriba.

source: The `gvfs tests`_ have comprehensive testing of their functionality and are very interesting because they emulate usage of CDs, Samba, DAV and other bits.
es: `gvfs tests`_ realiza pruebas exhaustivas de su funcionalidad y son muy interesantes porque emulan el uso de CDs, Samba, DAV y otras cosas.

source: Ubuntu infrastructure
es: Infraestructura de Ubuntu
uk: Інфраструктура Ubuntu

source: Packages which have ``autopkgtest`` enabled will have their tests run whenever they get uploaded or any of their reverse-dependencies change. The output of `automatically run autopkgtest tests`_ can be viewed on the web and is regularly updated.
es: Los paquetes que tienen activado ``autopkgtest`` ejecutarán sus pruebas siempre que se suban o cambie alguna de sus dependencias inversas. La salida de `automatically run autopkgtest tests`_ se puede ver en la web y se actualiza de forma regular.

source: While Debian does not have an automatic testing infrastructure set up yet, they should still be submitted to Debian, as DEP-8 is a Debian specification and Debian developers or users can still manually run the tests.
es: Aunque Debian no tiene todavía una infraestructura de pruebas automáticas, se deberían enviar igualmente a Debian, ya que DEP-8 es una especificación de Debian y sus desarrolladores o usuarios pueden ejecutar las pruebas manualmente.

source: Packages in Debian with a testsuite header will also be automatically added when they are synced to Ubuntu.
es: Los paquetes en Debian con una cabecera de conjunto de pruebas también serán añadidos automáticamente cuando se sincronicen con Ubuntu.

source: Getting the test into Ubuntu
es: Llevando la prueba a Ubuntu
uk: Додавання тесту в Ubuntu

source: The process of submitting an autopkgtest for a package is largely similar to :doc:`fixing a bug in Ubuntu<./fixing-a-bug>`. Essentially you simply:
es: El proceso de enviar un autopkgtest para un paquete es muy parecido a :doc:`fixing a bug in Ubuntu<./fixing-a-bug>`. En esencia debe simplemente:
uk: Процес додавання й відправлення autopkgtest-тесту для пакунків дуже схожий на :doc:`процес виправлення помилок в Ubuntu<./fixing-a-bug>`. Вистачить лише:

source: run ``bzr branch ubuntu:<packagename>``,
es: ejecutar ``bzr branch ubuntu:<packagename>``,
uk: виконайте ``bzr branch ubuntu:<ім’я_пакунку>``,

source: edit ``debian/control`` to enable the tests,
es: editar el archivo ``debian/control`` para activar las pruebas,
uk: увімкніть тести в ``debian/control``,

source: add the ``debian/tests`` directory,
es: añadir el directorio ``debian/tests``.
uk: створіть директорію ``debian/tests``,

source: write the ``debian/tests/control`` based on the `DEP 8 Specification`_,
es: escribir el ``debian/tests/control`` basado en`DEP 8 Specification`_,

source: add your test case(s) to ``debian/tests``,
es: añadir sus casos de prueba a ``debian/tests``,
uk: додайте Ваші тести в ``debian/tests``,

source: commit your changes, push them to Launchpad, propose a merge and get it reviewed just like any other improvement in a source package.
es: confirmar los cambios, empujarlos a Launchpad, proponer una integración y hacer que la revisen igual que cualquier otra mejora de un paquete fuente.
uk: закомте Ваші зміни, відправте їх на Launchpad, запропонуйте merge й дочекайтеся його розгляду, -- у точності як з будь-якими іншими покращеннями у джерельних пакунках.

source: Backporting software updates
es: Adaptar actualizaciones de software a versiones anteriores
uk: Бекпортування оновлень проґрам

source: Sometimes you might want to make new functionality available in a stable release which is not connected to a critical bug fix. For these scenarios you have two options: either you `upload to a PPA <https://help.launchpad.net/Packaging/PPA>`_ or prepare a backport.
es: En ocasiones podría desear hacer disponible una nueva funcionalidad de una emisión estable que no está relacionada con la corrección de un error crítico. Para estos escenarios existen dos opciones: o bien `upload to a PPA <https://help.launchpad.net/Packaging/PPA>`_ o bien prepara una adaptación a la versión antigua.

source: Personal Package Archive (PPA)
es: Archivo de paquetes personal («Personal Package Archive», PPA)
uk: Персональні архіви пакунків (PPA)

source: Using a PPA has a number of benefits. It is fairly straight-forward, you don't need approval of anyone, but the downside of it is that your users will have to manually enable it. It is a non-standard software source.
es: Usar un PPA tiene una serie de ventajas. Es bastante directo, no necesita la aprobación de nadie, pero la desventaja es que sus usuarios tendrán que activarlo manualmente. Es un origen de software no estándar.
uk: Використання PPA має ряд переваг. Це достатньо просто, Вам не знадобиться схвалення від кого б то не було, але недолік у тому, що користувачам доведеться вручну під’єднувати PPA. Це нестандартне джерело застосунків.

source: The `PPA documentation on Launchpad`_ is fairly comprehensive and should get you up and running in no time.
es: `PPA documentation on Launchpad`_ es bastante completo y debería tenerlo funcionando en poco tiempo.

source: Official Ubuntu Backports
es: Adaptaciones oficiales a versiones anteriores de Ubuntu
uk: Офіційні бекпорти Ubuntu

source: The Backports Project is a means to provide new features to users. Because of the inherent stability risks in backporting packages, users do not get backported packages without some explicit action on their part. This generally makes backports an inappropriate avenue for fixing bugs. If a package in an Ubuntu release has a bug, it should be fixed either through the :doc:`Security Update or the Stable Release Update process<./security-and-stable-release-updates>`, as appropriate.
es: El proyecto Backports (adaptaciones a versiones antiguas) es un medio de proporcionar nuevas funcionalidades a los usuarios. Debido al riesgo inherente de afectar a la estabilidad al adaptar los paquetes a versiones antiguas, los usuarios no obtienen estos paquetes sin algún tipo de acción explícita por su parte. Esto generalmente convierte a las adaptaciones en camino poco adecuado para corregir errores. Si un paquete en una emisión de Ubuntu tiene un error, debería ser corregido mediante los procesos descritos en :doc:`Security Update or the Stable Release Update process<./security-and-stable-release-updates>`, según sea corresponda.
uk: Метою проєкту Backports є надання користувачам нової функційності. З-за ризиків зменшення стабільності при портуванні новинок, бекпорти недоступні користувачам, поки вони не задіють їх. Тому бекпорти не є місцем для виправлення помилок. Якщо у пакунку Ubuntu виявлена помилка, вона повинна бути виправлена через :doc:`оновлення безпеки та стабільності<./security-and-stable-release-updates>`.

source: Once you determined you want a package to be backported to a stable release, you will need to test-build and test it on the given stable release. ``pbuilder-dist`` (in the ``ubuntu-dev-tools`` package) is a very handy tool to do this easily.
es: Una vez haya determinado que quiere adaptar un paquete a una versión estable, necesitará hacer una compilación de prueba y probarla sobre dicha versión estable. ``pbuilder-dist`` (del paquete ``ubuntu-dev-tools``) es una herramienta muy práctica para hacerlo fácilmente.
uk: Коли Ви визначите, чи потрібно Вам адаптувати Ваші зміни для стабільного релізу, Вам буде необхідно зібрати та протестувати Ваш пакунок на даному релізі. Команда ``pbuilder-dist`` (з пакунку ``ubuntu-dev-tools``) допоможе Вам зробити це.

source: To report the backport request and get it processed by the Backporters team, you can use the ``requestbackport`` tool (also in the ``ubuntu-dev-tools`` package). It will determine the intermediate releases that package needs to be backported to, list all reverse-dependencies, and file the backporting request. Also will it include a testing checklist in the bug.
es: Para reportar una petición de adaptación y hacer que el equipo de Backporters la procese, puede usar la herramienta ``requestbackport`` (también del paquete ``ubuntu-dev-tools``). Esta herramienta determinará las emisiones intermedias a las que el paquete necesita ser adaptado, listará todas las dependencias inversas y rellenará la petición de adaptación. También incluirá una lista de comprobación en el error.
uk: Щоб подати заявку на бекпорт, можна використовувати засіб ``requestbackport`` (також з пакунку ``ubuntu-dev-tools``). Він визначить усі проміжні випуски, для яких пакунок також доведеться бекпортувати, покаже, які пакунки залежать від даного, й створить заявку. Він також включить перелік потрібних тестів у заявку.

source: Using Chroots
es: Usar chroots
uk: Використання chroot-оточень

source: If you are running one version of Ubuntu but working on packages for another versions you can create the environment of the other version with a ``chroot``.
es: Si ejecuta una versión de Ubuntu pero trabaja en paquetes de otra versión, puede crear un ambiente para esa otra versión con un «chroot».
uk: Якщо Ви користуєтеся однією з версій Ubuntu, але працюєте над пакунками для іншої версії, Ви можете створити середовище іншої версії за допомогою ``chroot``.

source: A ``chroot`` allows you to have a full filesystem from another distribution which you can work in quite normally. It avoids the overhead of running a full virtual machine.
es: Un «chroot» le permite tener un sistema de archivos completo de otra distribución el cual puede funcionar normalmente. Esto evita la sobrecarga de ejecutar una maquina virtual completa.
uk: Використання ``chroot`` дозволить Вам мати у розпорядженні повну файлову систему іншого дистрибутиву для зручності роботи. Це дозволяє уникнути затрат, пов’язаних з встановленням віртуальної машини.

source: Creating a Chroot
es: Crear un chroot
uk: Створення chroot

source: Use the command ``debootstrap`` to create a new chroot::
es: Use la orden «debootstrap» para crear un nuevo chroot::
uk: Використовуйте команду ``debootstrap``, щоб створити новий chroot::

source: This will create a directory ``oneiric`` and install a minimal oneiric system into it.
es: Esto creará el directorio «oneiric» e instalará un sistema mínimo en él.

source: If your version of ``debootstrap`` does not know about oneiric you can try upgrading to the version in ``backports``.
es: Si su versión de «debootstrap» no reconoce oneiric puede intentar la actualización a la versión en «backports».

source: You can then work inside the chroot::
es: Puede trabajar dentro del chroot::
uk: Після цього Ви можете працювати всередині chroot::

source: Where you can install or remove any package you wish without affecting your main system.
es: Dónde puede instalar o eliminar cualquier paquete que desee sin afectar a su sistema principal.
uk: Де можна встановити або вилучити будь-який пакунок, який Ви бажаєте, без шкоди для основної системи.

source: You might want to copy your GPG/ssh keys and Bazaar configuration into the chroot so you can access and sign packages directly::
es: Quizás quiera copiar sus claves GPG/ssh y su configuración de Bazaar dentro del chroot de manera que pueda acceder y firmar paquetes directamente::
uk: Ви можете скопіювати свої ключі GPG і SSH, а також конфігурацію Bazaar в chroot, щоб отримувати доступ й підписувати пакунки безпосередньо звідти::

source: To stop apt and other programs complaining about missing locales you can install your relevant language pack::
es: Para detener apt y otros programas que se quejan por la perdida de locales, puede instalar el paquete de idioma correspondiente::
uk: Щоб apt й інші проґрами не скаржилися на відсутні локалі, можна встановити відповідний мовний пакунок::

source: If you want to run X programs you will need to bind the /tmp directory into the chroot, from outside the chroot run::
es: Si quiere correr programas X necesita enlazar el directorio /tmp dentro del chroot, desde fuera del chroot ejecute::
uk: Якщо Вам потрібно запускати проґрами, що використовують X-сервер, Вам потрібно додати в chroot директорію /tmp, для цього ззовні chroot запустіть::

source: Some programs may need you to bind /dev or /proc.
es: Algunos programas pueden necesitar vincularse a /dev o /proc.
uk: Для деяких проґрам, можливо, знадобиться прив’язати /dev або /proc.

source: For more information on chroots see our `Debootstrap Chroot wiki page`_.
es: Para más información sobre chroot revise la página de wiki `Debootstrap Chroot wiki page`_.

source: Alternatives
es: Alternativas
uk: Альтернативи

source: SBuild is a system similar to PBuilder for creating an environment to run test package builds in. It closer matches that used by Launchpad for building packages but takes some more setup compared to PBuilder. See `the Security Team Build Environment wiki page`_ for a full explanation.
es: Sbuild es un sistema similar a Pbuilder para crear entornos donde pueda ejecutar pruebas de construcción de paquetes. Es más parecido al utilizado por Launchpad para construir paquetes pero lleva más tiempo configurarlo comparado con Pbuilder. Veasé `the Security Team Build Environment wiki page`_ para obtener una explicación más detallada.

source: Full virtual machines can be useful for packaging and testing programs. TestDrive is a program to automate syncing and running daily ISO images, see `the TestDrive wiki page`_ for more information.
es: La virtualización completa de máquinas puede ser útil para el empaquetado y prueba de programas. TestDrive es un programa para automatizar la sincronización y ejecución de imágenes ISO, revise la página wiki de TestDrive para más información.

source: You can also set up pbuilder to pause when it comes across a build failure. Copy C10shell from /usr/share/doc/pbuilder/examples into a directory and use the ``--hookdir=`` argument to point to it.
es: Puede configurar pbuilder para hacer una pausa cuando encuentre un error en la construcción. Copie C10shell desde /usr/share/doc/pbuilder/examples en un directorio y use el parámetro ``--hookdir=`` para apuntar a él.
uk: Можна також налаштувати pbuilder так, щоб він призупинявся при виявленні помилки збірки. Скопіюйте C10shell з /usr/share/doc/pbuilder/examples у каталог й використовуйте аргумент ``--hookdir=``, щоб вказати на нього.

source: Amazon's `EC2 cloud computers`_ allow you to hire a computer paying a few US cents per hour, you can set up Ubuntu machines of any supported version and package on those. This is useful when you want to compile many packages at the same time or to overcome bandwidth restraints.
es: `EC2 cloud computers`_ de Amazon le permite contratar a un equipo pagando unos pocos centavos de dólar por hora, puede configurar máquinas Ubuntu de cualquier versión compatible y empaquetar en ellas. Esto es útil cuando se desea compilar varios paquetes al mismo tiempo o para superar las limitaciones de ancho de banda.

source: Communication in Ubuntu Development
es: Comunicación en el desarrollo de Ubuntu
uk: Комунікація при Розробці в Ubuntu

source: In a project where thousands of lines of code are changed, lots of decisions are made and hundreds of people interact every day, it is important to communicate effectively.
es: En un proyecto donde se modifican miles de líneas de código, se toman muchas decisiones y miles de personas interactúan a diario, es importante comunicarse efizcamente.
uk: В проєкті, де піддаються змінам тисячі рядків коду, приймається багато рішень, й де сотні людей повинні взаємодіяти кожен день, важливо мати ефективний зв’язок.

source: Mailing lists
es: Listas de correo
uk: Поштові розсилки

source: Mailing lists are a very important tool if you want to communicate ideas to a broader team and make sure that you reach everybody, even across timezones.
es: Las listas de correo son una herramienta importante si quiere comunicar ideas a un equipo más grande y asegurarse de llegar a todos, incluso en distintas zonas horarias.
uk: Поштові розсилки— це достатньо ефективний інструмент, якщо Ви бажаєте обміркувати ідеї в команді та переконатися що Ви сповістили усіх, не дивлячись на відмінності у часових поясах.

source: In terms of development, these are the most important ones:
es: En términos de desarrollo, estos son los más importantes:
uk: З точки зору розробки, це найважиливіші з розсилок:

source: https://lists.ubuntu.com/mailman/listinfo/ubuntu-devel-announce (announce-only, the most important development announcements go here)
es: https://lists.ubuntu.com/mailman/listinfo/ubuntu-devel-announce (Solo anuncios, los anuncios más importantes sobre desarrollo van aquí)
uk: https://lists.ubuntu.com/mailman/listinfo/ubuntu-devel-announce (лише анонси, найважливіші об’яви розробки потрапляють сюди)

source: https://lists.ubuntu.com/mailman/listinfo/ubuntu-devel (general Ubuntu development discussion)
es: https://lists.ubuntu.com/mailman/listinfo/ubuntu-devel (discusión general de desarrollo de Ubuntu)
uk: https://lists.ubuntu.com/mailman/listinfo/ubuntu-devel (головна дискусія розробників Ubuntu )
