Repository: canonical/ubuntu-packaging-guide
Catalog: po/*.po
Languages: es, uk

source: C++ has even more exacting standards of binary compatibility than C. The Debian Qt/KDE Team maintain some scripts to handle this, see their `Working with symbols files <SymbolsFiles_>`_ page for how to use them.
uk: В мови C++ більш суворі стандарти на двійкову сумісність, ніж у C. Команда Debian Qt/KDE підтримує деякі скрипти, які допоможуть подолати це: сторінка `Робота з файлами symbols <SymbolsFiles_>`_ дає опис принципів їх використання.

source: Junichi Uekawa's `Debian Library Packaging Guide <LibraryGuide_>`_ goes into this topic in more detail.
uk: Стаття Junichi Uekawa `Пакункування бібліотек для Debian <LibraryGuide_>`_ розглядає це питання детальніше.

source: This guide will take you through packaging a simple application called GNU Hello which has been posted on GNU.org_.
uk: Цей посібник проведе Вас через процес створення пакунку для невеликого застосунку GNU Hello, доступного на GNU.org_.

source: In ``debian/changelog`` change the version number to an Ubuntu version: ``2.7-0ubuntu1`` (upstream version 2.7, Debian version 0, Ubuntu version 1). Also change ``unstable`` to the current development Ubuntu release such as ``trusty``.
uk: В ``debian/changelog`` змініть номер версії на версію Ubuntu: ``2.7-0ubuntu1`` (апстрім-версія 2.7, версія в Debian 0, версія в Ubuntu 1). Також змініть ``unstable`` на поточний розроблюваний випуск Ubuntu, наприклад, ``trusty``.

source: Much of the package building work is done by a series of scripts called ``debhelper``. The exact behaviour of ``debhelper`` changes with new major versions, the compat file instructs ``debhelper`` which version to act as. You will generally want to set this to the most recent version which is ``9``.
uk: Велика частина процесу компілювання пакунку здійснюється скриптами з ``debhelper``. Оскільки поведінка ``debhelper`` змінюється при виході старшої версії, файл compat повідомляє ``debhelper`` яку саме версію використовувати. Має сенс використовувати найсвіжішу версію: ``9``.

source: Install the package and check it works (later you will be able to uninstall it using ``sudo apt-get remove hello`` if you want)::
uk: Встановіть пакунок й перевірте, що він працює (пізніше за бажання Ви зможете вилучити його командою ``sudo apt-get remove hello``)::

source: You can also install all packages at once using::
uk: Можете також встановити усі пакунки одразу за допомогою::

source: Even if it builds the .deb binary package, your packaging may have bugs. Many errors can be automatically detected by our tool ``lintian`` which can be run on the source .dsc metadata file, .deb binary packages or .changes file::
uk: Навіть якщо двійковий .deb-пакунок успішно збирається, Ваші джерельні файли для пакунку можуть містити помилки. Багато помилок можуть автоматично виявлятися нашим інструментом ``lintian``, який можна застосувати до файлу метаданих .dsc, двійкових пакунків .deb або файлу .changes::

source: To see verbose description of the problems use ``--info`` lintian flag or ``lintian-info`` command.
uk: Щоб побачити детальний опис вад, використовуйте прапорець lintian ``--info`` або команду ``lintian-info``.

source: Results of Ubuntu archive checks can be found online on http://lintian.ubuntuwire.org.
uk: Результати перевірок архіву Ubuntu можна знайти у Інтернеті на http://lintian.ubuntuwire.org.

source: For Python packages, there is also a ``lintian4python`` tool that provides some additional lintian checks.
uk: Для пакунків Python є також інструмент ``lintian4python``, здійснюючий деякі додаткові перевірки lintian.

source: Uploading it to a PPA will ensure it builds and give an easy way for you and others to test the binary packages. You will need to set up a PPA in Launchpad and then upload with ``dput``::
uk: Вивантаження в PPA дозволить переконатися, що пакунок збирається нормально, а також дозволить Вам і решті тестувати бінарні пакунки. Вам знадобиться створити PPA на Launchpad, після чого вивантажити пакунок за допомогою ``dput``::

source: You can ask for reviews in ``#ubuntu-motu`` IRC channel, or on the `MOTU mailing list <ubuntu-motu_>`_. There might also be a more specific team you could ask such as the GNU team for more specific questions.
uk: Попрохати провести review можна на каналі IRC ``#ubuntu-motu``, або у `переліку розсилки MOTU <ubuntu-motu_>`_. У деяких випадках може знадобитися участь конкретної команди: у подібних випадках команда GNU допоможе розібратися.

source: `Debian Mentors FAQ <MentorsFAQ_>`_ - debian-mentors is for the mentoring of new and prospective Debian Developers. It is where you can find a sponsor to upload your package to the archive.
uk: `Debian Mentors FAQ <MentorsFAQ_>`_ - debian-mentors створений для менторства нових і перспективних розробників Debian. Це те місце, де можна знайти спонсора для завантаження Вашого пакунку в архів.

source: `Work-Needing and Prospective Packages <WNPP_>`_ - Information on how to file "Intent to Package" and "Request for Package" bugs as well as list of open ITPs and RFPs.
uk: `Work-Needing and Prospective Packages <WNPP_>`_ - інформація про те як відправляти баги "Intent to Package" (Призначення пакунку) і "Request for Package" (Запит пакунку), а також переліки відкритих ITP та RFP.

source: `Debian Developer's Reference, 5.1. New packages <DevRef_>`_ - The entire document is invaluable for both Ubuntu and Debian packagers. This section documents processes for submitting new packages.
uk: `Посібник Розробника Debian, 5.1. Створення пакунків <DevRef_>`_ - безцінний документ для творців пакунків як під Ubuntu, так й під Debian. Даний розділ дає опис процесу відправки нових пакунків.

source: In some cases, it might make sense to go directly into Ubuntu first. For instance, Debian might be in a freeze making it unlikely that your package will make it into Ubuntu in time for the next release. This process is documented on the `"New Packages" <NewPackages_>`_ section of the Ubuntu wiki.
uk: У деяких випадках має сенс відправлятися прямо в Ubuntu. Наприклад, якщо Debian знаходиться у стані "freeze": тоді Ваш пакунок навряд встигне увійти в Ubuntu до найближчого релізу. Опис цього процесу на сторінці `"Нові Пакунки" <NewPackages_>`_ Ubuntu Wiki.

source: Screenshots
uk: Знятки екрану

source: Once you have uploaded a package to debian, you should add screenshots to allow propective users to see what the program is like. These should be uploaded to http://screenshots.debian.net/upload .
uk: Завантаживши пакунок в Debian, Вам слід додати знятки екрану, аби майбутні користувачі змогли отримати уяву про те, як виглядає інтерфейс проґрами. Знятки потрібно відправляти на http://screenshots.debian.net/upload .

source: There are a number of different ways of handling patches in Debian packages, fortunately we are standardizing on one system, `Quilt`_, which is now used by most packages.
uk: Існують різні способи роботи з латками для пакунків Debian. На щастя, ми зупинимося на одній системі, `Quilt`_, яка наразі використовується більшістю пакунків.

source: Let's look at an example package, ``kamoso`` in Trusty::
uk: Давайте візьмемо у якості прикладу пакунок ``kamoso`` в Trusty::

source: Patch Headers
uk: Заголовки латок

source: We recommend that you tag every patch with DEP-3_ headers by putting them at the top of patch file. Here are some headers that you can use:
uk: Ми рекомендуємо додавати до кожної латки заголовки DEP-3_, поміщаючи їх у самому верху файлу латки. Ось деякі заголовки, які можна використовувати:

source: Description of what the patch does. It is formatted like ``Description`` field in ``debian/control``: first line is short description, starting with lowercase letter, the next lines are long description, indented with a space.
uk: Опис того, що робить латка. Має формат, аналогічний полю ``Description`` в ``debian/control``: перший рядок містить короткий опис, що починається з рядкової літери, решта рядків містять довший опис з пробілом у якості відступу.

source: Who wrote the patch (i.e. "Jane Doe <packager@example.com>").
uk: Хто написав латку (наприклад, "Jane Doe <packager@example.com>").

source: Where this patch comes from (i.e. "upstream"), when *Author* is not present.
uk: Звідки прийшла ця латка (наприклад, "upstream"), якщо заголовок *Author* відсутній.

source: A link to Launchpad bug, a short form is preferred (like *https://bugs.launchpad.net/bugs/XXXXXXX*). If there are also bugs in upstream or Debian bugtrackers, add *Bug* or *Bug-Debian* headers.
uk: Посилання на інформацію про помилку на Launchpad, бажано, у короткій формі (типу *https://bugs.launchpad.net/bugs/XXXXXXX*). Якщо також є звіти про вади в апстрімі або системах відстежування помилок Debian, додайте заголовки *Bug* або *Bug-Debian*.

source: Whether the patch was forwarded upstream. Either "yes", "no" or "not-needed".
uk: Чи була латка передана в апстрим. Значення: "yes", "no" або "not-needed".

source: Date of the last revision (in form "YYYY-MM-DD").
uk: Дата останньої ревізії (у формі "ГГГГ-ММ-ДД").

source: To upgrade to the new version, you can use ``bzr merge-upstream`` command::
uk: Щоб виконати оновлення до останньої версії, Ви можете використовувати команду ``bzr merge-upstream``::

source: When you run this command, all patches will be unapplied, because they can become out of date. They might need to be refreshed to match the new upstream source or they might need to be removed altogether. To check for problems, apply the patches one at a time::
uk: При запуску цієї команди відбудеться відткат усіх латок, оскільки вони можуть стати застарілими. Можливо знадобиться їх оновити для відповідності новому джерелу апстріму, або знадобиться вилучити їх усі разом. Для полегшення перевірки проблем застосовуйте латки по одній.

source: Configuring Quilt
uk: Конфігурування Quilt

source: You can use ``~/.quiltrc`` file to configure quilt. Here are some options that can be useful for using quilt with debian/packages:
uk: Ви можете скористатися файлом ``~/.quiltrc`` для конфігурування quilt. Ось декілька опцій, які можуть бути корисні при використанні quilt з пакунками Debian:

source: Other patch systems used by packages include ``dpatch`` and ``cdbs simple-patchsys``, these work similarly to Quilt by keeping patches in ``debian/patches`` but have different commands to apply, un-apply or create patches. You can find out which patch system is used by a package by using the ``what-patch`` command (from the ``ubuntu-dev-tools`` package). You can use ``edit-patch``, shown in :ref:`previous chapters <working-on-a-fix>`, as a reliable way to work with all systems.
uk: Інші системи латання, що використовуються у пакунках, включають ``dpatch`` і ``cdbs simple-patchsys``, принцип роботи яких схожий на Quilt - латки зберігаються в ``debian/patches``, але для їх застосування, скасування або створення потрібні інші команди. Ви можете дізнатися яка система латання використовується у пакунку за допомогою команди ``what-patch``(у пакунку ``ubuntu-dev-tools``). Ви можете використовувати ``edit-patch``, показаний в :ref:`попередніх розділах <working-on-a-fix>`, у якості надійного способу для роботи з усіма системами.

source: Fixing security bugs in Ubuntu is not really any different than :doc:`fixing a regular bug in Ubuntu<./fixing-a-bug>`, and it is assumed that you are familiar with patching normal bugs. To demonstrate where things are different, we will be updating the dbus package in Ubuntu 12.04 LTS (Precise Pangolin) for a security update.
uk: Виправлення дірок у безпеці в Ubuntu фактично не відрізняється від :doc:`виправлення звичайного багу<./fixing-a-bug>`, і припускається, що Ви знайомі з виправленням звичайних багів. Для демонстрації відмінностей ми будемо додавати у пакунок dbus в Ubuntu 12.04 LTS (Precise Pangolin) оновлення для системи безпеки.

source: In this example, we already know we want to fix the dbus package in Ubuntu 12.04 LTS (Precise Pangolin). So first you need to determine the version of the package you want to download. We can use the ``rmadison`` to help with this::
uk: У даному прикладі ми вже знаємо, що бажаємо виправити пакунок dbus в Ubuntu 12.04 LTS (Precise Pangolin). Тому спочатку потрібно визначити версію пакунку, який бажаєте стягнути. Ми можемо використовувати ``rmadison`` у якості допомоги у даній ситуації.

source: Typically you will want to choose the highest version for the release you want to patch that is not in -proposed or -backports. Since we are updating Precise's dbus, you'll download 1.4.18-1ubuntu1.4 from precise-updates::
uk: Зазвичай обирають найостаннішу версію для релізу, який Ви бажаєте залатати, який не в -proposed або -backports. Оскільки ми оновлюємо dbus Precise, Ви стягнете 1.4.18-1ubuntu1.4 з precise-updates::

source: After applying your patches you will want to update the changelog. The ``dch`` command is used to edit the ``debian/changelog`` file and ``edit-patch`` will launch ``dch`` automatically after un-applying all the patches. If you are not using ``edit-patch``, you can launch ``dch -i`` manually. Unlike with regular patches, you should use the following format (note the distribution name uses precise-security since this is a security update for Precise) for security updates::
uk: Після застосування латок Вам знадобиться внести зміни в лог. Команда ``dch`` використовується для редагування файлу ``debian/changelog`` і ``edit-patch`` автоматично запустить ``dch`` після відкату усіх латок. Якщо Ви не користуєтеся ``edit-patch``, то можете запустити ``dch -i`` вручну. На відміну від звичайних латок, Вам слід використовувати наступний формат (зверніть увагу, що в імені дитрибутиву використовується precise-security, оскільки це оновлення безпеки для Precise) для оновлень безпеки::

source: The bug report should also confirm that the issue is fixed in Ubuntu versions newer than the one with the proposed fix (in the above example newer than Precise). If the issue is not fixed in newer Ubuntu versions you should prepare updates for those versions too.
uk: Звіт про баг також повинен підтверджувати, що вада виправлена у нових версіях Ubuntu за допомогою запропонованого фіксу (у вищевказаному прикладі вище ніж в Precise). Якщо проблема не виправлена у нових версіях Ubuntu, Ви повинні підготувати оновлення й для нових версій.

source: The update will go into the ``proposed`` archive (for example ``precise-proposed``) where it will need to be checked that it fixes the problem and does not introduce new problems. After a week without reported problems it can be moved to ``updates``.
uk: Оновлення потрапить в архів ``proposed``(наприклад ``precise-proposed``), де його перевіряють на здатність виправити проблему й підтверджують, що воно не є наслідком нових проблем. Після тижню роботи без заявлених проблем, оновлення потрапляє у розділ ``updates``.

source: See the `Stable Release Updates wiki page <SRUWiki_>`_ for more information.
uk: Дивіться 'Вікі сторінку Оновлень Стабільного Релізу <SRUWiki_>`_ для отримання додаткової інформації.

source: to pull the source from the ``trusty`` release, or::
uk: щоб витягнути джерело з релізу ``trusty``, або::

source: We also must adhere to the `Debian Maintainer Field Spec <MaintFieldSpec_>`_ and edit ``debian/control`` to replace::
uk: Ми також повинні дотримуватися `Специфікацій Обслуговування Debian<MaintFieldSpec_>`_ й редагувати ``debian/control`` для заміни::

source: Then in a terminal, change to the directory where the source was uncompressed::
uk: Потім у терміналі змініть на директорію, куди був розпакований джерельний код::

source: To refer to the version of a source package in an older release of Ubuntu, just prefix the package name with the release's code name. E.g. to refer to Tomboy's source package in Saucy_ use::
uk: Щоб зробити відсилку до версії джерельного пакунку у старішому релізі Ubuntu просто додайте пакунку префікс з кодовим іменем релізу. Наприклад, для відсилки до джерельного пакунку Tomboy в Saucy_ використовуйте::

source: and to access Tomboy in Debian Wheezy_ use::
uk: також для доступу до Tomboy в Debian Wheezy_ використовуйте::

source: means the importer has failed. You can find out why on http://package-import.ubuntu.com/status/ and `file a bug on the UDD project <UDD_>`_ to get the issue resolved.
uk: означає, що імпорт не вдався. Ви можете дізнатися про причину за посиланням: http://package-import.ubuntu.com/status/ й `відправити баг в UDD <UDD_>`_ для вирішення проблеми.

source: The `builddeb` plugin has several `configuration options <ConfOptions_>`_.
uk: У втулки `builddeb` є декілька `опцій конфігурації <ConfOptions_>`_.

source: When you want to do something like a `stable release update <SRU_>`_ (SRU), or you just want to examine the code in an old release, you'll want to grab the branch corresponding to a particular Ubuntu release. For example, to get the Tomboy package for Quantal do::
uk: Якщо Ви бажаєте зробити щось типу `оновлення стабільного релізу <SRU_>`_ (SRU), або просто бажаєте вивчити код у старому релізі, Вам потрібно вибрати гілку, що відповідає певному релізу Ubuntu. Наприклад, щоб отримати пакунок Tomboy для Quantal::

source: To do packaging with UDD you will need to know the basics of how to use Bazaar to manage files. For an introduction to Bazaar see the `Bazaar Five Minute Tutorial <5MinTutorial_>`_ and the `Bazaar Users Guide <UsersGuide_>`_.
uk: Щоб зробити пакунок з UDD Вам потрібно знати основи використання Bazaar для керування файлами. Для отримання базових навичок роботи з Bazaar дивіться `П’ятихвилинне навчання Bazaar <5MinTutorial_>`_ й `Посібник з використання Bazaar <UsersGuide_>`_.

source: Some packages have not been successfully imported into UDD branches. Recent versions of Bazaar will automatically notify you when this is the case. You can also check the `status of the package importer <ImportStatus_>`_ manually before working on a branch.
uk: Деякі пакунки не були успішно імпортовані у гілки UDD. Останні версії Bazaar автоматично будуть сповіщати Вас у випадку виникнення подібної ситуації. Перед початком роботи з гілкою Ви можете вручну поставити позначку `status of the package importer <ImportStatus_>`_.

source: This works wherever you have a checkout of a branch, so it will work for things like branches of `saucy`, `trusty-proposed`, etc.
uk: Це працює якщо в Вас є налагодження гілки, тому його можна застосувати для таких речей як гілки `saucy`, `trusty-proposed`, тощо.

source: Next run ``bzr merge`` passing the URL of the branch to merge from. For example, to merge from the version of the package in Debian Unstable run [#]_::
uk: Потім запустіть ``bzr merge``, передаючи URL гілки для злиття. Наприклад, щоб виконати злиття версій пакунку в Debian Unstable запустіть [#]_::

source: To check other available branches of a package in Debian, see package code page. E.g. https://code.launchpad.net/debian/+source/tomboy
uk: Щоб перевірити наявність інших гілок пакунку в Debian, див. сторінку коду пакунку. Наприклад: https://code.launchpad.net/debian/+source/tomboy

source: For example, to push your fix for bug 12345 in the Tomboy package for Trusty, you'd use::
uk: Наприклад, щоб просунути свій фікс для багу 12345 у пакунку Tomboy для Trusty, використовуйте:

source: Once your merge proposal is reviewed and approved, you will want to upload your package, either to the archive (if you have permission) or to your `Personal Package Archive <PPA_>`_ (PPA). You might also want to do an upload if you are sponsoring someone else's changes.
uk: Як тільки Ваша пропозиція про злиття розглянута й підтверджена, Ви забажаєте завантажити свій пакунок або у архів (якщо в Вас є права), або у свій Персональний Архів Пакунків `Personal Package Archive <PPA_>`_ (PPA). Також можливо Ви забажаєте виконати завантаження, якщо спонсоруєте зміни, внесені іншим користувачем.

source: translator-credits
uk: Launchpad Contributions: Микола Ткач https://launchpad.net/~stuartlittle1970
