Repository: canonical/ubuntu-packaging-guide
Catalog: po/*.po
Languages: es, uk

source: Run ``setup.py build_sphinx`` in ``override_dh_auto_build`` (sometimes not needed);
es: Ejecutar ``setup.py build_sphinx`` en ``override_dh_auto_build`` (en ocasiones no es necesario);

source: Add ``{sphinxdoc:Depends}`` to the dependency list of your ``-doc`` package;
es: Añadir ``{sphinxdoc:Depends}`` a la lista de dependencias de su paquete ``-doc``;

source: Add the path of the built docs directory (usually ``build/sphinx/html``) to your ``.docs`` file.
es: Añadir la ruta del directorio de generación de documentación (normalmente ``build/sphinx/html``) a su archivo ``.docs``.

source: In our case, the docs are automatically built in ``build/docs/`` directory when we run ``setup.py build``, so we can simply put this in the ``python-markdown-doc.docs`` file::
es: En nuestro caso, los documentos se compilan automáticamente en el directorio ``build/docs/`` cuando ejecutamos ``setup.py build``, así que podemos simplemente ponerlo en el archivo ``python-markdown-doc.docs``::

source: Because docs also contain source ``.txt`` files, we’ll also tell ``dh_compress`` to not compress them — by adding this to ``debian/rules``:
es: Puesto que docs también contiene archivos fuente ``.txt``, también le indicaremos a ``dh_compress`` que no los comprima, añadiendo lo siguiente a ``debian/rules``:

source: Checking for packaging mistakes
es: Comprobar errores de empaquetado

source: Along with ``lintian``, there is a special tool for checking Python packages — ``lintian4py``. It is available in the `lintian4python`_ package. For example, these two commands invoke both versions of ``lintian`` and check source and binary packages::
es: Junto con ``lintian``, hay una herramienta especial para comprobar paquetes Python, ``lintian4py``. Está disponible en el paquete `lintian4python`_. Por ejemplo, estas dos órdenes invocan a las dos versiones de ``lintian`` y comprueban los paquetes fuentes y binarios::

source: Here, ``-EI`` option is used to enable experimental and informational tags.
es: Aquí la opción ``-EI`` se usa para activar etiquetas experimentales e informativas.

source: See also
es: Vea también

source: The `Python policy`_;
es: `Python policy`_;

source: `Python/Packaging`_ article on Debian wiki;
es: `Python/Packaging`_, artículo en la wiki de Debian;

source: `Python/LibraryStyleGuide`_ and `Python/AppStyleGuide`_ articles on Debian wiki;
es: `Python/LibraryStyleGuide`_ y `Python/AppStyleGuide`_, artículos en la wiki de Debian;

source: Debian `python-modules`_ and `python-apps`_ teams.
es: Los equipos `python-modules`_ y `python-apps`_ de Debian.

source: Security and Stable Release Updates
es: Actualizaciones de seguridad y de versiones estables
uk: Оновлення безпеки й оновлення стабільних релізів

source: Fixing a Security Bug in Ubuntu
es: Corregir un error de seguridad en Ubuntu
uk: Виправлення помилок безпеки в Ubuntu

source: Fixing security bugs in Ubuntu is not really any different than :doc:`fixing a regular bug in Ubuntu<./fixing-a-bug>`, and it is assumed that you are familiar with patching normal bugs. To demonstrate where things are different, we will be updating the dbus package in Ubuntu 10.04 LTS (Lucid Lynx) for a security update.
es: Corregir errores de seguridad no es en tan distinto de :doc:`corregir un error normal en Ubuntu<./fixing-a-bug>`, y se asume que está familiarizado con el parcheo de errores normales. Para mostrar dónde se hacen las cosas de forma diferente, actualizaremos el paquete dbus en Ubuntu 10.04 LTS (Lucid Lynx) para incluir una actualización de seguridad.

source: Obtaining the source
es: Obtener el código fuente
uk: Отримання джерельного коду

source: In this example, we already know we want to fix the dbus package in Ubuntu 10.04 LTS (Lucid Lynx). So first you need to determine the version of the package you want to download. We can use the ``rmadison`` to help with this::
es: En este ejemplo, ya sabemos que deseamos corregir el paquete dbus en Ubuntu10.04 LTS (Lucid Lynx). Así que lo primero es determinar la versión del paquete que quiere descargar. Puede usar «rmadison» para que le ayude::

source: Typically you will want to choose the highest version for the release you want to patch that is not in -proposed or -backports. Since we are updating Lucid's dbus, you'll download 1.2.16-2ubuntu4.2 from lucid-updates::
es: Habitualmente deseará seleccionar la versión más alta para la emisión que pretende parchear que no esté en -proposed o -backports. Ya que estamos actualizando el dbus de Lucid, descargará 1.2.16-2ubuntu4.2 from lucid-updates::

source: Patching the source
es: Parchear el código fuente
uk: Створення латки

source: Now that we have the source package, we need to patch it to fix the vulnerability. You may use whatever patch method that is appropriate for the package, including :doc:`UDD techniques<./udd-intro>`, but this example will use ``edit-patch`` (from the ubuntu-dev-tools package). ``edit-patch`` is the easiest way to patch packages and it is basically a wrapper around every other patch system you can imagine.
es: Ahora que ya tenemos el paquete fuente, necesitamos parchearlo para corregir la vulnerabilidad. Puede usar cualquier método que sea adecuado para el paquete, incluyendo :doc:`técnicas UDD<./udd-intro>`, pero para este ejemplo se usará «edit-patch» (del paquete ubuntu-dev-tools). «edit-patch» es la forma más sencilla de parchear paquetes y básicamente se trata de un envoltorio alrededor de todos los demás sistemas de parches que pueda imaginar.
uk: Тепер, коли ми маємо джерельний пакунок, ми повинні зробити латку для виправлення вразливості. Ви можете використовувати будь-який метод, що підходить для даного пакунку, у тому числі :doc:`методи UDD<./udd-intro>`, але у цьому прикладі будемо використовувати ``edit-patch`` (з пакунку ubuntu-dev-tools). ``edit-patch`` — це найпростіший спосіб для виправлення пакунків, що працює з будь-якою системою латання, яку Ви можете собі уявити.

source: To create your patch using ``edit-patch``::
es: Para crear un parche usando «edit-patch»::
uk: Щоб створити латку за допомогою ``edit-patch``::

source: This will apply the existing patches and put the packaging in a temporary directory. Now edit the files needed to fix the vulnerability. Often upstream will have provided a patch so you can apply that patch::
es: Esto aplicará los parches existentes y dejará el empaquetado en un directorio temporal. Ahora edite los archivos necesarios para solucionar la vulnerabilidad. Frecuentemente se habrá proporcionado un parche desde aguas arriba de forma que pueda aplicarlo::
uk: Це застосує усі існуючі латки й помістить пакунок у тимчасовий каталог. Тепер відредагуйте файли для виправлення вразливостей. Зазвичай в апстрімі лежить і латка, тому Ви одразу можете її застосувати::

source: After making the necessary changes, you just hit Ctrl-D or type exit to leave the temporary shell.
es: Después de hacer los cambios necesarios, simplemente pulse Ctrl+D o escriba «exit» para dejar el intérprete de órdenes temporal.
uk: Після внесення необхідних змін просто натисніть Ctrl-D або наберіть exit, щоб залишити тимчасову командну оболонку.

source: Formatting the changelog and patches
es: Formatear el registro de cambios («changelog») y los parches
uk: Форматування файлу changelog і латок

source: After applying your patches you will want to update the changelog. The ``dch`` command is used to edit the ``debian/changelog`` file and ``edit-patch`` will launch ``dch`` automatically after un-applying all the patches. If you are not using ``edit-patch``, you can launch ``dch -i`` manually. Unlike with regular patches, you should use the following format (note the distribution name uses lucid-security since this is a security update for Lucid) for security updates::
es: Después de aplicar los parches deseará actualizar el registro de cambios («changelog»). La orden «dch» se usa para editar el archivo «debian/changelog» y «edit-patch» lanzará «dch» automáticamente después de des-aplicar todos los parches. Si no está usando «edit-patch», puede lanzar «dch -i» manualmente. A diferencia de los parches normales, debería usar el siguiente formato (note que el nombre de la distribución usa lucid-security, ya que se trata de una actualización de seguridad para Lucid) para actualizaciones de seguridad::

source: Update your patch to use the appropriate patch tags. Your patch should have at a minimum the Origin, Description and Bug-Ubuntu tags. For example, edit debian/patches/99-fix-a-vulnerability.patch to have something like::
es: Actualice su parche para usar las etiquetas de parche adecuadas. Su parche debería tener por lo menos las etiquetas «Origin», «Description» y «Bug-Ubuntu». Por ejemplo, edite debian/patches/99-fix-a-vulnerability.patch para que tenga es siguiente aspecto::
uk: Оновіть свою латку для використання відповідних тегів. Ваша латка повинна містити як мінімум теги Origin, Description і Bug-Ubuntu. Наприклад, відредагуйте ``debian/patches/99-fix-a-vulnerability.patch``, щоб він мав приблизно такі рядки::

source: Multiple vulnerabilities can be fixed in the same security upload; just be sure to use different patches for different vulnerabilities.
es: Muchas vulnerabilidades se puede solucionar en la misma carga de seguridad, pero asegúrese de usar parches distintos para las diferentes vulnerabilidades.
uk: Множинні вразливості можна виправити одним завантаженням безпеки, просто переконайтеся що використовуєте різні латки для різних вразливостей.

source: Test and Submit your work
es: Probar y enviar el trabajo
uk: Перевірка й відправка Вашої праці

source: At this point the process is the same as for :doc:`fixing a regular bug in Ubuntu<./fixing-a-bug>`. Specifically, you will want to:
es: En este punto el proceso es el mismo que para :doc:`arreglar un bug normal de Ubuntu<./fixing-a-bug>`. Más concretamente, deseará:
uk: На цьому етапі процес такий самий, як при :doc:`виправленні звичайних вад в Ubuntu<./fixing-a-bug>`. А саме, Вам потрібно:

source: Build your package and verify that it compiles without error and without any added compiler warnings
es: Construir el paquete y comprobar que compila sin errores y sin ningún aviso del compilador añadido.
uk: Виконати збірку пакунку й перевірити, що він компілюється без помилок і компілювальник не видає ніяких додаткових застережень

source: Upgrade to the new version of the package from the previous version
es: Actualizar a la nueva versión del paquete desde la versión anterior
uk: Виконати оновлення з попередньої версії пакунку до нової версії

source: Test that the new package fixes the vulnerability and does not introduce any regressions
es: Probar que el nuevo paquete corrige la vulnerabilidad y no introduce ninguna regresión
uk: Переконатися, що новий пакунок латає вразливість й не вносить ніяких погіршень

source: Submit your work via a Launchpad merge proposal and file a Launchpad bug being sure to mark the bug as a security bug and to subscribe ``ubuntu-security-sponsors``
es: Enviar el trabajo mediante una propuesta de integración de Launchpad y rellenar un error en Launchpad asegurándose de marcar el error como un fallo de seguridad y de suscribirse a «ubuntu-security-sponsors».
uk: Відправляйте свою працю через пропозицію про об’єднання Launchpad й відправляйте баг в Launchpad, переконавшись що позначили баг як помилку безпеки, й для підписки ``ubuntu-security-sponsors``

source: If the security vulnerability is not yet public then do not file a merge proposal and ensure you mark the bug as private.
es: Si la vulnerabilidad de seguridad no es pública todavía no presente una propuesta de integración y asegúrese de marcar el error como privado.
uk: Якщо це вразливість у безпеці, про яку ще не оголошено публічно, то не відправляйте пропозицію злиття й переконайтеся, що Ви позначили свою помилку, як приватну (private).

source: The filed bug should include a Test Case, i.e. a comment which clearly shows how to recreate the bug by running the old version then how to ensure the bug no longer exists in the new version.
es: El presentado debe incluir un caso de prueba, es decir, un comentario que indique claramente cómo recrear el error ejecutando la versión antigua y luego cómo asegurarse de que el error no existe en la nueva versión.
uk: Відправлений баг повинен містити Тестовий Приклад, тобто коментар, який чітко показує як відтворити баг, запустивши стару версію, також показуючи як переконатися, що баг більше не існує у новій версії.

source: The bug report should also confirm that the issue is fixed in Ubuntu versions newer than the one with the proposed fix (in the above example newer than Lucid). If the issue is not fixed in newer Ubuntu versions you should prepare updates for those versions too.
es: El informe de error debería también confirmar que la incidencia está solucionada en versiones más recientes de Ubuntu que la que incluye la corrección propuesta (en el ejemplo anterior, más modernas que Lucid). Si la incidencia no está solucionada en versiones más modernas de Ubuntu debería preparar las actualizaciones también para esas versiones.

source: Stable Release Updates
es: Actualizaciones de versiones estables
uk: Оновлення стабільного релізу

source: We also allow updates to releases where a package has a high impact bug such as a severe regression from a previous release or a bug which could cause data loss. Due to the potential for such updates to themselves introduce bugs we only allow this where the change can be easily understood and verified.
es: También se permite actualizaciones de emisiones en las que un paquete tiene un error de gran impacto, como por ejemplo una regresión severa de una emisión anterior o un error que podría causar pérdida de datos. Debido al potencia de que esas actualizaciones a su vez introduzcan errores solo se permiten cuando los cambios pueden ser fácilmente comprendidos y verificados.
uk: Ми також дозволяємо вносити оновлення у випуски, у яких пакунок містить серйозну помилку, таку як значна реґресія у порівнянні з попереднім випуском або вада, яка може призвести до втрати даних. З-за того, що такі зміни самі потенційно можуть призвести до появи додаткових помилок, ми дозволяємо робити це лише там, де зміни легко можна зрозуміти та перевірити.

source: The process for Stable Release Updates is just the same as the process for security bugs except you should subscribe ``ubuntu-sru`` to the bug.
es: El proceso de actualizaciones de versiones estables es el mismo que el proceso para errores de seguridad excepto que debería suscribir «ubuntu-sru» al error.
uk: Процес оновлень стабільного випуску (Stable Release Updates або SRU) такий самий, як і для виправлень помилок безпеки, за виключенням того, що потрібно підписати на звіт про ваду команду ``ubuntu-sru``.

source: The update will go into the ``proposed`` archive (for example ``lucid-proposed``) where it will need to be checked that it fixes the problem and does not introduce new problems. After a week without reported problems it can be moved to ``updates``.
es: La actualización irá al repositorio «proposed» (por ejemplo, «lucid-proposed») donde se deberá comprobar que soluciona el problema y no introduce nuevos errores. Después de una semana sin problemas reportados se puede mover a «updates».

source: See the `Stable Release Updates wiki page`_ for more information.
es: Véase la Stable Release Updates wiki page`_ para más información.

source: Traditional Packaging
es: Empaquetado tradicional
uk: Традиційні методи створення пакунків

source: The majority of this guide deals with :doc:`Ubuntu Distributed Development <./udd-intro>` (UDD) which utilizes the distributed version control system (DVCS) Bazaar for :ref:`retrieving package sources <branching>` and submitting fixes with :ref:`merge proposals. <merge-proposal>` This article will discuss what we will call traditional packaging methods for lack of a better word. Before Bazaar was adopted for Ubuntu development, these were the typical methods for contributing to Ubuntu.
es: La mayor parte de esta guía trata del desarrollo distribuido de Ubuntu (:doc:`Ubuntu Distributed Development <./udd-intro>` (UDD)) que emplea el sistema de control de versiones distribuido (DVCS) Bazaar para obtener los paquetes fuentes ( :ref:`retrieving package sources <branching>`) y enviar correcciones con propuestas de integración (:ref:`merge proposals. <merge-proposal>`). Esta artículo explicará lo que denominamos métodos de empaquetado tradicional, a falta de una palabra mejor. Antes de que se adoptara Bazaar para el desarrollo de Ubuntu estos eran los métodos típicos para contribuir a Ubuntu.
uk: Велика частина даного посібника відноситься до :doc:`Ubuntu Distributed Development <./udd-intro>` (UDD), яке використовує розповсюджувану версію системи керування (DVCS) Bazaar для :ref:`отримання джерел пакунків <branching>` й відправки фіксів через :ref:`пропозиції про злиття. <merge-proposal>` У цій статті ми обговоримо так звані "традиційні" методи створення пакунків. До того як Bazaar стали застосовувати у розробках Ubuntu, допомогти Ubuntu можна було стандартними способами.

source: In some cases, you may need to use these tools instead of UDD. So it is good to be familiar with them. Before you begin, you should already have read the article :doc:`Getting Set Up. <./getting-set-up>`
es: En algunos casos, puede que necesite estas herramientas en lugar de UDD. Así que es recomendable estar familiarizado con ellas. Antes de que comience, debería haber leído ya el artículo sobre la preparación de la configuración en :doc:`Getting Set Up. <./getting-set-up>`
uk: У деяких випадках Вам може знадобитися використовувати ці інструменти замість UDD. Тому не завадить познайомитися з ними. Перед тим, як продовжити, Вам слід прочитати статтю :doc:`Підготовка. <./getting-set-up>`

source: Getting the Source
es: Obtener el código fuente
uk: Отримання джерельного коду

source: In order to get a source package, you can simply run::
es: Para obtener un paquete fuente, puede simplemente ejecutar::
uk: Щоб отримати пакунок джерельного коду, можна просто набрати::

source: This method has some draw backs though. It downloads the version of the source that is available on **your system.** You are likely running the current stable release, but you want to contribute your change against the package in the development release. Luckily, the ``ubuntu-dev-tools`` package provides a helper script::
es: Este método, sin embargo, tiene algunos inconvenientes. Descarga la versión del código fuente que está disponible en **su sistema**. El probable que esté corriendo la emisión estable actual, pero que desee contribuir su cambio contra el paquete de la versión en desarrollo. Afortunadamente, el paquete ``ubuntu-dev-tools`` le proporciona un asistente::
uk: Але в цього методу є деякі недоліки. Він стягує версію джерельного коду, яка доступна у **Вашій системі.** Швидше за усе, в Вас встановлено поточний стабільний випуск, а Ви збираєтеся внести зміни у пакунок у розроблюваному випуску. На щастя, пакунок ``ubuntu-dev-tools`` надає допоміжний сценарій::

source: By default, the latest version in the development release will be downloaded. You can also specify a version or Ubuntu release like::
es: De forma predeterminada, se descargará la última versión de la emisión en desarrollo. Puede también indicar una versión o emisión de Ubuntu como::
uk: Типово буде завантажена найсвіжіша версія з розроблюваного выпуску. Можна також вказати версію випуску Ubuntu таким чином::

source: to pull the source from the ``precise`` release, or::
es: para extraer el código fuente de la emisión ``precise`` o::

source: to download version ``1.0-1ubuntu1`` of the package. For more information on the command, see ``man pull-lp-source``.
es: para descargar la versión ``1.0-1ubuntu1`` del paquete. Para más información sobre la orden, véase ``man pull-lp-source``.
uk: щоб стягнути версію пакунку ``1.0-1ubuntu1``. Для отримання додаткової інформації про команду скористайтеся ``man pull-lp-source``.

source: For our example, let's pretend we got a bug report saying that "colour" in the description of ``xicc`` should be "color," and we want to fix it. *(Note: This is just an example of something to change and not really a bug.)* To get the source, run::
es: Para nuestro ejemplo, vamos a suponer que tenemos un informe de error que dice que el «colour» en la descripción de ``xicc`` debería ser «color» y deseamos corregirlo *(tenga en cuenta que esto es sólo un ejemplo de algo a cambiar y no un error de verdad)*. Para obtener el código fuente, ejecute::
uk: Для прикладу, уявімо, що ми отримали звіт про ваду, у якому говориться, що замість "colour" у описі``xicc`` має бути "color," й ми бажаємо це виправити. *(Нотатка: це просто приклад чогось, що можна змінити, а не реальна помилка.)* Щоб отримати джерельний код, уведіть::

source: Creating a Debdiff
es: Crear un Debdiff
uk: Створення Debdiff

source: A ``debdiff`` shows the difference between two Debian packages. The name of the command used to generate one is also ``debdiff``. It is part of the ``devscripts`` package. See ``man debdiff`` for all the details. To compare two source packages, pass the two ``dsc`` files as arguments::
es: Un archivo ``debdiff`` muestra las diferencias entre dos paquetes Debian. El nombre de la orden empleada para generarlo también se llama ``debdiff``. Es parte del paquete ``devscripts``. Veáse ``man debdiff` para obtener toda la información. Para comparar dos paquetes fuentes, pase los dos archivos ``dsc`` como parámetros::
uk: Файл ``debdiff`` показує відмінності між двома пакунками Debian. Ім’я команди, що використовується для його створення, теж ``debdiff``. Вона є частиною пакунку ``devscripts``. Дивіться ``man debdiff`` для детальної інформації про неї. Щоб порівняти два пакунки джерельного коду, передайте команді у якості аргументу два файли ``dsc``::

source: To continue with our example, let's edit the ``debian/control`` and "fix" our "bug"::
es: Para continuar con nuestro ejemplo, edite el archivo ``debian/control`` y «corrija» el «error»::
uk: Щоб продовжити наш приклад, давайте відредагуємо ``debian/control`` й «виправимо» нашу «помилку»::

source: We also must adhere to the `Debian Maintainer Field Spec <https://wiki.ubuntu.com/DebianMaintainerField>`_ and edit ``debian/control`` to replace::
es: Debemos cumplir también con la especificación de campo del mantenedor de Debian (`Debian Maintainer Field Spec <https://wiki.ubuntu.com/DebianMaintainerField>`_) y editar el archivo ``debian/control`` para reemplazar::

source: with::
es: con::
uk: на::

source: You can use the ``update-maintainer`` tool (in the ``ubuntu-dev-tools`` package) to do that.
es: Puede usar la herramienta ``update-maintainer`` (del paquete ``ubuntu-dev-tools``) para hacerlo.
uk: Для цього можна скористатися інструментом ``update-maintainer`` (з пакунку ``ubuntu-dev-tools``).

source: Remember to document your changes in ``debian/changelog`` using ``dch -i`` and then we can generate a new source package::
es: Recuerde documentar sus cambios en ``debian/changelog`` usando ``dch -i`` tras lo cual ya se puede generar un nuevo paquete fuente::
uk: Не забудьте задокументувати Ваші зміни в ``debian/changelog`` за допомогою ``dch -i``, після чого ми можемо згенерувати новый пакунок джерельного коду::

source: Now we can examine our changes using ``debdiff``::
es: Ahora ya puede examinar los cambios usando ``debdiff``::
uk: Тепер можна перевірити наші зміни за допомогою ``debdiff``::
