Repository: canonical/ubuntu-packaging-guide
Catalog: po/*.po
Languages: es, uk

source: Any updates to the package that have uploaded since your checkout will now be pulled in. You do not want to make changes to this branch. Instead, create a branch that will contain just the changes you're going to make. Let's say you want to fix bug 12345 for the Tomboy project. When you're in the shared repository you previously created for Tomboy, you can create your bug fix branch like this::
es: Todas las actualizaciones al paquete que se hayan subido desde que realizó la extracción se descargarán en este momento. No va a querer hacer cambios a esta rama. En lugar de eso, cree una rama que contendrá únicamente los cambios que va a realizar. Digamos que quiere corregir el error 12345 del proyecto Tomboy. Cuando esté en el repositorio compartido que ha creado previamente para Tomboy, puede crear la rama de corrección del error de la siguiente forma::
uk: Будуть показані будь-які оновлення стосовно пакунку, які були завантажені з миті налагодження. Ви не бажаєте вносити зміни у цю гілку. Замість цього створіть гілку, яка буде містити лише ті зміни, які Ви збираєтеся внести. Припустімо, Ви бажаєте виправити баг 12345 для проєкту Tomboy. Коли Ви знаходитеся у загальнодоступному сховищі, раніше створеному для Tomboy, Ви можете створити гілку для виправлення вад таким чином::

source: Now you can do all my work in the ``bug-12345`` directory. You make changes there as necessary, committing as you go along. This is just like doing any kind of software development with Bazaar. You can make intermediate commits as often as you like, and when your changes are finished, you will use the standard ``dch`` command (from the ``devscripts`` package)::
es: Ahora puede hacer todo el trabajo en el directorio ``bug-12345``. Puede hacer ahí los cambios que considere necesarios, confirmándolos según avance. Esto es lo mismo que realizar cualquier desarrollo de software con Bazaar. Puede hacer confirmaciones parciales tan frecuentes como desee y cuando haya terminado con los cambios, usará la orden estándar ``dch`` (del paquete ``devscripts``)::
uk: Тепер Ви можете виконувати усю роботу в директорії ``bug-12345``. Робіть там усі необхідні зміни, не забуваючи заразом відправляти свою роботу. Цей процес схожий з розробкою будь-яких застосунків за допомогою Bazaar. Можна робити проміжні відправки так часто, як забажаєте, а коли Ви закінчили роботу над змінами, використовуйте стандартну команду ``dch`` (з пакунку ``devscripts``)::

source: This will drop you in an editor to add an entry to the `debian/changelog` file.
es: Esto le dejará en un editor para que añada una entrada al archivo «debian/changelog».
uk: Ця команда відкриє редактор та додасть запис у файл `debian/changelog`.

source: When you added your ``debian/changelog`` entry, you should have included a bug fix tag that indicated which Launchpad bug issue you're fixing. The format of this textual tag is pretty strict: ``LP: #12345``. The space between the ``:`` and the ``#`` is required and of course you should use the actual bug number that you're fixing. Your ``debian/changelog`` entry might look something like::
es: Cuando añadió su entrada en el archivo ``debian/changelog`` debería haber incluido una etiqueta de corrección del error que indique la incidencia de Launchpad que corrige. El formato de esta etiqueta de texto es muy estricto: ``LP: #12345``. El espacio entre ``:`` y ``#`` es obligatorio y, por supuesto, debe usar el número del error real que ha corregido. Su entrada de ``debian/changelog`` podría tener el siguiente aspecto::
uk: При додаванні запису в ``debian/changelog`` Ви повинні включити тег виправлення помилки, який вказує, для якого повідомлення про помилку на Launchpad Ви створили виправлення. Цей текстовий тег має цілком визначений формат: ``LP: #12345``. Пробіл між ``:`` і ``#`` обов’язковий й, зрозуміло, Ви повинні вказати номер реально існуючої помилки, яку Ви виправляєте. Ваш ``debian/changelog`` може виглядати приблизно так::

source: Commit with the normal::
es: Confirmar con el habitual::
uk: Підтвердити з нормальним::

source: A hook in bzr-builddeb will use the debian/changelog text as the commit message and set the tag to mark bug #12345 as fixed.
es: Un enganche en bzr-builddeb usará el texto de debian/changelog como mensaje de confirmación y usará la etiqueta para marcar el bug #12345 como corregido.
uk: Хук в bzr-builddeb буде використовувати текст debian/changelog як повідомлення про завершення відправки й встановить тег для позначення багу #12345 у якості фіксованого.

source: This only works with bzr-builddeb 2.7.5 and bzr 2.4, for older versions use ``debcommit``.
es: Esto solo funciona con bzr-builddeb 2.7.5 y bzr 2.4. Para versiones más antiguas use ``debcommit``.
uk: Це працює лише з bzr-builddeb 2.7.5 і bzr 2.4, для старіших версій використовуйте ``debcommit``.

source: Along the way, you'll want to build your branch so that you can test it to make sure it does actually fix the bug.
es: Por el camino querrá compilar su rama de forma que pueda probarla y asegurarse de que realmente corrige el error.

source: In order to build the package you can use the ``bzr builddeb`` command from the ``bzr-builddeb`` package. You can build a source package with::
es: Para de construir el paquete se puede utilizar la orden ``bzr builddeb`` del paquete ``bzr-builddeb``. Se puede construir un paquete fuente con::
uk: Щоб створити пакунок, Ви можете використовувати команду ``bzr builddeb`` з пакунку ``bzr-builddeb``. Ви можете створити джерельний пакунок за допомогою::

source: (``bd`` is an alias for ``builddeb``.) You can leave the package unsigned by appending ``-- -uc -us`` to the command.
es: (``bd`` es un alias de ``builddeb``). Se puede dejar el paquete sin firmar añadiendo ``-- -uc -us`` a la orden.
uk: (``bd`` — це псевдонім для ``builddeb``.) Ви можете залишити пакунок непідписаним, додавши до команди ``-- -uc -us``.

source: It is also possible to use your normal tools, as long as they are able to strip the .bzr directories from the package, e.g.::
es: También es posible utilizar sus herramientas habituales, siempre que sean capaces de eliminar los directorios .bzr del paquete, por ejemplo::
uk: Ви можете також використовувати свої звичайні інструменти, якщо вони здатні прибирати каталоги ``.bzr`` з пакунку, наприклад::

source: If you ever see an error related to trying to build a native package without a tarball, check to see if there is a ``.bzr-builddeb/default.conf`` file erroneously specifying the package as native. If the changelog version has a dash in it, then it's not a native package, so remove the configuration file. Note that while ``bzr builddeb`` has a ``--native`` switch, it does not have a ``--no-native`` switch.
es: Si en algún momento encuentra un error al intentar construir un paquete nativo sin un archivo tar, compruebe si existe un archivo ``.bzr-builddeb/default.conf`` que erróneamente especifique el paquete como nativo. Si la versión del changelog incluye un guión, no se trata de un paquete nativo, así que elimine el archivo de configuración. Tenga en cuenta que aunque ``bzr builddeb`` tiene un indicador ``--native``, no dispone de un indicador ``--no-native``.

source: Once you've got the source package, you can build it as normal with ``pbuilder-dist`` (or ``pbuilder`` or `sbuild`_).
es: Una vez haya obtenido el paquete fuente, puede construirlo de forma normal con «pbuilder-dist» (o «pbuilder» o `sbuild`_).
uk: Після того, як Ви отримали пакунок джерельного коду, можна зібрати його як звичайно, за допомогою ``pbuilder-dist`` (або ``pbuilder``, або `sbuild`_).

source: The `DEP 8 specification <DEP8_>`_ defines how automatic testing can very easily be integrated into packages. To integrate a test into a package, all you need to do is:
uk: `Специфікація DEP 8 <DEP8_>`_ визначає, як можна легко інтегрувати автоматичне тестування у Ваші пакунки. Для цього, необхідно:

source: In ``debian/tests/control`` you specify what to expect from the testbed. So for example you list all the required packages for the tests, if the testbed gets broken during the build or if ``root`` permissions are required. The `DEP 8 specification <DEP8_>`_ lists all available options.
uk: У файлі ``debian/tests/control`` Ви можете визначити вимоги до тестового оточення. Наприклад, якщо тести не проходять при збірці, або потрібні права ``root`` -- Ви перераховуєте необхідні для тестів пакунки. У `Специфікації DEP 8 <DEP8_>`_ Ви знайдете усі доступні опції.

source: While this test is very small and simple, it covers quite a lot: that your -dev package has all necessary dependencies, that your package installs working pkg-config files, headers and libraries are put into the right place, or that the compiler and linker work. This helps to uncover critical issues early on.
uk: Хоч цей тест дуже маленький і простий, він перевіряє багато: що Ваш -dev пакунок має усі необхідні залежності, що Ваш пакунок встановлює робочі файли pkg-config, заголовкові файли і бібліотеки поміщуються у потрібне місце, або що компілювальник та компонувальник працюють. Це допомогає виявити критичні помилки на початковій стадії.

source: While the test script can be easily executed on its own, it is strongly recommended to actually use ``adt-run`` from the ``autopkgtest`` package for verifying that your test works; otherwise, if it fails in the Ubuntu Continuous Integration (CI) system, it will not land in Ubuntu. This also avoids cluttering your workstation with test packages or test configuration if the test does something more intrusive than the simple example above.
uk: Не дивлячись на те, що скрипт тестування може бути запущений напряму, все ж рекомендується використовувати ``adt-run`` з пакунку ``autopkgtest`` для перевірки проходження тестів; у протилежному випадку, якщо тест покаже помилку у системі Ubuntu Continuous Integration (CI) -- пакунок не пройде в Ubuntu. Заодне можна уникнути "засмічування" Вашої робочої станції тестовими пакунками та конфігураціями у випадку, якщо тест здійснює дещо більш серйозне у відношенні системи, ніж у прикладі вище.

source: The `README.running-tests <running_tests_local_>`_ (`online version <DEP8_>`_) documentation explains all available testbeds (schroot, LXC, QEMU, etc.) and the most common scenarios how to run your tests with ``adt-run``, e. g. with locally built binaries, locally modified tests, etc.
uk: У документації `README.running-tests <running_tests_local_>`_ (`онлайн-версія: <DEP8_>`_) пояснюються усі доступні тестові оточення (schroot, LXC, QEMU, etc) й наводяться найпопулярніші способи запуску тестів через ``adt-run``. Наприклад, з локальною збіркою бінарників, локально модифікованими тестами, тощо

source: The Ubuntu CI system uses the QEMU runner and runs the tests from the packages in the archive, with ``-proposed`` enabled. To reproduce the exact same environment, first install the necessary packages::
uk: Система безперервної інтеграції Ubuntu CI використовує емулятор QEMU й запускає тести з пакунків у архіві, з увімкненим прапорцем ``-proposed``. Щоб вручну отримати те ж оточення, спочатку необхідно встановити наступні пакунки:

source: Now build a testbed with::
uk: Тепер виконайте збірку тестового оточення, виконавши таке:

source: (Please see its manpage and ``--help`` output for selecting different releases, architectures, output directory, or using proxies). This will build e. g. ``adt-trusty-amd64-cloud.img``.
uk: (Детальніше про вибір інших релізів, архітектур, цільових директорій, й про використання проксі -- в manpage й у виводі опції ``--help``). Ця команда виконає збірку, наприклад ``adt-trusty-amd64-cloud.img``.

source: Then run the tests of a source package like ``libpng`` in that QEMU image::
uk: Тепер запустіть тести джерельного пакунку, наприклад ``libpng``, у образі QEMU:

source: The Ubuntu CI system runs packages with ``-proposed`` enabled; to enable that, run::
uk: Система Ubuntu CI запускає пакунки з увімкненим прапорцем ``-proposed``; щоб увімкнути це, запустіть::

source: The ``adt-run`` manpage has a lot more valuable information on other testing options.
uk: Man-сторінка ``adt-run`` містить багато цінної інформації з інших параметрів тестування.

source: The `libxml2 tests <libxml2_>`_ are very similar. They also run a test-build of a simple piece of C code and execute it.
uk: Для бібліотеки `libxml2 <libxml2_>`_ , тести дуже схожі. Вони також запускають тестову збірку простого коду на C й виконують його.

source: The `gtk+3.0 tests <gtk3_>`_ also do a compile/link/run check in the "build" test. There is an additional "python3-gi" test which verifies that the GTK library can also be used through introspection.
uk: Пакунок `gtk+3.0 tests <gtk3_>` також компілює/лінкує/запускає перевірку у тесті "build". Також є додатковий тест "python3-gi", який перевіряє що бібліотека GTK може бути використана під час тесту.

source: In the `ubiquity tests <ubiquity_>`_ the upstream test-suite is executed.
uk: У пакунку `ubiquity tests <ubiquity_>`_ використовується набір тестів батьківського пакунку

source: The `gvfs tests <gvfs_>`_ have comprehensive testing of their functionality and are very interesting because they emulate usage of CDs, Samba, DAV and other bits.
uk: Пакунок `gvfs tests <gvfs_>`_ -- дуже цікавий приклад: він тестує свій функціонал "на повну", включаючи емулювання CD, Samba, DAV та інших компонентів.

source: Packages which have ``autopkgtest`` enabled will have their tests run whenever they get uploaded or any of their dependencies change. The output of `automatically run autopkgtest tests <jenkins_>`_ can be viewed on the web and is regularly updated.
uk: Пакунки з увімкненим ``autopkgtest`` будуть тестуватися при вивантаженні, або якщо оновляться якісь залежності. Результат роботи `автоматичний запуск тестів autopkgtest <jenkins_>`_ може бути переглянутий на сайті, й він регулярно оновлюється.

source: Debian also uses ``adt-run`` to run package tests, although currently only in schroots, so results may vary a bit. Results and logs can be seen on http://ci.debian.net. So please submit any test fixes or new tests to Debian as well.
uk: Debian також використовує ``adt-run`` для запуску тестів пакунку, але на цю мить -- лише в оточенні schroot, тож результати можуть різнитися. Результати і логи можна подивитися за посиланням http://ci.debian.net. Будь ласка, також відправляйте виправлення для тестів або нові тести в Debian.

source: write the ``debian/tests/control`` based on the `DEP 8 Specification <dep8_>`_,
uk: створіть ``debian/tests/control``, основуючись на `Специфікації DEP 8 <dep8_>`_,

source: What you can do
uk: Чи Ви можете допомогти

source: The Ubuntu Engineering team put together a `list of required test-cases <requiredtests_>`_, where packages which need tests are put into different categories. Here you can find examples of these tests and easily assign them to yourself.
uk: Команда Ubuntu Engineering зібрала `перелік необхідних тестів <requiredtests_>`_, у якому пакунки, що потребують тестування, розподілені за категоріями. Там можна знайти приклади таких тестів й взяти їх на себе.

source: If you should run into any problems, you can join the `#ubuntu-quality IRC channel <qualityirc_>`_ to get in touch with developers who can help you.
uk: Якщо Ви зіштовхнетеся з проблемами, приєднуйтеся до IRC на каналу `#ubuntu-quality IRC channel <qualityirc_>`_: розробники звичайно Вам допоможуть.

source: Sometimes you might want to make new functionality available in a stable release which is not connected to a critical bug fix. For these scenarios you have two options: either you `upload to a PPA <ppadoc_>`_ or prepare a backport.
uk: Буває може знадобитися додати функційності у стабільный реліз, який не пов’язаний з виправленням критичних проблем. У подібних випадках, є два варіянти: або Ви `завантажите його в PPA <ppadoc_>`_, або підготуєте бекпорт (backport).

source: The `PPA documentation on Launchpad <ppadoc_>`_ is fairly comprehensive and should get you up and running in no time.
uk: `Документація до PPA на Launchpad <ppadoc_>`_ має достатньо всеосяжний характер й допоможе Вам швидко почати роботу з ним.

source: This will create a directory ``trusty`` and install a minimal trusty system into it.
uk: Це створить теку ``trusty`` і встановить мінімальний образ trusty у неї.

source: If your version of ``debootstrap`` does not know about Trusty you can try upgrading to the version in ``backports``.
uk: Якщо Ваша версія ``debootstrap`` не визначить Trusty, спробуйте оновитися до версії в ``backports``.

source: For more information on chroots see our `Debootstrap Chroot wiki page <DebootstrapChroot_>`_.
uk: На сторінці `Debootstrap Chroot вікі <DebootstrapChroot_>`_ Ви знайдете детальнішу інформацію про chroot-оточення.

source: SBuild is a system similar to PBuilder for creating an environment to run test package builds in. It closer matches that used by Launchpad for building packages but takes some more setup compared to PBuilder. See `the Security Team Build Environment wiki page <SecurityEnv_>`_ for a full explanation.
uk: SBuild -- система, схожа на PBuilder, що використовується для створення оточення, у якому виконуються тестові збірки пакунку. Вона близька до тієї, яку використовує Launchpad для збірки пакунків, але її встановлення дещо складніше, ніж PBuilder. Повнішу інформацію можна знайти на вікісторінці `Система Збірки Security Team <SecurityEnv_>`_.

source: Full virtual machines can be useful for packaging and testing programs. TestDrive is a program to automate syncing and running daily ISO images, see `the TestDrive wiki page <TestDrive_>`_ for more information.
uk: Повні віртуальні машини можуть бути корисні для створення пакунків й тестування проґрам. TestDrive — це проґрама, яка дозволяє автоматизувати синхронізацію і запуск щоденних ISO-образів. Детальніше дивіться `wiki-сторінку TestDrive <TestDrive_>`_.

source: Amazon's `EC2 cloud computers <EC2_>`_ allow you to hire a computer paying a few US cents per hour, you can set up Ubuntu machines of any supported version and package on those. This is useful when you want to compile many packages at the same time or to overcome bandwidth restraints.
uk: Хмарний сервіс `Amazon EC2 <EC2_>`_ дозволить Вам придбати комп’ютер у хмарі, ціна за який -- усього декілька центів на годину. Там Ви можете встановити Ubuntu будь-якої підтримуваної версії і працювати з пакунками віддалено, що дуже зручно, якщо потрібна збірка багатьох пакунків одночасно, або якщо потрібно подолати повільну швидкість Інтернет-під’єднання.

source: For further information, see the `changelog section (Section 4.4) <policy-changelog_>`_ of the Debian Policy Manual.
uk: Детальнішу інформацію можна знайти на сторінці `changelog (Розділ 4.4) <policy-changelog_>`_ документу Debian Policy Manual.

source: For the Ubuntu ``hello`` package, the ``control`` file looks something like this:
uk: Для пакунку Ubuntu ``hello`` файл ``control`` виглядає таким чином:

source: Note that in Ubuntu, we set the ``Maintainer`` field to a general address because anyone can change any package (this differs from Debian where changing packages is usually restricted to an individual or a team). Packages in Ubuntu should generally have the ``Maintainer`` field set to ``Ubuntu Developers <ubuntu-devel-discuss@lists.ubuntu.com>``. If the Maintainer field is modified, the old value should be saved in the ``XSBC-Original-Maintainer`` field. This can be done automatically with the ``update-maintainer`` script available in the ``ubuntu-dev-tools`` package. For further information, see the `Debian Maintainer Field spec <MaintField_>`_ on the Ubuntu wiki.
uk: Зауважте, що в Ubuntu ми вказуємо у полі ``Maintainer`` загальну адресу, оскільки будь-яка людина може змінити будь-який пакунок (на відміну від Debian, де правом змінювання пакунків володіють лиши окремі люди або команда). Пакунки в Ubuntu, як правило, повинні у полі ``Maintainer`` містити ``Ubuntu Developers <ubuntu-devel-discuss@lists.ubuntu.com>``. Якщо поле Maintainer змінено, старе значення повинне бути збережене у полі ``XSBC-Original-Maintainer``. Це можна зробити автоматично сценарієм ``update-maintainer`` з пакунку ``ubuntu-dev-tools``. Для подальшої інформації дивіться `Debian Maintainer Field spec <MaintField_>`_ в Ubuntu wiki.

source: For further information, see the `control file section (Chapter 5) <policy-control_>`_ of the Debian Policy Manual.
uk: Детальнішу інформацію можна знайти на сторінці `секції control-файлу (Розділ 5) <policy-control_>`_ документу Debian Policy Manual.

source: This file gives the copyright information for both the upstream source and the packaging. Ubuntu and `Debian Policy (Section 12.5) <policy-copyright_>`_ require that each package installs a verbatim copy of its copyright and license information to ``/usr/share/doc/$(package_name)/copyright``.
uk: Файл містить інформацію про копірайти джерельних кодів і самого пакунку. Ubuntu і `Debian Policy (Розділ 12.5) <policy-copyright_>`_ потребують, щоб кожен пакунок встановлював незмінну копію копірайту та інформації з ліцензування у теку ``/usr/share/doc/$(ім’я_пакунку)/copyright``

source: This example follows the `Machine-readable debian/copyright <DEP5_>`_ format. You are encouraged to use this format as well.
uk: Приклад використовує `машино-зрозумілий формат debian/copyright <DEP5_>`_, й авторам пакунків також рекомендується використовувати цей формат.

source: If your tarballs live on Launchpad, the ``debian/watch`` file is a little more complicated (see `Question 21146 <Q21146_>`_ and `Bug 231797 <Bug231797_>`_ for why this is). In that case, use something like::
uk: Якщо Ваші tarball-файли перебувають на Launchpad, файл ``debian/watch`` має трохи складніший вигляд (про те, чому це так, дивіться `Question 21146 <Q21146_>`_ і `Bug 231797 <Bug231797_>`_). У цьому випадку використовуйте щось типу::

source: https://wiki.debian.org/Projects/DebSrc3.0 summarizes additional information concerning the switch to the 3.0 source package formats.
uk: https://wiki.debian.org/Projects/DebSrc3.0 містить додаткову інформацію стосовно переходу на версію 3.0 формату джерельних пакунків.

source: See ``man dpkg-source`` and the `source/format section (Section 5.21) <policy-format_>`_ of the Debian New Maintainers' Guide for additional details.
uk: Додаткову інформацію можна знайти в ``man dpkg-source`` і у `Розділі source/format (Розділ 5.21) <policy-format_>`_ посібника Debian New Maintainers.

source: In addition to the links to the Debian Policy Manual in each section above, the Debian New Maintainers' Guide has more detailed descriptions of each file. `Chapter 4, "Required files under the debian directory" <RequiredFiles_>`_ further discusses the control, changelog, copyright and rules files. `Chapter 5, "Other files under the debian directory" <OtherFiles_>`_ discusses additional files that may be used.
uk: Крім Debian Policy Manual, на який посилається стаття, посібник Debian New Maintainers' Guide містить більш детальний опис для кожного файлу. `Розділ 4, "Необхідні файли у теці debian" <RequiredFiles_>`_ дає опис файлів control, changelog, copyright і rules. `Розділ 5, "Інші файли у теці debian" <OtherFiles_>`_ дає опис додаткових файлів, які можна використовувати.
