Repository: canonical/ubuntu-packaging-guide
Catalog: po/*.po
Languages: es, uk

source: The last parameter is the location of the tarball that you are upgrading to; this can either be a local filesystem path, or a http, ftp, sftp, etc. URI as shown. The command will automatically download the tarball for you. The tarball will be renamed appropriately and, if required, converted to ``.gz``.
es: El último parámetro es la ubicación del archivo tar al que se está actualizando; puede ser una ruta local de su sistema de archivos o una URI http, ftp, sftp, etc. como se muestra. La orden descargará automáticamente el archivo tar por usted.
uk: Останній параметр — це місцезнаходження тарболу, на який виконується оновлення: це може бути шлях у локальній файловій системі, http, ftp, sftp або інша URI, як показано у прикладі. Команда автоматично завантажить тарбол для Вас, перейменує його відповідним чином й, якщо потрібно, перетворить у ``.gz``.

source: The `merge-upstream` command will either tell you that it completed successfully, or that there were conflicts. Either way you will be able to review the changes before committing as normal.
es: La orden «merge-upstream» le dirá si se ha ejecutado con éxito o si aparecieron conflictos. En cualquiera de los casos podrá revisar los cambios antes de confirmarlos como siempre.
uk: Команда ``merge-upstream`` повідомить або про своє вдале завершення, або про те, що є конфлікти. У будь-якому випадку в Вас буде можливість перевірити зміни перед їх фіксацією у звичний спосіб.

source: If you are merging an upstream release into an existing Bazaar branch that has not previously used the UDD layout, ``bzr merge-upstream`` will fail with an error that the tag for the previous upstream version is not available; the merge can't be completed without knowing what base version to merge against. To work around this, create a tag in your existing repository for the last upstream version present there; e.g., if the last Ubuntu release was *1.1-0ubuntu3*, create the tag *upstream-1.1* pointing to the bzr revision you want to use as the tip of the upstream branch.
es: Si está integrando una emisión de aguas arriba en una rama Bazaar existente que no ha usado anteriormente la distribución de UDD, «bzr merge-upstream» fallará con un error indicando que la etiqueta de la versión anterior de aguas arriba no está disponible; la integración no se puede completar sin conocer contra qué versión base hacerlo. Para solventar el problema, cree una etiqueta en su repositorio para la última versión de aguas arriba ahí presente; por ejemplo, si la última emisión de Ubuntu fue *1.1-0ubuntu3*, cree la etiqueta *upstream-1.1* apuntando a la revisión bzr que desea que se use como punta de la rama de aguas arriba.
uk: Якщо Ви об’єднуєте реліз апстріму з існуючою гілкою Bazaar, у якій ще не використовуалася розмітка UDD, ``bzr merge-upstream`` пройде невдало й з помилкою, що тег попередніх версій апстріму недоступний. Злиття неможна виконати без знання базової версії для злиття. Для роботи з цим, створіть тег у своєму існуючому репозиторії для останньої версії апстріму що там є; наприклад, якщо останній реліз Ubuntu був *1.1-0ubuntu3*, створіть тег *upstream-1.1*, вказуючи на зміну bzr, яку Ви бажаєте використовувати як підказку для гілки апстріму.

source: You will need newer versions of ``bzr`` and the ``bzr-builddeb`` for the ``merge`` command to work. Use the versions from Ubuntu 12.04 (Precise) or the development versions from the ``bzr`` PPA. Specifically, you need ``bzr`` version 2.5 beta 5 or newer, and ``bzr-builddeb`` version 2.8.1 or newer. For older versions, use the ``bzr merge-package`` command instead.
es: Necesitará versiones más modernas de «bzr» y de «bzr-builddeb» para que funcione la orden «merge». Use las versiones de Ubuntu 12.04 (Precise) o las versiones de desarrollo del PPA «bzr». Más concretamente, necesitará «bzr» versión 2.5 beta 5 o superior y «bzr-builddeb» version 2.8.1 o superior. Con versiones más antiguas, use en su lugar la orden «bzr merge-package».
uk: Для роботи з командою ``merge`` Вам знадобляться новіші версії ``bzr`` та ``bzr-builddeb``. Використовуйте версії з Ubuntu 12.04 (Precise) або розроблювані версії з PPA ``bzr``. Точніше кажучи, Вам знадобиться ``bzr`` версії 2.5 beta 5 або новішої, а також ``bzr-builddeb`` версії 2.8.1 або новішої. Для старих версій використовуйте назамін команду ``bzr merge-package``.

source: Working with Patches
es: Trabajar con parches

source: Many existing packages that have changes from upstream express those changes using a patch system, of which there are several to choose from. Usually, when you make an additional change to a package, you'll want to add a patch file to the patch system being used, rather than editing the source code in place. Note however that it is considered bad practice to add a patch system to a package that does not already have one. In that case, either coordinate with the Debian maintainer, or edit the files in place. You can find out if your package has a patch system by using the ``what-patch`` command (from the ``ubuntu-dev-tools`` package).
es: Muchos paquetes existentes que se han cambiado desde aguas arriba expresan esos cambios usando un sistema de parches, de los cuales hay varios entre lo que elegir. Normalmente, cuando haga un cambio adicional a un paquete, deseará añadir un archivo de parche al sistema de parches que se esté usando, en lugar de editar el código fuente directamente. Tenga en cuenta, sin embargo, que se considera una mala práctica añadir un sistema de parches a un paquete que no tiene ya uno. En este caso, coordínese con el mantenedor de Debian o edite los archivos directamente. Puede averiguar si el paquete tiene un sistema de parches usando la orden «what-patch» (del paquete «ubuntu-dev-tools»).

source: While Debian has several patch systems, Quilt_ is becoming the most popular. Quilt acts something like a version control system itself, and in the context of UDD, this can be both a good thing and a bad thing. With Bazaar 2.5 and ``bzr-builddeb`` 2.8.1 (in Ubuntu 12.04 Precise), handling source packages with quilt patches has become much easier.
es: A pesar de que Debian dispone de varios sistemas de parches, Quilt_ se está convirtiendo en el más popular. Quilt él mismo como una especie de sistema de control de versiones y, en el contexto de UDD, puede ser algo bueno y algo malo. Con Bazaar 2.5 y «bzr-builddeb» 2.8.1 (en Ubuntu 12.04 Precise), la gestión de los paquetes fuente con parches quilt se ha facilitado mucho.

source: There are two main tasks where you'll have to be aware of quilt patches, when developing your own patch to the upstream code, and when merging new versions of the package from Debian where either the Debian or Ubuntu (or both) have quilt patches in the source branch.
es: Hay dos tareas principales en las que tendrá que ser consciente de los parches quilt: cuando desarrolle su propio parche al código de aguas arriba y cuando fusione nuevas versiones del paquete desde Debian, donde Debian o Ubuntu (o ambos) tienen parches quilt en la rama fuente.

source: Here are some guidelines for working with quilt patches in UDD in these two scenarios. Some of these techniques are works-in-progress, so you should adapt them to your own workflow, and keep watching for improvements from the Bazaar teams.
es: A continuación se dan algunas directrices para trabajar con parches quilt en UDD en estos dos escenarios. Algunas de estas técnicas son trabajos en curso, así que debería adaptarlas a su flujo de trabajo y vigilar por posibles mejoras desde los equipos de Bazaar.

source: Patches are applied in source branches
es: Los parches se aplican en las ramas fuentes

source: One important thing to keep in mind: all source branches reflect the tree after a ``quilt push -a``. In other words, when you branch a source branch from Launchpad, you get the tree with all patches applied, ready for you to jump right into hacking. You do not need to ``quilt push -a`` manually, and in fact, you'll get a tree with lots of distracting modifications if you push or pop all the changes. Or to put it another way, once you have a branch, jump right in!
es: Algo importante a tener en cuenta: todas las ramas fuentes reflejan el árbol después de una orden «quilt push -a». En otras palabras, cuando bifurque una rama fuente desde Launchpad, obtiene el árbol con todos los parches aplicados, lista para que salte a trabajar. No necesita realizar «quilt push -a» manualmente y, de hecho, obtendrá un árbol con muchas modificaciones que distraen si inserta o extrae todos los cambios. O, por decirlo de otra forma, una vez que tenga la rama, ¡salte sobre ella!

source: Merging from Debian with quilt patches
es: Fusionar desde Debian con parches quilt

source: With newer versions of Bazaar as mentioned above, merging new Debian versions to Ubuntu versions should be quite easy now, even when one or both packages have quilt patches. Just use ``bzr merge`` as you normally would. Under the hood, Bazaar will first un-apply all the patches, then do the merge, then if there are no conflicts, it will re-apply the patches leaving you again with a source branch in the ``quilt push -a`` state.
es: Con versiones más recientes de Bazaar como se ha mencionado anteriormente, integrar nuevas versiones de Debian en Ubuntu debería ser relativamente fácil ahora, incluso cuando uno o ambos paquetes tengan parches quilt. Simplemente use «bzr merge» como haría normalmente. Por debajo, Bazaar primero des-aplicará todos los parches y luego hará la fusión y finalmente, si no hay conflictos, volverá a aplicar los parches dejándole con una rama fuente en el estado «quilt push -a».

source: For example, if we want to merge the Debian version of the ``aptitude`` package with the Ubuntu version, we would do something like this::
es: Por ejemplo, si queremos integrar la versión Debian del paquete «aptitude» en la versión de Ubuntu, haríamos algo como esto::

source: If there are merge conflicts, the quilt patches will remain un-applied so that you can resolve the conflicts more easily. You would use a combination of bzr and quilt commands to resolve the conflicts, until all the quilt patches are applied again. Then you're ready to commit, push, and build as you normally would.
es: Si hubiera conflictos en la integración, los parches quilt permanecerán sin aplicar de forma que pueda resolver los conflictos más fácilmente. Usaría una combinación de órdenes de bzr y quilt para resolver los conflictos, hasta que todos los parches de quilt se hayan aplicado de nuevo. Entonces estará listo para confirmar, empujar los cambios y compilar como haría normalmente.

source: Develop your patch
es: Desarrollar su parche

source: There is a strong preference to fixing packages using a patch system like quilt, rather than modifying the source code directly. This is because with a patch system, it's easier to communicate those changes to Debian or upstream (where UDD isn't used), and to remove patches when upstream fixes the bug the patch addresses (possibly in a completely different way).
es: Existe una fuerte preferencia a arreglar los paquetes usando un sistema de parches como quilt, en lugar de modificar el código fuente directamente. Esto se debe a que con un sistema de parches, es más fácil transmitir esos cambios a Debian o aguas arriba (donde no se usa UDD) y eliminar los parches cuando los errores que solucionan son corregidos aguas arriba (posiblemente de una forma totalmente distinta).

source: Let's say there's a bug in the ``dbus`` package that you want to fix. You start the way you normally would with any package in UDD::
es: Digamos que hay un error en el paquete «dbus» que desea arreglar. Comienza como haría normalmente con cualquier paquete en UDD::

source: Maybe the bug is pretty simple; there's a typo in the ``README`` file. Just fix the typo in your favorite editor, then do a ``bzr stat`` to prove that the file has been edited::
es: Es posible que el error sea muy sencillo; hay una errata en el archivo «README». Simplemente corrija la errata en su editor favorito y luego haga «bzr stat» para probar que el fichero se ha editado::

source: Now, in order to get this fix into a quilt patch, we need to generate a diff, but we need the resulting patch to have a format that is consumable by quilt. The way to do that is to use the ``--prefix`` (or ``-p``) option to ``bzr diff``::
es: Ahora, para obtener esta corrección en un paquete quilt, necesitamos generar un archivo de diferencias (diff), pero necesitamos que el parche resultante tenga un formato aplicable por quilt. La forma de hacerlo es usar la opción «--prefix» (o «-p») con «bzr diff»::

source: What this actually does is to produce a *level 1* diff, which is required by the quilt command we're going to use below. Normally, ``bzr diff`` produces *level 0* diffs which are more easily read by humans, but this won't work with quilt (despite the implication in the quilt documentation).
es: Lo que esto hace realmente es producir un diff de *nivel 1*, lo que es necesario para la orden quilt que vamos a usar más adelante. Normalmente, «bzr diff» produce diffs de *nivel 0* que son mucho más legibles para humanos, pero que no funcionarán con quilt (a pesar de lo que diga en la documentación de quilt).

source: The above command generates the patch and stores it in a file one level up from the working tree. Note that here we're using the ``a`` and ``b`` directory prefixes for the diff, but the actual names don't really matter.
es: El comando anterior genera el parche y lo almacen en un archivo un nivel por arriba en el árbol de trabajo. Tenga en cuenta que estamos usando los prefijos de directorios «a» y «b», pero que los nombres reales no importan.

source: Now all you need to do is to import the patch into your quilt patches. If you named the file above with the same name you want into your quilt stack, then just do this::
es: Ahora todo lo que tiene que hacer es importar el parche en sus parches quilt. Si le dio el mismo nombre al fichero anterior que el que quiere usar en la pila de quilt, simplemente haga::

source: You need the last line to inform Bazaar about the new quilt patch file. You can see that the quilt patch's name is the same as the file name you generated above. Of course, you can change this by using the ``-P`` option to ``quilt import``.
es: Necesita la última línea para informarle a Bazaar sobre el nuevo archivo de parche de quilt. Puede comprobar que el nombre del parche de quilt es el mismo que el del fichero que generó antes. Por supuesto, puede cambiaro usando la opción «-P» con «quilt import».

source: One important thing to notice is that if you do the commands ``bzr stat`` and a ``quilt applied`` , you'll see that the ``README`` file is still modified, but the ``bug-12345.patch`` is not yet applied. If you try to apply the newly imported quilt patch (with ``quilt push``), it will fail because you're applying a patch on top of the already patched file.
es: Una cosa importante a tener en cuenta es que si usa las órdenes «bzr stat» y «quilt applied» verá que el archivo «README» aún sigue modificado, pero que el parche «bug--12345.patch» no se ha aplicado todavía. Si intenta aplicar el parche quilt recién importado (con «quilt push») fallará porque está aplicando un parche por encima del archivo ya parcheado.

source: One way around this is to revert the change to ``README`` before doing the ``quilt push``. However, if you think you may want to continue to develop the patch, and thus do not want to throw away your in-tree changes, use ``bzr shelve`` to save the change in the working tree to the side, then do ``quilt push``. Either way, once you've pushed your top quilt patch, you can just edit the tree in place, and do ``quilt refresh`` commands to update the top quilt patch.
es: Una forma de evitar esto es deshacer el cambio en «README» antes de hacer el «quilt push». Sin embargo, si piensa que puede querer continuar con el desarrollo del parche y, por lo tanto no quiere que desaparezca de su árbol de cambios, use «bzr shelve» para guardar el cambio en el árbol de trabajo, a un lado, y luego haga «quilt push». De cualquier forma, una vez que haya empujado su parche quilt superior, puede editar el árbol directamente y usar órdenes «quilt refresh» para actualizar el parche quilt superior.

source: Gotchas
es: Problemas comunes

source: One thing to keep in mind is that quilt uses a hidden ``.pc`` directory to record its status. This directory is under version control in all source branches. *Watch out* for changes to the ``.pc`` directory that are unrelated (or more accurately, uninteresting) to your patch. This can happen because the UDD source branch importer `currently includes any existing .pc directory`_ in the imported branch. This can cause conflicts, or other unwanted or unknown changes because you've essentially got two conflicting version control systems competing for the same thing (i.e. bzr and quilt). For now, the best recommendation is to revert any changes to the ``.pc`` directory in your branch.
es: Algo a tener en cuenta es que quilt usa un directorio «.pc» para guardar su estado. Este directorio está bajo el control de versiones en todas las ramas fuentes. *Vigile* los cambios en el directorio «.pc» que no tengan relación (o más exactamente, no le interesen) con su parche. Esto puede ocurrir porque el importador de la rama fuente UDD actualmente incluye un directorio .pc existente `currently includes any existing .pc directory`_ en la rama importada. Esto puede provocar conflictos o cambios no deseados o desconocidos esencialmente porque han existido dos sistemas de control de versión compitiendo por la misma cosa (esto es, bzr y quilt). Por ahora, la mejor recomendación es que deshaga cualquier cambio del directorio «.pc» de su rama.

source: ``edit-patch`` is a nice little wrapper script that comes as part of the ``ubuntu-dev-tools`` package. It pretty much hides the nasty details of dealing with the patch system specifically. For example, while the above works well if your package is using quilt already, you'll have to adjust the workflow, perhaps significantly, to work with `a different patch system`_. In theory ``edit-patch`` should solve this, but there are currently two blockers.
es: «edit-patch» es un pequeño script de envoltorio que forma parte del paquete «ubuntu-dev-tools». Oculta muchos de los detalles desagradables de trabajar con el sistema de parches. Por ejemplo, mientras que lo anterior funciona bien si su paquete ya está usando quilt, deberá adaptar el flujo de trabajo, quizá significativamente, para trabajar con un sistema de parches diferente `a different patch system`_. En teoría «edit-patch» debería solucionarlo, pero actualmente existen dos impedimentos.

source: By default, ``bzr diff`` produces a ``-p0`` patch, but ``edit-patch`` defers to the underlying patch system's default. For quilt, this is ``-p1``. ``quilt import`` takes a ``-p`` argument to specify the prefix level, but this isn't yet exposed in ``edit-patch``. If you use the ``--prefix`` argument to the ``bzr diff`` command as shown above, you should be okay.
es: Por defecto, «bzr diff» produce un parche «--p0», pero «edit-patch» delega al valor por defecto del sistema de parches subyacente. Para quilt, esto es «-p1». «quilt import» toma el parámetro «-p» para indicar el nivel de prefijo, pero esto no está todavía accesible en «edit-patch». Si usa el parámetro «--prefix» con la orden «bzr diff» como se ha mostrado anteriormente, debería ir bien.

source: By default, ``edit-patch`` requires a path to an existing patch file, but it's more convenient to pipe the output of ``bzr diff`` to the stdin of ``edit-patch``, as shown above. The alternative would be to save the diff in a temporary file, and then point ``edit-patch`` to this temporary file.
es: Por defecto «edit-patch» requiere una ruta a un archivo de parche existente, pero suele ser más conveniente canalizar la salida de «bzr diff» a la entrada estándar (stdin) de «edit-patch», como se ha mostrado. La alternativa sería guardar el archivo las diferencias diff en un archivo temporal y luego apuntar «edit-patch» a este archivo temporal.

source: Seeking Review and Sponsorship
es: Buscar revisor y patrocinador
uk: Пошук Оглядів та Поручительства

source: One of the biggest advantages to using the UDD workflow is to improve quality by seeking review of changes by your peers. This is true whether or not you have upload rights yourself. Of course, if you don't have upload rights, you will need to seek sponsorship.
es: Una de las ventajas más importantes de usar el flujo de trabajo de UDD es mejorar la calidad buscando revisiones de cambios de sus compañeros. Esto es cierto tenga usted o no permisos para subir código. Por supuesto, si no tiene permisos para subir, necesitará buscar un patrocinio.
uk: Однією з великих переваг використання робочого процесу UDD - покращення якості шляхом відкликів про зміни від Ваших друзів і коллег. Це працює поза залежністю від того чи є в Вас права на завантаження. Звичайно, якщо в Вас немає прав на завантаження, то Вам потрібно знайти поручителя.

source: Once you are happy with your fix, and have a branch ready to go, the following steps can be used to publish your branch on Launchpad, link it to the bug issue, and create a *merge proposal* for others to review, and sponsors to upload.
es: Una vez que esté satisfecho con su corrección y tenga la rama lista, los siguientes pasos se pueden usar para publicarla en Launchpad, enlazarla a la incidencia del error y crear una *propuesta de integración* para que otros la revisen y que los patrocinadores la suban.
uk: Як тільки Ви задоволені своїм фіксом й Ваша гілка готова до роботи, потрібно зробити наступні кроки для оголошення своєї гілки на Launchpad, прив’язки її до багу, а потім створити пропозицію про злиття (*merge proposal*) для розгляду іншими користувачами й можливістю завантаження його поручителями.

source: Pushing to Launchpad
es: Empujar a Launchpad
uk: Вивантаження на Launchpad

source: We previously showed you how to :ref:`associate your branch to the bug <link-via-changelog>` using ``dch`` and ``bzr commit``. However, the branch and bug don't actually get linked until you push the branch to Launchpad.
es: Le hemos mostrado previamente cómo :ref:`asociar su rama al error <link-via-changelog>` usando «dch» y «bzr commit». Sin embargo, la rama y el error no se enlazan realmente hasta que no empuja la rama a Launchpad.
uk: Раніше ми показали Вам, як :ref:`пов’язати Вашу гілку з помилкою <link-via-changelog>`, використовуючи команди ``dch`` і ``bzr commit``. Втім гілка й помилка насправді не будуть пов’язані, поки Ви не вивантажите гілку на Launchpad командою push.

source: It is not critical to have a link to a bug for every change you make, but if you are fixing reported bugs then linking to them will be useful.
es: No es crítico tener un enlace a un error para cada cambio que realice, pero si está corrigiendo errores reportados enlazarlos es útil.
uk: Створювати посилання на помилку для кожної Вашої зміни не обов’язково, але якщо Ви виправляєте помилки, для яких є звіт про ваду, то посилання на цей звіт можуть бути корисні.

source: The general form of the URL you should push your branch to is::
es: La forma genera del URL a la que debería empujar su rama es::
uk: Загальний формат URL, на яку Ви повинні вивантажити свою гілку, має такий вигляд::

source: For example, to push your fix for bug 12345 in the Tomboy package for Natty, you'd use::
es: Por ejemplo, para empujar su corrección del error 12345 en el paquete Tomboy para Natty, usaría::
