Repository: canonical/ubuntu-packaging-guide
Catalog: po/*.po
Languages: es, uk

source: Once you know the source package to work on, you will want to get a copy of the code on your system, so that you can debug it. In Ubuntu Distributed Development this is done by :ref:`branching the source package <branching>` branch corresponding to the source package. Launchpad maintains source package branches for all the packages in Ubuntu.
uk: Коли Ви знаєте, над яким пакунком джерельного коду працювати, Ви можете завантажити копію цього пакунку, й зайнятися налагодженням. При розподіленій розробці Ubuntu це робиться за допомогою :ref:`клонування bzr-репозиторію <branching>` цього пакунку. Launchpad підтримує Bazaar-гілки для усіх пакунків в Ubuntu.

source: Once you've got a local branch of the source package, you can investigate the bug, create a fix, and upload your proposed fix to Launchpad, in the form of a Bazaar branch. When you are happy with your fix, you can :ref:`submit a merge proposal <merge-proposal>`, which asks other Ubuntu developers to review and approve your change. If they agree with your changes, an Ubuntu developer will upload the new version of the package to Ubuntu so that everyone gets the benefit of your excellent fix - and you get a little bit of credit. You're now on your way to becoming an Ubuntu developer!
uk: Як тільки Ви отримали локальну копію джерельного коду, Ви можете дослідити помилку, виправити її, та відправити своє виправлення на Launchpad, у вигляді Bazaar-гілки. Щойно Ви станете достатньо впевнені у своєму виправленні, Ви можете відправити :ref:`заявку на злиття <merge-proposal>`, тобто попрохати інших розробників продивитися й схвалити Вашу зміну. У випадку згоди з Вашими змінами вони завантажать Ваші зміни у сховище ПЗ. Від Вашої зміни отримають користь усі — навіть Ви, чиє ім’я буде стояти у переліку змін. Ви тепер відбуваєтеся як розробник Ubuntu!

source: Fixing FTBFS packages
uk: Виправлення пакунків FTBFS (Fails To Build From Source)

source: Before a package can be used in Ubuntu, it has to build from source. If it fails this, it will probably wait in -proposed and will not be available in the Ubuntu archives. You can find a complete list of packages that are failing to build from source at http://qa.ubuntuwire.org/ftbfs/. There are 5 main categories shown on the page:
uk: Перед тим, як пакунок можна буде використовувати в Ubuntu, він повинен бути зібраний з джерельного коду. Якщо це не вдається, пакунок, ймовірно, буде очікувати в -proposed й не буде доступний у архівах Ubuntu. Повний перелік пакунків, які не вдалося зібрати з джерельного коду, можна знайти на http://qa.ubuntuwire.org/ftbfs/. На цій сторінці показано 5 основних категорій:

source: Package failed to build (F): Something actually went wrong with the build process.
uk: Package failed to build (F): Щось справді пішло не так у процесі збірки.

source: Cancelled build (X): The build has been cancelled for some reason. These should probably be avoided to start with.
uk: Скасована збірка (X): збірка була скасована з певної причини. Для початку, з ними ліпше не зв’язуватися.

source: Package is waiting on another package (M): This package is waiting on another package to either build, get updated, or (if the package is in main) one of it's dependancies is in the wrong part of the archive.
uk: Package is waiting on another package (M): Цей пакунок очікує збірки або оновлення іншого пакунку, або (якщо це пакунок в main) одна з його залежностей знаходиться не у тій частині архіву.

source: Failure in the chroot (C): Part of the chroot failed, this is most likely fixed by a rebuild. Ask a developer to rebuild the package and that should fix it.
uk: Проблема в chroot (C): Певна операція над chroot-оточенням зіштовхнулася з помилкою. Частіше за усе виправляється повторним збиранням. Попрохайте розробника запустити перезбірку.

source: Failed to upload (U): The package could not upload. This is usually just a case of asking for a rebuild, but check the build log first.
uk: Помилка при завантаженні (U): Пакунок не може бути завантажений на сервер. Зазвичай у цьому випадку потрібно зробити перезбирання, але перед цим -- перевірте логи збірки.

source: First steps
uk: Перші кроки

source: The first thing you'll want to do is see if you can reproduce the FTBFS yourself. Get the code either by running ``bzr branch lp:ubuntu/PACKAGE`` and then getting the tarball or running ``dget PACKAGE_DSC`` on the .dsc file from the launchpad page. Once you have that, build it in a schroot.
uk: Найперше необхідно повторити FTBFS самостійно. Стягніть код за допомогою ``bzr branch lp:ubuntu/PACKAGE`` й отримайте tar-архів, або запустіть ``dget PACKAGE_DSC`` над .dsc-файлом зі сторінки проєкту на Launchpad. Після цього, створіть chroot-оточення.

source: You should be able to reproduce the FTBFS. If not, check if the build is downloading a missing dependency, which means you just need to make that a build-dependency in debian/control. Building the package locally can also help find if the issue is caused by a missing, unlisted, dependency (builds locally but fails on a schroot).
uk: В Вас має вийти відтворити помилку FTBFS. Якщо ж ні -- перевірте, чи не стягує збірка відсутню залежність: у такому випадку необхідно у файлі debian/control оголосити її як build-depends. Інший варіянт -- спробувати зібрати пакунок локально, що дозволить перевірити відсутні або не вказані залежності (у такому випадку локальна збірка повинна бути успішна, а в schroot -- ні)

source: Checking Debian
uk: Перевірка Debian

source: Once you have reproduced the issue, it's time to try and find a solution. If the package is in Debian as well, you can check if the package builds there by going to http://packages.qa.debian.org/PACKAGE. If Debian has a newer version, you should merge it. If not, check the buildlogs and bugs linked on that page for any extra information on the ftbfs or patches. Debian also maintains a list of command FTBFSs and how to fix them which can be found at https://wiki.debian.org/qa.debian.org/FTBFS, you will want to check it for solutions too.
uk: У випадку, якщо проблему вдалося відтворити -- необхідно почати пошук вирішення. Якщо пакунок також знаходиться в Debian, -- перевірте, можливо в них пакунок збирається нормально: http://packages.qa.debian.org/PACKAGE. Якщо в Debian є новіша версія пакунку, його потрібно об’єднати (merge). Якщо ж ні -- перевірте логи збірки й посилання на відомі проблеми: там може бути додаткова інформація про FTBFS або латки. Debian також підтримує перелік команд різних FTBFS, у якому також є варіянти вирішення різноманітних проблем: https://wiki.debian.org/qa.debian.org/FTBFS.

source: Ubuntu has added arm64 as a architecture recently, but many packages fail to build on it. A full list of the packages not building are at qa.ubuntuwire.org/ftbfs/arm64.html. Many of these are caused by packages using outdated autotools helper files. Any package with the lintian warning ancient-autotools-helper-file or outdated-autotools-helper-file will have this issue. Adding autotools-dev or dh-autoreconf to the build proccess will usually fix this.
uk: Нещодавно в Ubuntu додали підтримку архітектури arm64, але багато пакунків вилітають при збірці. Повний перелік таких пакунків можна знайти на сторінці qa.ubuntuwire.org/ftbfs/arm64.html. Багато проблем викликано використанням застарілих допоміжних файлів autotools. Ця проблема обов’язково виникає з пакунками, для яких засіб lintian видає попередження ancient-autotools-helper-file або outdated-autotools-helper-file. Зазвичай виправлення полягає у додаванні autotools-dev або dh-autoreconf до процесу збірки.

source: Other causes of a package to FTBFS
uk: Інші причини виникнення FTBFS

source: If a package is in main and missing a dependency that is not in main, you will have to file a MIR bug. https://wiki.ubuntu.com/MainInclusionProcess explains the procedure.
uk: Якщо пакунок знаходиться в main, але для нього відсутня залежність не з main, то необхідно відправити MIR-баг: сторінка https://wiki.ubuntu.com/MainInclusionProcess дає опис цієї процедури.

source: Once you have found a fix to the problem, follow the same process as any other bug. Make a patch, add it to a bzr branch or bug, subscribe ubuntu-sponsors, then try to get it included upstream and/or in Debian.
uk: Якщо вдалося виправити проблему, дотримуйтеся такої ж процедури як й при будь-яких інших проблемах: створіть латку, додайте її у гілку або баг bzr, підпишіть ubuntu-sponsors, а потім спробуйте домогтися її додавання у джерельний пакунок і/або в Debian.

source: Don't worry though, you can use `Testdrive`_ or :doc:`chroots <./chroots>` to safely use the development release.
uk: Не бентежтеся, Ви можете скористатися `Testdrive`_ або :doc:`chroots <./chroots>` для безпечного використання розроблюваної версії (релізу)

source: ``gnupg`` -- `GNU Privacy Guard <GPG_>`_ contains tools you will need to create a cryptographic key with which you will sign files you want to upload to Launchpad.
uk: ``gnupg`` -- `GNU Privacy Guard <GPG_>`_ містить інструменти, які знадобляться для створення криптографічного ключа, за допомогою якого Ви будете підписувати файли, які бажаєте завантажити на Launchpad

source: GPG stands for `GNU Privacy Guard <GPG_>`_ and it implements the OpenPGP standard which allows you to sign and encrypt messages and files. This is useful for a number of purposes. In our case it is important that you can sign files with your key so they can be identified as something that you worked on. If you upload a source package to Launchpad, it will only accept the package if it can absolutely determine who uploaded the package.
uk: GPG — абревіятура для `GNU Privacy Guard <GPG_>`_, реалізуючого стандарт OpenPGP, який дозволяє підписувати та шифрувати повідомлення й файли. Це корисно у ряді ситуацій. У нашому випадку важливо, що Ви можете використовувати свій ключ для підписування файлів, щоб можна було переконатися, що саме Ви з ними працювали. Якщо Ви завантажите пакунок джерельного коду на Launchpad, він буде прийнятий лише у тому випадку, якщо можна точно визначити, хто саме відправив пакунок.

source: This will send your key to the Ubuntu keyserver, but a network of keyservers will automatically sync the key between themselves. Once this syncing is complete, your signed public key will be ready to verify your contributions around the world.
uk: Ця команда відправить Ваш ключ на сервер ключів Ubuntu, а мережа серверів ключів автоматично синхронізує ключ між собою. Після того, як ця синхронізація завершиться, Ваш підписаний відкритий ключ буде готовий для засвідчення зробленого Вами вкладу в усьому світі.

source: where <release> is for example `raring`, `saucy`, `trusty` or in the case of Debian maybe `sid`. This will take a while as it will download all the necessary packages for a "minimal installation". These will be cached though.
uk: де <release> — це, наприклад `raring`, `saucy`, `trusty` або, у випадку Debian, `sid`. Виконання команди займе певний час, оскільки будуть завантажені усі пакунки, необхідні для "мінімального встановлення". Втім, при цьому використовується кешування.

source: If you don't already have a Launchpad account, you can easily `create one <LP-AccountCreate_>`_. If you have a Launchpad account but cannot remember your Launchpad id, you can find this out by going to https://launchpad.net/~ and looking for the part after the `~` in the URL.
uk: Якщо в Вас ще немає облікового запису на Launchpad, Ви легко можете `створити його <LP-AccountCreate_>`_. Якщо обліковий запис є, але Ви не пам’ятаєте свій Launchpad ID, його можна дізнатися, зайшовши на https://launchpad.net/~ і поглянувши на частину після `~` в URL.

source: `The new account help page <LP-AccountHelp_>`_ on Launchpad has more information about the process and additional settings you can change.
uk: `Довідкова сторінка нового облікового запису <LP-AccountHelp_>`_ на Launchpad містить додаткову інформацію про процес та додаткові налаштування, які можна зробити.

source: First, you will need to get your fingerprint and key ID.
uk: Спочатку потрібно отримати відбиток та ідентифікатор ключа.

source: Then run this command to submit your key to Ubuntu keyserver::
uk: Потім виконайте цю команду для відправки Вашого ключа на сервер ключів Ubuntu::

source: where ``43CDE61D`` should be replaced by your key ID (which is in the first line of output of the previous command). Now you can import your key to Launchpad.
uk: де ``43CDE61D`` слід замінити на Ваш ідентифікатор ключа (він у першому рядку виводу попередньої команди). Тепер можна імпортувати свій ключ на Launchpad.

source: Launchpad encrypts the email, using your public key, so that it can be sure that the key is yours. If you are using Thunderbird, the default Ubuntu email client, you can install the `Enigmail plugin <Enigmail_>`_ to easily decrypt the message. If your email software does not support OpenPGP encryption, copy the encrypted email's contents, type ``gpg`` in your terminal, then paste the email contents into your terminal window.
uk: Launchpad шифрує пошту, використовуючи Ваш публічний ключ, тож Ви зможете переконатися, що ключ Ваш. Якщо Ви користуєтеся поштовим клієнтом Thunderbird, який використовується в Ubuntu типово, для дешифрування повідомлення можете встановити `доповнення Enigmail <Enigmail_>`_. Якщо Ваша поштова проґрама не підтримує шифрування OpenPGP, скопіюйте зашифрований вміст листа у буфер обміну, наберіть у терміналі ``gpg`` й вставте вміст листа у вікно терміналу.

source: For more information on this process, visit the `creating an SSH keypair <genssh_>`_ page on Launchpad.
uk: Для додаткової інформації про цей процес відвідайте сторінку про `створення ключової пари SSH <genssh_>`_ на Launchpad.

source: Welcome to the Ubuntu Packaging and Development Guide! This is the official place for learning all about Ubuntu Development and packaging. After reading this guide you will have:
uk: Ласкаво просимо у посібник розробника Ubuntu! Це офіційна документація з усіх тем, пов’язаних з розробкою Ubuntu та збиранням пакунків для цієї операційної системи. Після того як прочитаєте цей посібник Ви:

source: heard about the most important players, processes and tools in Ubuntu development,
uk: будете знати про найважливіші засоби, процеси і команди у розробці Ubuntu,

source: your development environment set up correctly,
uk: зможете правильно налаштувати Ваше середовище розробки,

source: a better idea of how to join our community,
uk: дізнаєтеся, як долучитися до нашої спільноти,

source: fixed an actual Ubuntu bug as part of the tutorials.
uk: виправите справжню помилку в Ubuntu у процесі вивчення посібника.

source: Ubuntu is also a community of great people who believe in free software and that it should be accessible for everyone. Its members are welcoming and want you to be involved as well. We want you to get involved, to ask questions, to make Ubuntu better together with us.
uk: Ubuntu також є спільнотою чудових людей, що вірять у те, що проґрамне забезпечення має бути вільним та доступним для усіх. Участники спільноти вітають Вас й бажають, щоб Ви теж до них приєдналися. Ми бажаємо, щоб Ви приймали участь у нашій праці, задавали питання, робили Ubuntu ліпшою разом з нами.

source: If you run into problems: don't panic! Check out the :doc:`communication article<./communication>` and you will find out how to most easily get in touch with other developers.
uk: Якщо в Вас виникнуть складнощі: не хвилюйтеся! Прочитайте :doc:`розділ про комунікацію<./communication>`, й Ви дізнаєтеся, як легко зв’язатися з рештою розробників.

source: You can read this guide offline in different formats, if you install one of the `binary packages <BinPkgs_>`_.
uk: Ви можете прочитати офлайн-версію цього посібника у різних форматах, якщо встановите один з `двійкових пакунків <BinPkgs_>`_.

source: If you want to learn more about building Debian packages, here are some Debian resources you may find useful:
uk: Якщо Ви бажаєте дізнатися більше про збирання пакунків Debian, ось декілька ресурсів Debian, які можуть бути Вам корисними:

source: `How to package for Debian <HowToPackage_>`_;
uk: `Як створювати пакунки для Debian <HowToPackage_>`_;

source: `Debian Policy Manual <Policy_>`_;
uk: `Посібник з політики Debian <Policy_>`_;

source: `Debian New Maintainers' Guide <NewMaintGuide_>`_ — available in many languages;
uk: `Посібник розробника-початківця Debian <NewMaintGuide_>`_ — доступний різними мовами;

source: `Packaging tutorial <PkgTutorial_>`_ (also available as a `package <PkgTutorialPkg_>`_);
uk: `Посібник зі створення пакунків <PkgTutorial_>`_ (також доступний у вигляді `пакунку <PkgTutorialPkg_>`_);

source: `Guide for Packaging Python Modules <PythonModules_>`_.
uk: `Посібник зі створення пакунків для модулів Python <PythonModules_>`_.

source: We are always looking to improve this guide. If you find any problems or have some suggestions, please `report a bug on Launchpad <Bugs_>`_. If you'd like to help work on the guide, `grab the source <Source_>`_ there as well.
uk: Ми завжди намагаємося поліпшити цей посібник. Якщо Ви знайдете якусь помилку, або бажаєте щось запропонувати, будь ласка, `створіть звіт про ваду на Launchpad <Bugs_>`_. Якщо Ви бажали б допомогти у праці над посібником його `джерельний код <Source_>`_ також доступний на Launchpad.

source: Every time a new version of an application is released, or when someone makes a change to the source code that goes into Ubuntu, the source package must be uploaded to Launchpad's build machines to be compiled. The resulting binary packages then are distributed to the archive and its mirrors in different countries. The URLs in ``/etc/apt/sources.list`` point to an archive or mirror. Every day images are built for a selection of different Ubuntu flavours. They can be used in various circumstances. There are images you can put on a USB key, you can burn them on DVDs, you can use netboot images and there are images suitable for your phone and tablet. Ubuntu Desktop, Ubuntu Server, Kubuntu and others specify a list of required packages that get on the image. These images are then used for installation tests and provide the feedback for further release planning.
uk: Кожного разу, коли виходить нова версія додатку, або коли хтось вносить зміни у джерельний код пакунку, що входить у склад Ubuntu, пакунок з джерельним кодом повинен бути завантажений на збірочні комп’ютери Launchpad для компілювання. Готові бінарні пакунки потім потрапляють у сховище ПЗ та його дзеркала у різних країнах. URL в ``/etc/apt/sources.list`` є посиланнями на сховище або його дзеркал. Кожного дня збираються образи для різних версій Ubuntu. Вони можуть бути використані у різних умовах. Є образи, які можна записати на USB-носії або на DVD-диски, образи, які можна використовувати для мережевого завантаження й є образи, призначені для встановлення на телефон або планшет. Ubuntu, серверна версія Ubuntu, Kubuntu й інші гілки мають специфічний перелік необхідних пакунків, які потрапляють в образ. Це образи, які потім використовуються для перевірки встановлення й забезпечують зворотній зв’язок для подальшого планування випуску.

source: Thousands of source packages, billions of lines of code, hundreds of contributors require a lot of communication and planning to maintain high standards of quality. At the beginning and in the middle of each release cycle we have the Ubuntu Developer Summit where developers and contributors come together to plan the features of the next releases. Every feature is discussed by its stakeholders and a specification is written that contains detailed information about its assumptions, implementation, the necessary changes in other places, how to test it and so on. This is all done in an open and transparent fashion, so you can participate remotely and listen to a videocast, chat with attendants and subscribe to changes of specifications, so you are always up to date.
uk: Тисячі пакунків джерельного коду, мільярди рядків коду, сотні розробників потребують більше спілкування й планування для підтримування високих стандартів якості. На початку й у середині кожного циклу випуску організовується Ubuntu Developer Summit, де розробники та участники збираються разом, щоб планувати нові функції у наступних випусках. Кожна функція обговорюється зацікавленими сторонами, і складається специфікація, що містить детальну інформацію про початкові припущення, реалізації, внесення необхідних змін у інші пакунки, про тестування тощо. Усе це робиться прозоро й відкрито, тож Ви можете взяти участь віддалено, подивитися видивотрансляцію, поспілкуватися з участниками та підписатися на специфікації, щоб завжди знати про те що відбувається.

source: Packaging of KDE programs in Ubuntu is managed by the Kubuntu and MOTU teams. You can contact the Kubuntu team on the `Kubuntu mailing list <KubuntuML_>`_ and ``#kubuntu-devel`` Freenode IRC channel. More information about Kubuntu development is on the `Kubuntu wiki page <Wiki_>`_.
uk: Створенням пакунків проґрам KDE в Ubuntu займаються команди Kubuntu і MOTU. Зв’язатися з командою Kubuntu можна через `поштову розсилку Kubuntu <KubuntuML_>`_ й канал Freenode IRC ``#kubuntu-devel``. Додаткова інформація про розробку Kubuntu доступна на `wiki-сторінці Kubuntu <Wiki_>`_.

source: Our packaging follows the practices of the `Debian Qt/KDE Team <QtKDETeam_>`_ and Debian KDE Extras Team. Most of our packages are derived from the packaging of these Debian teams.
uk: При створенні пакунків ми враховуємо практику команд `Debian Qt/KDE <QtKDETeam_>`_ і Debian KDE Extras. Більшість наших пакунків є похідними від пакунків, створених цими командами Debian.

source: Upstream will usually have also put the translation ``.po`` files into the ``po/`` directory. If they do not, check if they are in separate upstream language packs such as the KDE SC language packs. If they are in separate language packs Launchpad will need to associate these together manually, contact `David Planella <dpm_>`_ to do this.
uk: Апстрім зазвичай також поміщає файли перекладів ``.po`` у каталог ``po/``. Якщо їх там немає, перевірте, чи не виділені вони у один з окремих мовних пакунків апстріму, наприклад, у мовні пакунки KDE SC. Якщо вони у окремому мовному пакунку, на Launchpad необхідно збирати їх разом вручну. Проконсультуйтеся з цього приводу з `Девідом Планеллою (David Planella) <dpm_>`_.

source: Library symbols are tracked in ``.symbols`` files to ensure none go missing for new releases. KDE uses C++ libraries which act a little differently compared to C libraries. Debian's Qt/KDE Team have scripts to handle this. See `Working with symbols files <SymbolsFiles_>`_ for how to create and keep these files up to date.
uk: Бібліотекові символи відстежуються за допомогою файлів ``.symbols``, які дозволяють переконатися, що усе на місці. KDE використовує бібліотеки C++, які діють дещо інакше, ніж бібліотеки C. Для Debian команда Qt/KDE створила скрипти, які дозволяють подолати це. Документ `Робота з файлами symbols <SymbolsFiles_>`_ дає опис, як створювати й оновлювати такі файли.

source: ``.la`` libtool files are needed on some non-Linux systems with poor library support but usually cause more problems than they solve on Debian systems. It is a current `Debian goal to remove .la files <LAFileRemoval_>`_ and we should help with this.
uk: ``.la``-файли libtool'у потрібні на деяких не-Linux системах з обмеженою підтримкою бібліотек, але на системах Debian часто створюють більше проблем, ніж вирішують. `Мета Debian відмовитися від .la-файлів <LAFileRemoval_>`_ сьогодні вельми актуальна, й Ви можете допомогти з вирішенням цього завдання.
