Repository: canonical/ubuntu-packaging-guide
Catalog: po/*.po
Languages: es, uk

source: In the first case, the ``install`` file should have one line per file installed, specifying both the file and the installation directory. For example, the following ``install`` file would install the script ``foo`` in the source package's root directory to ``usr/bin`` and a desktop file in the ``debian`` directory to ``usr/share/applications``::
es: En el primer caso, el archivo «install» debería contener solo una linea por cada archivo instalado, indicando tanto el archivo como el directorio de destino. Por ejemplo, el siguiente archivo «install» instalaría el script «foo» que se encuentra en la raíz del paquete en «usr/bin» y el archivo «desktop» del directorio «debian» en «usr/share/applications»::
uk: У першому випадку файл ``install`` повинен містити один рядок для кожного встановлюваного файлу, що вказує як файл, так і встановлювальний каталог. Наприклад, наступний файл ``install`` встановить сценарій ``foo`` з кореневого каталогу пакунку джерельного коду в ``usr/bin`` і desktop-файл з каталогу ``debian`` в ``usr/share/applications``::

source: When a source package is producing multiple binary packages ``dh`` will install the files into ``debian/tmp`` rather than directly into ``debian/<package>``. Files installed into ``debian/tmp`` can then be moved into separate binary packages using multiple ``$package_name.install`` files. This is often done to split large amounts of architecture independent data out of architecture dependent packages and into ``Architecture: all`` packages. In this case, only the name of the files (or directories) to be installed are needed without the installation directory. For example, ``foo.install`` containing only the architecture dependent files might look like::
es: Cuando un paquete fuente crea varios paquetes binarios, «dh» instala los archivos en «debian/tmp» en lugar de «debian/<paquete>». Los archivos instalados en «debian/tmp» pueden entonces moverse a diferentes paquetes binarios usando varios archivos «$nombre_paquete.install». Esto se hace frecuentemente para separar grandes cantidades de datos que son independientes de la arquitectura de paquetes que dependen de la misma, llevándolos a paquetes «Architecture: all». En este caso, solo se necesita el nombre de los archivos (o directorios) a instalar, sin el directorio de instalación. Por ejemplo, un archivo «foo.install» que solo contenga archivos dependientes de la arquitectura se vería así::
uk: Якщо пакунок джерельного коду продукує декілька двійкових пакунків, ``dh`` встановить файли в ``debian/tmp`` замість встановлення безпосередньо в ``debian/<пакунок>``. Файли, встановлені в ``debian/tmp`` потім можна перемістити у окремі двійкові пакунки за допомогою декількох файлів ``$ім’я_пакунку.install``. Це часто робиться, щоб розбити велику кількість незалежних від архітектури даних з залежних від архітектури пакунків у пакунки ``Architecture: all``. У цьому випадку потрібно вказати лише імена встановлюваних файлів (або каталогів), без встановлювального каталогу. Наприклад, ``foo.install``, що містить лише залежні від архітектури файли, може виглядати наподобі::

source: While ``foo-common.install`` containing only the architecture independent file might look like::
es: Por el contrario, un archivo «foo-common.install» que solo contenga archivos que son independientes de la arquitectura se vería así:
uk: У той час як ``foo-common.install``, що містить лише не залежні від архітектури файли, може виглядати так::

source: This would create two binary packages, ``foo`` and ``foo-common``. Both would require their own paragraph in ``debian/control``.
es: Esto crearía dos paquetes binarios, «foo» y «foo-common». Ambos necesitarían su propia sección en el archivo «debian/control».
uk: Будуть створені два двійкові пакунки: ``foo`` і ``foo-common``. Для обох потрібен їх власний абзац в ``debian/control``.

source: See ``man dh_install`` and the `install file section (Section 5.11) <http://www.debian.org/doc/manuals/maint-guide/dother.en.html#install>`_ of the Debian New Maintainers' Guide for additional details.
es: Véase «man dh_install» y la sección sobre el archivo «install» `install file section (Section 5.11) <http://www.debian.org/doc/manuals/maint-guide/dother.en.html#install>`_ de la guía del nuevo mantenedor de Debian para obtener más información.
uk: Для додаткових подробиць дивіться ``man dh_install`` і `розділ про файл install (Розділ 5.11) <http://www.debian.org/doc/manuals/maint-guide/dother.en.html#install>`_ в «Debian New Maintainers' Guide».

source: The watch file
es: El archivo de avisos («watch»)
uk: Файл watch

source: The ``debian/watch`` file allows us to check automatically for new upstream versions using the tool ``uscan`` found in the ``devscripts`` package. The first line of the watch file must be the format version (3, at the time of this writing), while the following lines contain any URLs to parse. For example::
es: El archivo «debian/watch» permite comprobar automáticamente si existe una nueva versión del proyecto original con la herramienta «uscan», localizada en el paquete «devscripts». La primera línea del archivo «watch» debe describir la versión del formato (3, en el momento de escribir esto), mientras que el resto de líneas contienen las URLs a analizar. Por ejemplo::
uk: Файл ``debian/watch`` дозволяє автоматично перевіряти наявність нових версій в апстрімі за допомогою інструменту ``uscan`` з пакунку ``devscripts``. Першим рядком файлу watch повинна бути версія формату (3 на мить написання цього посібника), а наступні рядки містять будь-які URL для аналізу. Наприклад::

source: Running ``uscan`` in the root source directory will now compare the upstream version number in ``debian/changelog`` with the latest available upstream version. If a new upstream version is found, it will be automatically downloaded. For example::
es: Ejecutando «uscan» en el directorio raíz del paquete comparará el número de versión original que se encuentra en «debian/changelog» con el último disponible en el proyecto original. Si se encuentra una versión más moderna del proyecto original, se descargará automáticamente. Por ejemplo::
uk: Запуск ``uscan`` у кореневому каталозі джерельних кодів порівняє номер апстрім-версії у ``debian/changelog`` з останньою доступною в апстрімі версією. Якщо в апстрімі знайдена нова версія, вона буде автоматично завантажена. Наприклад::

source: If your tarballs live on Launchpad, the ``debian/watch`` file is a little more complicated (see `Question 21146`_ and `Bug 231797`_ for why this is). In that case, use something like::
es: Si sus archivos tar residen en Launchpad, el archivo «debian/watch» es algo más complicado (véase `Question 21146`_ y `Bug 231797`_ para saber por qué). En este caso, usamos algo como::

source: For further information, see ``man uscan`` and the `watch file section (Section 4.11) <http://www.debian.org/doc/debian-policy/ch-source.html#s-debianwatch>`_ of the Debian Policy Manual.
es: Para más información, véase «man uscan» y la sección sobre el archivo `watch file section (Section 4.11) <http://www.debian.org/doc/debian-policy/ch-source.html#s-debianwatch>`_ del manual de normas de Debian.
uk: Додаткові відомості дивіться в ``man uscan`` і у `розділі про файл watch (Розділ 4.11) <http://www.debian.org/doc/debian-policy/ch-source.html#s-debianwatch>`_ «Debian Policy Manual».

source: For a list of packages where the ``watch`` file reports they are not in sync with upstream see `Ubuntu External Health Status <http://qa.ubuntuwire.org/uehs/no_updated.html>`_.
es: Para obtener una lista de los paquetes de los que el archivo «watch» informa no estar sincronizados con las versiones originales véase la página `Ubuntu External Health Status <http://qa.ubuntuwire.org/uehs/no_updated.html>`_. (estado de salud externa de Ubuntu, en inglés)_.
uk: Перелік пакунків, для яких файл ``watch`` повідомляє про те, що вони не синхронізовані з апстрімом, дивіться `Ubuntu External Health Status <http://qa.ubuntuwire.org/uehs/no_updated.html>`_.

source: The source/format file
es: El archivo de formato («source/format»)
uk: Файл source/format

source: This file indicates the format of the source package. It should contain a single line indicating the desired format:
es: Este archivo indica el formato fuente del paquete. Solo debería contener una línea indicando el formato deseado:
uk: Цей файл вказує формат пакунку джерельного коду. Він повинен містити один рядок, що показує вибраний формат:

source: ``3.0 (native)`` for Debian native packages (no upstream version)
es: «3.0 (native)» para paquetes nativos de Debian (sin versión en upstream)
uk: ``3.0 (native)`` для «рідних» пакунків Debian (апстрім-версія відсутня)

source: ``3.0 (quilt)`` for packages with a separate upstream tarball
es: «3.0 (quilt)» para paquetes con un archivo tar de upstream independiente.
uk: ``3.0 (quilt)`` для пакунків з окремим тарболом з апстріму

source: ``1.0`` for packages wishing to explicitly declare the default format
es: «1.0» para paquetes que desean declarar explícitamente el formato por defecto
uk: ``1.0`` для пакунків, бажаючих явно вказати типовий формат

source: Currently, the package source format will default to 1.0 if this file does not exist. You can make this explicit in the source/format file. If you choose not to use this file to define the source format, Lintian will warn about the missing file. This warning is informational only and may be safely ignored.
es: Actualmente, el formato fuente del paquete será por defecto 1.0 si no existe este archivo. Se puede establecer esto explícitamente en el archivo «source/format». Si elige no usar este archivo para definir el formato, Lintian mostrará una advertencia sobre su ausencia. La advertencia es de carácter informativo y puede ser ignorada.
uk: На цей час обирається типовий формат пакунку джерельного коду 1.0, якщо цей файл відсутній. У файлі source/format можна вказати його явно. Якщо Ви не використовуєте цей файл для вказування формату джерельного коду, Lintian видасть попередження про відсутність файлу. Це чисто інформаційне попередження і його можна без побоювань знехтувати.

source: You are encouraged to use the newer 3.0 source format. It provides a number of new features:
es: Se le anima a utilizar el nuevo formato fuente 3.0 . Proporciona una serie de nuevas características:
uk: Рекомендується використовувати більш новий формат 3.0. Він надає деякі нові можливості:

source: Support for additional compression formats: bzip2, lzma and xz
es: Soporte para formatos de compresión adicionales: bzip2, lzma y xz
uk: Підтримка додаткових форматів стиснення: bzip2, lzma і xz

source: Support for multiple upstream tarballs
es: Soporte para varios archivos tar de upstream
uk: Підтримка декількох архівів з оригінальним джерельним кодом

source: Not necessary to repack the upstream tarball to strip the debian directory
es: No es necesario volver a empaquetar los archivos tar de upstream para eliminar el directorio debian
uk: Необов’язково перепаковувати архів з оригінальним джерельним кодом, щоб вилучити директорію ``debian``.

source: Debian-specific changes are no longer stored in a single .diff.gz but in multiple patches compatible with quilt under ``debian/patches/``
es: Los cambios específicos de Debian ya no se guardan en un único archivo .diff.gz, sino en varios parches compatibles con quilt en «debian/patches/»
uk: Специфічні для Debian зміни тепер зберігаються не в одному файлі .diff.gz, а у вигляді декількох латок, сумісних з quilt, у каталозі ``debian/patches/``

source: http://wiki.debian.org/Projects/DebSrc3.0 summarizes additional information concerning the switch to the 3.0 source package formats.
es: http://wiki.debian.org/Projects/DebSrc3.0 contiene información adicional concerniente a la migración al formato de paquetes fuente 3.0.

source: See ``man dpkg-source`` and the `source/format section (Section 5.21) <http://www.debian.org/doc/manuals/maint-guide/dother.en.html#sourcef>`_ of the Debian New Maintainers' Guide for additional details.
es: Véase «man dpkg-source» y la sección sobre el archivo «source/format» `source/format section (Section 5.21) <http://www.debian.org/doc/manuals/maint-guide/dother.en.html#sourcef>`_ de la guía del nuevo mantenedor de Debian para más detalle.

source: Additional Resources
es: Recursos adicionales
uk: Додаткові ресурси

source: In addition to the links to the Debian Policy Manual in each section above, the Debian New Maintainers' Guide has more detailed descriptions of each file. `Chapter 4, "Required files under the debian directory" <http://www.debian.org/doc/maint-guide/dreq.en.html>`_ further discusses the control, changelog, copyright and rules files. `Chapter 5, "Other files under the debian directory" <http://www.debian.org/doc/maint-guide/dother.en.html>`_ discusses additional files that may be used.
es: Además de los enlaces hacia el manual de normas de Debian en cada sección de arriba, la guía del nuevo mantenedor de Debian contiene descripciones más detallas de cada archivo. El capítulo 4 «Archivos necesarios del directorio debian» `Chapter 4, "Required files under the debian directory" <http://www.debian.org/doc/maint-guide/dreq.en.html>`_ explica con mayor profundidad los archivos de control («control»), de registro de cambios («changelog»), de derechos de autor («copyright») y de reglas («rules»). El capítulo 5, «Otros archivos dentro del directorio debian»`Chapter 5, "Other files under the debian directory" <http://www.debian.org/doc/maint-guide/dother.en.html>`_ documenta archivos adicionales que podrían utilizarse.

source: Fixing a bug in Ubuntu
es: Corregir un fallo en Ubuntu
uk: Виправлення помилок в Ubuntu

source: Introduction
es: Introducción
uk: Вступ

source: If you followed the instructions to :doc:`get set up with Ubuntu Development<./getting-set-up>`, you should be all set and ready to go.
es: Si se han seguido las instrucciones de :doc:`ponerse en marcha con el desarrollo de Ubuntu<./getting-set-up>`, debería estar preparado para comenzar.
uk: Якщо Ви дотримувалися інструкцій з :doc:`підготовки до розробки Ubuntu<./getting-set-up>`, усе повинно бути вже готово до роботи.

source: As you can see in the image above, there is no surprises in the process of fixing bugs in Ubuntu: you found a problem, you get the code, work on the fix, test it, push your changes to Launchpad and ask for it to be reviewed and merged. In this guide we will go through all the necessary steps one by one.
es: Como se puede observar en la imagen superior, no hay sorpresas en el proceso de corrección de fallos en Ubuntu: se encuentra un problema, se descarga el código fuente, se trabaja en la solución, se prueba, se envían los cambios a Launchpad y se pide que sea revisado e integrado. Durante esta guía se pasará por todos estos pasos, uno a uno.
uk: Як Ви можете бачити на картинці вище, у процесі виправлення помилок в Ubuntu немає ніяких несподіванок: Ви знаходите проблему, отримуєте код, виправляєте його, тестуєте, відправляєте на Launchpad й прохаєте, щоб його перевірили та об’єднали з основним кодом. У цьому посібнику ми пройдемо через усі необхідні кроки, один за іншим.

source: Finding the problem
es: Encontrar el problema
uk: Пошук проблеми

source: There are a lot of different ways to find things to work on. It might be a bug report you are encountering yourself (which gives you a good opportunity to test the fix), or a problem you noted elsewhere, maybe in a bug report.
es: Hay muchas formas de encontrar cosas en las que trabajar. Puede ser reportando un error que usted mismo haya encontrado (lo que le da una buena oportunidad de probar la solución), o un problema que haya encontrado en otro lugar, tal vez en un informe de error.
uk: Існують різні способи знайти, над чим можна попрацювати. Це може бути помилка, яку Ви виявили самі (що дає Вам відмінну можливість перевірити своє виправлення) або проблема, яку Ви помітили десь ще, наприклад у звіті про ваду.

source: `Harvest <http://harvest.ubuntu.com/>`_ is where we keep track of various TODO lists regarding Ubuntu development. It lists bugs that were fixed upstream or in Debian already, lists small bugs (we call them 'bitesize'), and so on. Check it out and find your first bug to work on.
es: `Harvest <http://harvest.ubuntu.com/>`_ es donde se hace el seguimiento de varias listas TODO (para hacer) relacionadas con el desarrollo de Ubuntu. Contiene errores que ya han sido corregidos en upstream o en Debian, pequeños errores denominados de bocado («bitesize») y otros. Compruébelo y encuentre su primer error en el que trabajar.
uk: `Harvest <http://harvest.ubuntu.com/>`_ зберігає різні переліки TODO, що стосуються розробки Ubuntu. Це переліки помилок, які були вже виправлені у апстрімі або в Debian, переліки невеликих помилок (ми називаємо їх «bitesize») й так далі. Продивіться їх та знайдіть помилку, виправленням якої Ви бажаєте зайнятися.

source: Figuring out what to fix
es: Averiguar qué se debe corregir
uk: З’ясування того, що потрібно виправити

source: If you don't know the source package containing the code that has the problem, but you do know the path to the affected program on your system, you can discover the source package that you'll need to work on.
es: Si no se conoce el paquete fuente que contiene el código con el problema, pero sí la ruta al programa afectado en su sistema, puede encontrar el paquete en el que necesitará trabajar.
uk: Якщо Ви не знаєте, у якому пакунку джерельного коду міститься помилка, але знаєте шлях до цього застосунку у Вашій системі, то Ви зможете знайти пакунок джерельного коду, над яким потрібно попрацювати.

source: Let's say you've found a bug in Tomboy, a note taking desktop application. The Tomboy application can be started by running ``/usr/bin/tomboy`` on the command line. To find the binary package containing this application, use this command::
es: Digamos que ha encontrado un error en Tomboy, una aplicación de escritorio para tomar notas. Tomboy se puede iniciar ejecutando con «/usr/bin/tomboy» desde la línea de órdenes. Para conocer el paquete binario al que pertenece esta aplicación, use la siguiente orden::
uk: Припустимо, Ви виявили помилку в Tomboy, застосунку для створення нотаток на стільниці. Додаток Tomboy можна запустити, виконавши ``/usr/bin/tomboy`` у командному рядку. Щоб знайти двійковий пакунок, що містить цей застосунок, використовуйте таку команду::

source: This would print out::
es: Esto mostrará::
uk: Команда виведе таку інформацію::

source: Note that the part preceding the colon is the binary package name. It's often the case that the source package and binary package will have different names. This is most common when a single source package is used to build multiple different binary packages. To find the source package for a particular binary package, type::
es: Tenga en cuenta que la parte que precede a los dos puntos es el nombre del paquete binario. Es muy frecuente que el nombre del paquete binario y del paquete fuente sean diferentes. Esto es muy común cuando un solo paquete fuente se utiliza para construir varios paquetes binarios. Para conocer el nombre del paquete fuente de un paquete binario, ejecute::
uk: Зверніть увагу на те, що частина, передуюча двокрапці, є іменем двійкового пакунку. Часто буває так, що у пакунку джерельного коду і двійкового пакунку різні імена. Частіше за усе, це відбувається, коли один пакунок джерельного коду використовується, щоб створити декілька різних двійкових пакунків. Щоб знайти джерельний пакунок для певного двійкового пакунку, уведіть::

source: ``apt-cache`` is part of the standard installation of Ubuntu.
es: ``apt-cache`` es parte de la instalación estándar de Ubuntu.
uk: Команда ``apt-cache`` встановлена в Ubuntu типово.

source: Getting the code
es: Obtener el código
uk: Отримання коду

source: Once you know the source package to work on, you will want to get a copy of the code on your system, so that you can debug it. In Ubuntu Distributed Development this is done by :ref:`*branching* the source package <branching>` branch corresponding to the source package. Launchpad maintains source package branches for all the packages in Ubuntu.
es: Una vez que se conozca el nombre del paquete fuente, el siguiente paso será obtener el código fuente para poder analizarlo. En el mundo del desarrollo de Ubuntu distribuido eso se hace :ref:`*bifurcando* el paquete fuente <branching>` creando una rama del paquete fuente. Launchpad mantiene ramas de los fuentes de todos los paquetes de Ubuntu.

source: Once you've got a local branch of the source package, you can investigate the bug, create a fix, and upload your proposed fix to Launchpad, in the form of a Bazaar branch. When you are happy with your fix, you can :ref:`submit a *merge proposal* <merge-proposal>`, which asks other Ubuntu developers to review and approve your change. If they agree with your changes, an Ubuntu developer will upload the new version of the package to Ubuntu so that everyone gets the benefit of your excellent fix - and you get a little bit of credit. You're now on your way to becoming an Ubuntu developer!
es: Una vez se tenga una versión local de ese paquete, puede investigar el problema, hacer una corrección y subir la solución propuesta a Launchpad, como una rama de Bazaar. Cuando se sienta satisfecho con la corrección, puede :ref:«enviar una *petición de integración* <merge-proposal>», que lo que hace es pedir a otros desarrolladores de Ubuntu que revisen y aprueben los cambios. Si están de acuerdo, un desarrollador de Ubuntu subirá la nueva versión del paquete a Ubuntu de forma que todos se beneficiende su excelente trabajo, y recibirá cierto crédito. ¡Ya está en camino de convertirse en un desarrollador de Ubuntu!

source: We'll describe specifics on how to branch the code, push your fix, and request a review in the following sections.
es: En las siguientes secciones se describe en detalle cómo bifurcar el código, subir la corrección y solicitar una revisión.
uk: Ми дамо опис специфіки завантаження коду, відправки змін, та створення заявки на перегляд у наступних розділах.

source: Work on a fix
es: Trabajar en una solución
uk: Виправлення помилки

source: There are entire books written about finding bugs, fixing them, testing them, etc. If you are completely new to programming, try to fix easy bugs such as obvious typos first. Try to keep changes as minimal as possible and document your change and assumptions clearly.
es: Se han escrito libros completos sobre cómo encontrar errores, cómo arreglarlos, cómo probarlos, etc. Si completamente novato en programación, intente primero encontrar errores simples como erratas obvias en los textos. Intente mantener tan reducidos como sea posible y documente claramente tanto los cambios como los supuestos que haga.
uk: Є цілі книги про знаходження помилок, їх виправлення, тестування й так далі. Якщо Ви початківець у проґрамуванні, спробуйте виправляти нескладні помилки, такі як очевидні друкарські помилки. Намагайтеся робити Ваші зміни мінімальними й чітко документувати Ваші зміни та припущення.

source: Before working on a fix yourself, make sure to investigate if nobody else has fixed it already or is currently working on a fix. Good sources to check are:
es: Antes de comenzar a trabajar en una solución, asegúrese de investigar si alguien más ya lo ha solucionado o está trabajando en una solución. Algunos buenos lugares para buscar son:
uk: Перед тим, як працювати над помилкою, переконайтеся, що вона не виправлена вже кимось іншим, й ніхто не займається на дану мить її виправленням. Не завадить перевірити наступні джерела:
